[
    {
        "job_title": "Software Engineer – Entry Level",
        "company_name": "General Dynamics Mission Systems",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "At General Dynamics Mission Systems, we rise to the challenge each day to ensure the safety of those that lead, serve, and protect the world we live in. We do this by making the world’s most advanced defense platforms even smarter. Our engineers redefine what’s possible and our manufacturing team brings it to life, building the brains behind the brawn on submarines, ships, combat vehicles, aircraft, satellites, and other advanced systems. We pride ourselves in being a great place to work with this shared sense of purpose, committed to a diverse and exciting employee experience that drives innovation and creates a community where all feel welcome and a part of something amazing. We offer highly competitive benefits and a flexible work environment where contributions are recognized and rewarded. To see more about our benefits, visit https://gdmissionsystems.com/careers/why-work-for-us/benefits General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran Requires a Bachelor’s degree in Software Engineering, or a related Science, Engineering or Mathematics field. Agile experience preferred. Due to the nature of work performed within our facilities, U.S. citizenship is required. ROLE AND POSITION OBJECTIVES:As a software engineer for Cyber Systems, you’ll be a member of a cross functional team responsible for creating our PitBull and truMLS products.  What sets you apart:Clear understanding of the software engineering concepts, principles, theories, software development process, and agile methodologyClear understanding of the software development process, with agile experienceAbility to grasp and apply new information quickly and handle increasing responsibilities with growing complexityTeam player who thrives in collaborative environments and revels in team successCommitment to ongoing professional development for yourself and othersOur Commitment to You:An exciting career path with opportunities for continuous learning and development.Research oriented work, alongside award winning teams developing practical solutions for our nation’s securityFlexible schedules with every other Friday off work, if desired (9/80 schedule)Competitive benefits, including 401k matching, flex time off, paid parental leave, healthcare benefits, health & wellness programs, employee resource and social groups, and moreSee more at gdmissionsystems.com/careers/why-work-for-us/benefits Workplace Options:Option to work remote. While on-site, you will be a part of the Dedham, MA facility.  \n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Dedham, MA",
        "url": "https://careers-gdms.icims.com/jobs/61044/job"
    },
    {
        "job_title": "Entry level Software programmer (Remote)",
        "company_name": "SynergisticIT",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "SYNERGISTICIT is aware that the Job Market is Challenging because of Tech Layoffs. The Job market is flooded with hundreds and thousands of laid-off Jobseekers competing with existing Jobseekers. For entry-level Job seekers to get client interviews and jobs they need to differentiate themselves by ensuring they have exceptional skills and technologies to be noticed by clients.Since 2010 we have helped Jobseekers differentiate themselves by providing clients with candidates who have the requisite skills and experience to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a Job we make careers. All Positions are open for all visas and US citizens We at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped thousands of candidates get jobs at technology clients like Apple, Google, and Paypal, western union, Client, visa, Walmart labs, etc., to name a few. We have an excellent reputation with the clients. Currently, we are looking for Entry Level software programmer(Remote)Who Should Apply Recent Computer Science/Engineering /Mathematics/Statistics or Science Graduates looking to make their careers in IT Industry We welcome candidates with all visas and citizens to apply. We assist in filing for STEM extension and also for H1b and Green card filing to CandidatesWe also offer Skill enhancement programs for candidates who are either missing skills or lacking Industry/Client experience with Projects and skills. Candidates have difficulty finding jobs or cracking interviews or want to improve their skill portfolio. If they are qualified with enough skills and have hands-on project work with clients then no need for skill enhancement.Candidates can benefit from skill enhancement if they fall into the below categories.Candidates who Lack Experience or are fresher with No actual Job experience with projects with clients who Have had a break in careers Lack Technical Competency or skills being demanded by clients Different visa candidates (Like OPT/H4EAD/L2EAD) who want to get employed and settle down in the USA please check the below links to see success outcomes of our candidates (url removed)Watch the below videos of us participating in Industry events with the Top companies in Technology at Oracle Cloud World/Oracle Java One (Las Vegas) and at Gartner Data Analytics Summit (Florida)Oracle Cloud World Event (OCW) Las Vegas 2022 | SynergisticIT - YouTube (url removed)(url removed) (url removed)(url removed) SynergisticIT at Gartner Data and Analytics Summit 2023 - YouTube(url removed) (url removed) (url removed)If you have relevant skills and industry experience, please apply if not then candidates can opt for Skill enhancement.For getting help with interviews please visit(url removed)REQUIRED SKILLS For Java /Software Programmers Bachelor's degree or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT Highly motivated, self-learner, and technically inquisitive Experience in programming language Java and understanding of the software development life cycle Project work on the skills Knowledge of Core Java, java script, C++ or software programming Spring boot, Micro-services, Docker, Jenkins and REST API's experience Excellent written and verbal communication skillsFor data Science/Machine learningRequired Skills Bachelor's degree or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT Project work on the technologies needed Highly motivated, self-learner, and technically inquisitive Experience in the programming language Java and understanding of the software development life cycle Knowledge of Statistics, SAS, Python, Computer Vision, and data visualization tools Excellent written and verbal communication skillsPreferred skills: NLP, Text mining, Tableau, Power BI, Time series analysisPlease understand skills and relevant experience on real-world projects are required by clients for selection even if it's a Junior or entry-level position the additional skills and Project work with hands-on experience building projects at the client site are the only way a candidate can be picked by clients. If not having the skills or hands-on project work at the client site, candidates can opt for skill enhancement to gain the required skills and project work. No third-party candidates or c2c candidatesplease only apply to the postingNo phone calls, please. Shortlisted candidates would be reached out to.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "San Diego, CA",
        "url": "https://www.resume-library.com/job/view/123808184/Entry-level-Software-programmer--Remote-"
    },
    {
        "job_title": "Software Engineer (Entry Level) - US/Canada",
        "company_name": "Pattern Learning AI - Career & Tech Recruitment Reimagined!",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "This is a remote position.Software Engineer (Entry Level) - US/Canada Residents only, Full-Time, Salary $70K-$80KMinimum 1 year of work experience - fully remote position. Freshers are also encouraged to apply.About us: The Future of AI is Patterned We are a stealth-mode technology startup that is revolutionizing the way AI is used. Our platform uses pattern recognition to train AI models that are more accurate, efficient, and robust than ever before.We are backed by top investors and we are hiring for almost everything! If you are passionate about AI and want to be a part of something big, then we want to hear from you.Make a positive impact on the world. Be a part of a fast-growing startup. If you are interested in learning more, please visit our website.We are looking for people who are:Passionate about AI.Excellent problem solvers.Team players.Driven to succeed.RequirementsJob Description:We are looking for a talented and motivated Entry Level Software Engineer to join our team. As an Entry Level Software Engineer, you will play a vital role in the design, development, and maintenance of our software applications. You will collaborate with experienced engineers and contribute to the entire software development lifecycle. This is an excellent opportunity to grow your skills, gain hands-on experience, and work on exciting projects in a supportive and innovative environment.Responsibilities:Collaborate with the development team to understand project requirements and objectives Participate in the design and implementation of software applications Write clean, efficient, and well-documented code following best practices Assist in the integration of APIs and third-party services Conduct testing and debugging to ensure the functionality and performance of applications Collaborate with designers to ensure a visually appealing and user-friendly interface Contribute to code reviews and provide constructive feedback to improve code quality Stay up-to-date with the latest software development trends and technologies Document technical specifications and project details Qualifications:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience) Solid understanding of software development principles and best practices Proficiency in at least one programming language (e.g., Java, C++, Python, Ruby) Familiarity with web development languages such as HTML, CSS, and JavaScript Knowledge of databases and experience with SQL or NoSQL Understanding of version control systems (e.g., Git) Strong problem-solving and analytical skills Excellent communication and collaboration abilities Ability to work independently and within a team Eagerness to learn and adapt to new technologies Preferred Qualifications:Experience with software development projects (personal or professional) Familiarity with web frameworks (e.g., Spring, Django, Ruby on Rails) Knowledge of front-end frameworks/libraries like React, Angular, or Vue.js Understanding of Agile development methodologies Basic understanding of software testing principles and methodologies BenefitsSpecial Benefits you will love:Flexible vacation, unlimited paid holidays, and paid sick days 401(k) with up to 2% employer match Health, vision, and dental insurance Why Patterned Learning AI?Patterned Learning AI is made up of incredibly bright, mission-driven coworkers who are passionate about using technology to solve real-world problems---and we're growing quickly. To continue building an engaging and dynamic organization, we're committed to giving everyone the support they need to do great work.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. Patterned Learning AI is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Dallas, TX",
        "url": "https://patternedlearning.zohorecruit.com/jobs/Careers/729035000014691901/Software-Engineer-Entry-Level---US-Canada?source=LinkedIn&embedsource=LinkedIn%2BLimited%2BListings"
    },
    {
        "job_title": "Full Stack Web Developer (Entry Level), US/Canada",
        "company_name": "SkyRecruitment",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Full Stack Web Developer (Entry Level), US/Canada Residents only, Full-Time, Salary $60K-$70KMinimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: SkyRecruitment LLC is a staffing & recruitment agency connecting employers with world-class talent in the tech industry. Our industry delivers services tailored to the unique qualities and specifications of our selected client base.Job ResponsibilitiesJob Description:This position is ideal for individuals who are passionate about both front-end and back-end development and want to gain valuable experience in a supportive and collaborative environment.Responsibilities:Collaborate with the development team to design, develop, and maintain web applicationsImplement responsive and user-friendly front-end designs using HTML, CSS, and JavaScriptDevelop server-side code and APIs using programming languages such as Python, Ruby, or Node.jsDesign and maintain databases and perform database queries for data retrieval and manipulationWrite clean, modular, and efficient code for both front-end and back-end componentsParticipate in code reviews and provide constructive feedbackTroubleshoot and debug issues to ensure optimal performance and user experienceStay up-to-date with emerging web technologies and industry trendsContribute to improving the overall web development processRequirements:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience)Strong knowledge of HTML5, CSS3, and JavaScriptExperience with front-end frameworks (such as React, Angular, or Vue.js)Proficiency in at least one server-side programming language (Python, Ruby, Node.js, etc.)Familiarity with databases and SQLUnderstanding of RESTful APIs and web servicesExperience with version control systems (e.g., Git)Good problem-solving and analytical skillsExcellent communication and teamwork abilitiesPreferred Qualifications:Familiarity with back-end frameworks (such as Django, Ruby on Rails, Express, etc.)Knowledge of NoSQL databases (MongoDB, Firebase, etc.)Understanding of web security best practicesFamiliarity with cloud platforms (AWS, Azure, Google Cloud)Experience with testing frameworks (Jest, Mocha, Jasmine, etc.)Projects or personal portfolio showcasing your full-stack development skillsQualifications And ExperienceSpecial Benefits you will love:Flexible vacation paid unlimited holidays and paid sick daysHealth, vision, and dental insurance Why SkyRecruitment LLC?SkyRecruitment LLC's recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. SkyRecruitment is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Hastings, NE",
        "url": "https://www.careers-page.com/sky-recruitment-2/job/LR9W586X?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "Python Developer (Entry Level) - US/Canada",
        "company_name": "Pattern Learning AI - Career & Tech Recruitment Reimagined!",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "This is a remote position.Python Developer (Entry Level) - US/Canada Residents only, Full-Time, Salary $57K-$70KMinimum 1 year of work experience - fully remote position. Freshers are also encouraged to apply.About us: The Future of AI is Patterned We are a stealth-mode technology startup that is revolutionizing the way AI is used. Our platform uses pattern recognition to train AI models that are more accurate, efficient, and robust than ever before.We are backed by top investors and we are hiring for almost everything! If you are passionate about AI and want to be a part of something big, then we want to hear from you.Make a positive impact on the world. Be a part of a fast-growing startup. If you are interested in learning more, please visit our website.We are looking for people who are:Passionate about AI.Excellent problem solvers.Team players.Driven to succeed.RequirementsJob Description:We are seeking a talented and motivated Entry Level Python Developer to join our dynamic team. In this role, you will work closely with senior developers and other cross-functional teams to develop and maintain high-quality Python applications. As an Entry-level Python Developer, you will have the opportunity to learn and grow your skills while contributing to exciting projects.Responsibilities:Collaborate with senior developers to design and develop Python applications. Write clean, efficient, and maintainable code that follows best practices. Participate in code reviews and provide constructive feedback. Debug and fix issues in the existing codebase. Assist in testing and quality assurance processes. Stay updated with the latest trends and technologies in Python development. Requirements:Bachelor's degree in Computer Science, Software Engineering, or a related field. Strong knowledge of Python programming language. Familiarity with web frameworks such as Django or Flask. Experience with version control systems, preferably Git. Basic understanding of front-end technologies (HTML, CSS, JavaScript). Good problem-solving and analytical skills. Excellent communication and teamwork abilities. Nice to have:Experience with database systems such as MySQL, PostgreSQL, or MongoDB. Knowledge of RESTful APIs and integration. Familiarity with cloud platforms such as AWS or Azure. Understanding of agile development methodologies. BenefitsSpecial Benefits you will love:Flexible vacation, unlimited paid holidays, and paid sick days 401(k) with up to 2% employer match Health, vision, and dental insurance Why Patterned Learning AI?Patterned Learning AI is made up of incredibly bright, mission-driven co-workers who are passionate about using technology to solve real-world problems---and we're growing quickly. To continue building an engaging and dynamic organization, we're committed to giving everyone the support they need to do great work.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. Patterned Learning AI is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "New York, NY",
        "url": "https://patternedlearning.zohorecruit.com/jobs/Careers/729035000014710580/Python-Developer-Entry-Level---US-Canada?source=LinkedIn&embedsource=LinkedIn%2BLimited%2BListings"
    },
    {
        "job_title": "Full Stack Developer",
        "company_name": "TouchSuite",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Internet Publishing",
        "description": "Full-Stack DeveloperTouchSuite facilitates hundreds of millions of dollars every day in commerce across the globe. We are a market leader in deploying kiosk technology to independent business owners across North America, and additionally enable significant eCommerce and in-store transactions using the most innovative and secure technologies. To offer business owners and sales partners superior solutions, we partner with the world’s most influential forces in Payments: Visa, Mastercard, American Express, Discover, Wells Fargo Bank and others. Our service platform integrates tools from Salesforce.com, Trustadvisor and others to support and measure the effectiveness of our service.We are seeking a talented Full-Stack Developer to join our team in Boca Raton. The ideal candidate will be responsible for developing, maintaining, and enhancing applications that play a critical role in our data management and Salesforce implementation efforts. As a Full-Stack Developer, you will be involved in the entire software development lifecycle, from concept to deployment.Key Responsibilities:Work closely with our cross-functional teams to understand business requirements and translate them into technical solutions.Develop and maintain software applications, including pulling data from various platforms and integrating it into our systems.Assist in the build-out and customization of Salesforce implementation to meet specific needs of our merchant services business.Design, develop, and implement efficient, scalable, and robust software solutions.Collaborate with other team members to troubleshoot and optimize existing applications.Stay updated on industry best practices and emerging technologies to ensure the continued innovation of our solutions.Qualifications:Bachelor's degree in Computer Science or a related field (or equivalent work experience).Proven experience as a Full-Stack Developer with a strong focus on both front-end and back-end development.Proficiency in programming languages such as JavaScript, Python, Java, or similar.Experience with web development frameworks like React, Angular, or Vue for the front-end.Familiarity with databases, data modeling, and SQL.Previous experience working with Salesforce or other CRM platforms is a plus.Strong problem-solving and communication skills.Ability to work effectively in a collaborative team environment.Why Work at TouchSuite:Health Benefits, 401k, Flex PTO, and more.We have a fun, entrepreneurial and innovative environment where everyone shares a passion to win.Beautiful, brand-new office – modern & spacious, complete with a ‘Zen Garden’ and an indoor basketball court.The opportunity to be a true entrepreneur and make a real impact while learning real-world skills.The opportunity to be part of something that is revolutionizing industries.Excellent Leadership Team.Powered by JazzHRBMydQ7WYX4\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Boca Raton, FL",
        "url": "https://www.linkedin.com/jobs/view/full-stack-developer-at-touchsuite-3731756531?refId=XJzLqwhD9ry%2FzX9YcQ1WIA%3D%3D&trackingId=eQodSjNOpb%2BzG5s%2BzW4ljg%3D%3D&position=6&pageNum=3&trk=public_jobs_jserp-result_search-card"
    }
]