[
    {
        "job_title": "Web Developer Intern (Python) - Remote",
        "company_name": "MonetizeMore",
        "listing_details": "Seniority level: Internship, Employment type: Internship, Job function: Engineering and Information Technology, Industries: Advertising Services",
        "description": "Your career journey begins here!MonetizeMore builds industry-leading ad technology that is seen by more than 300M+ people per month. The company has been running for 13 years achieving consistent double-digit growth each year with a team of 270+ team members spread across the globe.We are a culture-centric organization where 👥 Integrity, 🤝 Collaboration, 🚀 Enterprising, and 🔄 Kaizen unite for excellence. We meticulously cultivate these pillars at the heart of everything we do, and our 100% remote setup allows us to work anywhere while upholding these values.Areas where your competencies shineAll The Responsibilities We'll Trust You WithDeveloping features or product using: Node.js, JavaScript, Python/Flask, PostgreSQL, React.js, AWS, Linux, Docker, Git, Cloud Services and any other new technologies Building JavaScript applications capable of tracking and responding to billions of requests per month Developing APIs and integrating with 3rd party APIs to automate manual tasks Implementing UI facilitating third-party reporting and streamlining ad operations Integration of services to maximize ad revenues and maintain strong user experience Planning and prototyping new applications Defect resolution of existing and new issues Unit testing new features to ensure they conform to MonetizeMore’s quality standards and meet requirements Code reviews Running performance benchmarking tests Staying up to date with new trends and advancements in web development and ad tech Attending daily stand-up meetings (30 mins) and other Scrum meetings (Every 2 weeks)Your core expertise & skills That Matter Most For This RoleOpen for junior developers, fresh graduates or graduating with at least 3-6 months or 1 year experience in Python, SQL and/or Javascript , HTML/CSS.Willing to work 40 hours a week. Major related field and desiring a paid internship experience.Must have strong interpersonal and communication skills, verbal and writtenEagerness and ability to learn quickly and expand technical expertise. Excellent problem solving skills.Candidates must possess at least Bachelor's/College Degree in Computer Science/Information Technology or equivalentYou'll love it here with the variety of appealing perks we have to offer:🌟 Competitive Salary: Elevate your earnings with our unique salary formula that adapts to your cost of living and experience, ensuring you're always rewarded for your hard work.🌎 Work Remotely: Break free from the cubicle and embrace the freedom to live and work anywhere your heart desires. Your dream location can now be your office!⏰ Flexible Working Hours: Say goodbye to the 9-to-5 grind. Take charge of your schedule, allowing you to achieve that perfect work-life balance you've always yearned for.🌴 Retreats: We're not just a company; we're a community. Join us for unforgettable in-person retreats, forging meaningful connections with your colleagues while creating memories that last a lifetime.📈 Professional Career: Embark on an exciting journey of growth, with access to continuous training and learning opportunities. Your career aspirations are not just supported, they're nurtured.Don't settle for the ordinary. Join us and experience a career that's as unique as you are.If you think you are a good fit to join our Technology Department, please apply on this side bar. ➡️Powered by JazzHR\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "United States",
        "url": "https://monetizem.applytojob.com/apply/W2POuo4WfF/Web-Developer-Intern-Python-Remote?source=DIREC"
    },
    {
        "job_title": "Junior Node.JS Developer",
        "company_name": "SkyRecruitment",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Junior Node.JS Developer, US/Canada Residents only, Full-Time, Salary $70K-$80KMinimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: SkyRecruitment LLC is a staffing & recruitment agency connecting employers with world-class talent in the tech industry. Our industry delivers services tailored to the unique qualities and specifications of our selected client base.Job ResponsibilitiesJob Description:In this role, you will work closely with experienced developers and contribute to the design, development, and maintenance of robust and scalable applications using Node.js. This is an excellent opportunity for someone looking to kick-start their career in web development.Responsibilities:Collaborate with the development team to gather project requirements and specifications.Assist in the design, development, and maintenance of server-side applications using Node.js.Learn to develop and consume RESTful APIs, integrating with third-party services.Write clean and efficient code following best practices and coding standards.Participate in unit testing and debugging to ensure code quality and reliability.Collaborate with front-end developers to integrate server-side logic with client-side components.Contribute to code reviews and actively participate in knowledge sharing.Stay updated with emerging technologies and industry trends to enhance your skills and knowledge.Seek guidance and support from senior team members to resolve technical issues.QualificationsBachelor's degree in Computer Science, Software Engineering, or a related field.Basic understanding of JavaScript and web technologies.Familiarity with Node.js and its ecosystem.Understanding of asynchronous programming and event-driven architecture.Knowledge of databases and SQL.Strong problem-solving and analytical skills.Excellent communication and collaboration abilities.Eagerness to learn and a passion for web development.Ability to work both independently and in a team-oriented, collaborative environment.Qualifications And ExperienceSpecial Benefits you will love:Flexible vacation paid unlimited holidays and paid sick daysHealth, vision, and dental insurance Why SkyRecruitment LLC?SkyRecruitment LLC's recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. SkyRecruitment is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Alpharetta, GA",
        "url": "https://www.careers-page.com/sky-recruitment-2/job/L85RV43R?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "Software Engineer",
        "company_name": "Method",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Financial Services",
        "description": "Job Description: Work with the engineering team to develop Method’s production-level backend applications using the Javascript programming language. Contribute to the development of Method’s public and internal Application Programming Interfaces (APIs). Contribute to the development of Method’s public libraries and front-end components using the Javascript programming language and libraries such as React. Participate in code reviews. Debug technical issues via monitoring tools.Job Requirements: Bachelor's degree or foreign equivalent degree in Computer Science and at least 12 months experience as a Software Engineer and or Infrastructure Engineer. The required experience must include development of production-level backend applications using the Javascript programming language. Any suitable combination of education or experience that are suitable for the offered job is acceptable.Work location: 11801 Domain Blvd. 3rd Floor, Austin, TX 78758.If interested, send resume or curriculum vitae to team[at]methodfi.com and reference 23-503.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Austin, TX",
        "url": "https://www.ycombinator.com/companies/method-financial/jobs/tm7JJrX-software-engineer?utm_source=syn_li"
    },
    {
        "job_title": "Web Developer (Entry Level)",
        "company_name": "HireMeFast - Land A Job - Hire Top Talents Remotely - Staffing & Recruitment",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Staffing and Recruiting",
        "description": "Web Developer (Entry Level), Full-Time, Salary $63K-$75KMinimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: HireMeFast LLC is a staffing & recruitment agency connecting employers with world-class talent in the tech industry. Our industry delivers services tailored to the unique qualities and specifications of our selected client base.Job Description:You will have the opportunity to work on exciting projects, collaborate with experienced professionals, and contribute to the creation of user-friendly and visually appealing websites. This position is open to candidates based in the United States and is ideal for recent graduates or individuals with limited professional experience in web development.Responsibilities:Collaborate with the development team to design, develop, and maintain responsive and interactive websitesImplement front-end designs using HTML, CSS, and JavaScriptWrite clean, efficient, and well-documented codeParticipate in code reviews and provide constructive feedbackTroubleshoot and debug issues to ensure optimal website performanceCommunicate effectively with team members to ensure successful project completionRequirements:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience)Strong knowledge of HTML5, CSS3, and JavaScriptFamiliarity with front-end frameworks (such as React, Angular, or Vue.js)Understanding of responsive design principles and cross-browser compatibilityExperience with version control systems (e.g., Git)Excellent communication and teamwork abilitiesPreferred Qualifications:Knowledge of back-end technologies (such as Node.js, PHP, or Python)Familiarity with web development frameworks (e.g., Express, Laravel, Django)Understanding of web accessibility standards and best practicesProjects or personal portfolio showcasing your web development skillsWhy HireMeFast LLC?HireMeFasts most recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible. We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. HireMeFast is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Green Bay, WI",
        "url": "https://www.careers-page.com/hiremefast-llc/job/QV87RR86?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "Software Engineer",
        "company_name": "BRIO",
        "listing_details": "Seniority level: Associate, Employment type: Full-time, Job function: Engineering, Industries: Technology, Information and Internet",
        "description": "BRIO’s Software Engineers work as part of our team to develop custom web apps and software solutions. Successful candidates have a solid foundation in the Microsoft stack, including:C#;MVC;.NET 4.6.2 or higher;.NET Web API;T-SQL;Our ideal candidates are familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment. Ultimately, the role of the Software Engineer is to build high-quality, innovative, and fully performing software that complies with coding standards and technical design.ResponsibilitiesWrite well-designed, testable code;Produce specifications and determine operational feasibility;Integrate software components into a fully functional software system;Develop software verification plans and quality assurance procedures;Document and maintain software functionality;Troubleshoot, debug, and upgrade existing systems;Deploy programs and evaluate user feedback;Comply with project plans and industry standards;Ensure software is updated with the latest featuresRequirementsProven work experience as a Software Engineer or Software Developer;Experience designing interactive applications;Excellent knowledge of SQL databases;Ability to develop software in .NET programming language;Experience with web technologies (HTML, CSS, JavaScript, JSON, jQuery, and Kendo);Knowledge of React, Angular, and Azure services is a plus;Knowledge of or desire to learn Salesforce Apex is a plus;Proficiency in software engineering tools;Ability to document requirements and specificationsBenefitsHealth Care Plan (Medical, Dental & Vision)Retirement Plan (401k, IRA)Life Insurance (Basic, Voluntary & AD&D)Paid Time Off (Vacation, Sick & Public Holidays)Family Leave (Maternity, Paternity)Short Term & Long Term DisabilityTraining & DevelopmentOccasional Work From HomeFree Food & Snacks\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Conshohocken, PA",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-at-brio-3728701777?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=BlAe%2BPCzOfPREuzAAv925g%3D%3D&position=5&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Junior Software Development Engineer - US/Canada",
        "company_name": "SkyRecruitment",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Junior Software Development Engineer - US/Canada Residents only, Full-Time, Salary $70K-$80KMinimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: SkyRecruitment LLC is a staffing & recruitment agency connecting employers with world-class talent in the tech industry. Our industry delivers services tailored to the unique qualities and specifications of our selected client base.Job ResponsibilitiesJob Description:As a Junior Software Development Engineer, you will play a crucial role in the design, development, and maintenance of our software applications. You will work closely with senior engineers and collaborate with cross-functional teams to deliver high-quality solutions. This is an exciting opportunity to kick-start your career in software development and contribute to innovative projects in a supportive and collaborative environment.Responsibilities:Collaborate with the development team to understand project requirements and objectivesParticipate in the entire software development lifecycle, from design to deploymentWrite clean, efficient, and maintainable code following best practices and coding standardsContribute to the development of both front-end and back-end componentsCollaborate with designers to ensure a visually appealing and user-friendly interfaceIntegrate APIs and web services to enable seamless communication between different systemsConduct testing and debugging to ensure the functionality and performance of applicationsParticipate in code reviews and provide constructive feedback to improve code qualityStay up-to-date with the latest software development trends and technologiesDocument technical specifications and project detailsQualifications:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience)Solid understanding of software development principles and best practicesProficiency in at least one programming language (e.g., Java, C++, Python, Ruby)Familiarity with front-end development languages such as HTML, CSS, and JavaScriptKnowledge of relational databases and SQLUnderstanding of version control systems (e.g., Git)Strong problem-solving and analytical skillsExcellent communication and collaboration abilitiesAbility to work independently and within a teamEagerness to learn and adapt to new technologiesPreferred Qualifications:Experience with software development projects (personal or professional)Familiarity with front-end frameworks/libraries like React, Angular, or Vue.jsKnowledge of back-end frameworks (e.g., Spring, Django, Ruby on Rails)Exposure to cloud platforms such as AWS, Azure, or Google CloudUnderstanding of Agile development methodologiesBasic understanding of software testing principles and methodologiesBenefitsSpecial Benefits you will love:Flexible vacation, unlimited paid holidays, and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insuranceWhy SkyRecruitment LLC?SkyRecruitment LLC's recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. SkyRecruitment is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "North Platte, NE",
        "url": "https://www.careers-page.com/sky-recruitment-2/job/L3874XWW?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "Full Stack Engineer",
        "company_name": "Elevar",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering, Industries: Technology, Information and Internet",
        "description": "About ElevarElevar is a fast-growing SaaS company that helps Shopify merchants build a solid data foundation for their businesses. We simplify the complex world of server-side event tracking, giving merchants the data they need to make better decisions, grow their businesses faster, and achieve their goals.The RoleWe are looking for a talented and motivated full-stack engineer to join our small team. The role will be working in both the front-end and back-end of our app, which utilizes the following technologies:TypeScriptReactNodePythonYou will have the opportunity to learn new technologies, constantly improve your craft, and contribute to a product that is used by thousands of businesses around the world.About Our AppOur app is split into two pieces: a user-facing app and a data pipeline.The user-facing app is a React app that uses a Python backend (API first). It provides our customers with the ability to manage their accounts, configure their tracking, and view reportsThe data pipeline is made up of serverless functions that receive thousands of hits per second. It enriches, filters, and transforms our merchants' data into payloads that various marketing channels can ingest. What You’ll be DoingWorking with a fully remote team to enhance our productContributing with the team and product manager to shape the product roadmapPushing code changes as pull requests and participate in review, testing, and deployments. How we workOur workload is divided into releases that vary in length depending on the work contained in each release. Most of our releases take about a month to completeEach release includes a maintenance cycle where app improvements and refactors take placeThe release is a time of focus. Distractions are limited during this timeOur application is all contained in a monorepo so that types and logic can be shared across workspacesRequirementsExperience with JavaScriptAbility to work in a unix environmentExperience with a frontend framework like React, Vue, Angular, or SvelteExperience with compliant HTML/CSSExperience with TypeScript, Node, and Python is a plus, but not requiredUnderstanding of serverless technologiesWillingness to learnOpen and transparent communicationAble to work around EST timezoneBenefitsCompetitive salary100% health/dental/vision insurance for US employees401K optionOther home office perks such as a $2,500 stipend for new employees to use towards their home office that you get to keep$1,000 per year professional development stipend for conferences, courses, or anything that may help you growUnlimited vacation policy and flexible working hours\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Charleston, SC",
        "url": "https://www.linkedin.com/jobs/view/full-stack-engineer-at-elevar-3731452757?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=vRSrnpnFTLeHML9q%2F8WW2g%3D%3D&position=7&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Backend",
        "company_name": "Recidiviz",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Location: Remote, New York City, or SF Bay AreaRole Type: Full-timeCompensation: $139,050Visa sponsorship: Not availableHires remotely in: United StatesExperience: 2+ yearsRecidiviz is thrilled to be hiring a Software Engineer - Backend to join our engineering team! We're a small, fast-moving group that develops and maintains the products that drive Recidiviz's impact among criminal justice agencies. We are focused on expanding our team's work and deepening its impact everywhere we are deployed. That's where you come in. We're looking for someone who is excited to help us grow our existing technical platforms as well as build new products that will increase our impact across the country.About UsRecidiviz is creating safer, healthier communities by improving outcomes for justice-involved people. We build tech that reduces the number of people in prison and helps criminal justice leaders embrace data-driven decision-making.Using modern data infrastructure and thoughtful product design, we've been able to safely and permanently reduce incarceration and improve outcomes. We work side-by-side with leaders of the criminal justice system, justice-impacted individuals, and ecosystem partners to build a better path forward. In addition to the revenue we earn from state partners, some of the most respected philanthropists and foundations support our work.People who succeed at Recidiviz lead with kindness and humility, assume good intent, learn from failure, and fix problems when they see them.About The RoleIn this role, you will work with our product, design, and engineering teams to develop and maintain the web applications and data pipelines that help Recidiviz and our partner organizations foster a healthy and open criminal justice data ecosystem. You will collaborate with staff across the organization to ensure our products are as impactful and scalable as possible. You should have a solid grasp of engineering best practices, a willingness to dive into tough problems and diverse data, and a collaborative and kind nature to add to our culture.Core responsibilitiesWork with our product and design teams to build impact-oriented products that facilitate an open criminal justice data ecosystemWork with our engineering and data teams to implement testable and maintainable features across our full-stack web apps and backend data infrastructureCollaborate with external users of our products to ensure our work is scalably launchable and configurable across all states and systemsEnsuring the long-term health of our engineering organization by maintaining high bars for security, privacy, operations, quality, documentation, testing, and ethicsMinimum QualificationsHigh empathy and kindness2+ years of practical experience building production, user-facing software in a collaborative environmentExperience working in a cross-functional setting with multiple stakeholdersExperience writing code in PythonExperience working with SQL databasesExperience working in cloud infrastructure environments like Google Cloud Platform (GCP) or Amazon Web Services (AWS) Comfort working directly with deployed systems to ensure high uptime, secure configuration, and rapid developmentBachelor's degree in a technical field or equivalent experiencePreferred QualificationsExperience with Flask and SQLAlchemyExperience in systems engineering, including improving the scalability, reliability, and maintainability of production softwareCompensationCompensation levels are standard across the organization and are set as rungs, not bands. This helps us ensure equitable compensation and responsible stewardship of our resources.The compensation for L2 Software Engineers on our team is $139,050. Please note that we do not negotiate compensation offers.What we offerEffective, extremely thoughtful colleagues, working together on a mission that matters90% medical, dental, and vision insurance coverage for you and your dependentsComplimentary One Medical membership (depending on location)Flexible time off, including 13 paid holidays and 20 days of PTO12 weeks of paid parental leave401(k) retirement plan with 5% company match and no vesting periodMonthly ClassPass credit for personal fitnessWell-located offices in Oakland and Manhattan, with the flexibility to work remotely or go into either office as you chooseAn annual company offsite each spring and other ad-hoc gatheringsAll the exhilarating challenges and stretch opportunities of a tech startup, combined with the mission-driven heart of a nonprofitMore about RecidivizRecidiviz was an all-volunteer effort until early 2019, when Clementine, Andrew, and Joshua founded the organization. Since then, we've built an A-team of software engineers, designers, product managers and domain experts, from companies like Google, Apple, Dropbox, Opower, and Sidewalk Labs. Recidiviz was part of Y-Combinator's 2019 class and has received support from some of the most respected philanthropists and foundations, including Ford Foundation, Mackenzie Scott, Schmidt Futures, Arnold Ventures, Chan Zuckerberg Initiative, and the Mozilla Foundation.Today, Recidiviz works with (and earns revenue from) 11 state partners – big and small, red and blue – and covers 25% of the US incarcerated population. We have helped to get tens of thousands of people out of the criminal justice system, safely and equitably, and saved states nearly $1 billion. In the next five years, Recidiviz plans to partner with 40 states and help 250,000 people who are stuck in the system to get out and stay out. In addition to partnering with state Departments of Corrections, Recidiviz collaborates with and learns from partners – from organizations like the Correctional Leaders Association (CLA) to community based organizations and justice-impacted individuals, whose perspectives guide our work.To learn more about how we do what we do, check out our 2022 Year in Review, read some press coverage, or watch our recent TED Talk. And if you're really keen to see our work, you can dive into our Github :).An important noteLasting change is always built on diversity. Recidiviz recruits, employs, trains, compensates and promotes regardless of race, religion, color, national origin, sex, sexual orientation, disability, age, veteran status, ancestry, citizenship, marital status, gender identity and all protected status as required by applicable law. We consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a special need that requires accommodation, please let us know in your application. Even if you don't think you meet all the criteria above, drop your resume, and we'll take a look – you might be great for another role or another time!\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "New York, NY",
        "url": "https://boards.greenhouse.io/recidiviz/jobs/4285685006?gh_src=dc6430de6us"
    },
    {
        "job_title": "Entry-Level Software Application Engineer",
        "company_name": "HireMeFast - Land A Job - Hire Top Talents Remotely - Staffing & Recruitment",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Staffing and Recruiting",
        "description": "Entry-Level Software Application Engineer, US/Canada Residents only, Full-Time, Salary $63K-$75K.Minimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: HireMeFast LLC is a staffing & recruitment agency connecting employers with world-class talent in the tech industry. Our industry delivers services tailored to the unique qualities and specifications of our selected client base.DescriptionYou will work closely with our project managers, designers, and developers to ensure that our software is of the highest quality and meets the needs of our clients. The ideal candidate will have a strong background in software engineering and be comfortable working in a fast-paced environment.Tasks:Collaborate with cross-functional teams to design, develop, and test software solutions that meet business requirements.Write clean, scalable, and maintainable code that adheres to coding standards and best practices.Perform code reviews, debugging, and troubleshooting to ensure software quality and functionality.Continuously research and learn about new technologies and industry trends to improve software development processes and enhance product offerings.RequirementsBachelor's degree in Computer Science or related fieldExperience with web application development frameworks such as Spring and DjangoUnderstanding of database design and management (SQL, NoSQL)Special Benefits you will love:Flexible vacation paid unlimited holidays and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insurance Why HireMeFast LLC?HireMeFasts most recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible. We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. HireMeFast is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Salt Lake City, UT",
        "url": "https://www.careers-page.com/hiremefast-llc/job/L668Y9WW?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "Junior Software Developer - US/Canada",
        "company_name": "Pattern Learning AI - Career & Tech Recruitment Reimagined!",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Junior Software Developer - US/Canada Residents only, Full-Time, Salary $70K-$80KMinimum 1 year of work experience - fully remote position. Freshers are also encouraged to apply.About us: The Future of AI is Patterned We are a stealth-mode technology startup that is revolutionizing the way AI is used. Our platform uses pattern recognition to train AI models that are more accurate, efficient, and robust than ever before.We are backed by top investors and we are hiring for almost everything! If you are passionate about AI and want to be a part of something big, then we want to hear from you.Make a positive impact on the world. Be a part of a fast-growing startup. If you are interested in learning more, please visit our website.We Are Looking For People Who ArePassionate about AI.Excellent problem solvers.Team players.Driven to succeed.RequirementsResponsibilities:Collaborate with the development team to design, develop, and maintain software applications.Write clean, efficient, and high-quality code following best practices and coding standards.Assist in troubleshooting and debugging software issues, identifying and implementing solutions.Participate in code reviews to ensure code quality and maintainability.Contribute to the development of technical documentation, such as design specifications and user manuals.Stay up to date with emerging technologies and industry trends, and propose innovative solutions.RequirementsBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).Solid understanding of programming concepts and principles.Proficiency in one or more programming languages, such as Java, C++, Python, or JavaScript.Familiarity with web technologies (HTML, CSS, JavaScript) and frameworks (React, Angular, Vue.js) is a plus.Knowledge of software development methodologies and best practices.Strong problem-solving and analytical skills.Excellent communication and teamwork abilities.Ability to learn quickly and adapt to new technologies and frameworks.BenefitsSpecial Benefits you will love:Flexible vacation, unlimited paid holidays, and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insuranceWhy Patterned Learning AI?Patterned Learning AI is made up of incredibly bright, mission-driven coworkers who are passionate about using technology to solve real-world problems---and we're growing quickly. In order to continue building an engaging and dynamic organization, we're committed to giving everyone the support they need to do great work.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. Patterned Learning AI is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Chicago, IL",
        "url": "https://jobs.gohire.io/patterned-learning-ai-b9qwy5ki/junior-software-developer-us-canada-146547/"
    },
    {
        "job_title": "Desenvolvedor Full Stack",
        "company_name": "Pasquali Solution",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Mandatory RequirementsDevelop and implement front-end web code using both React and Angular.Collaborate intimately with other developers and the design team to craft and refine user experiences.Lead the integration of the CRM platform into diverse systems, ensuring fluidity and smooth user engagement.Work on high-priority projects, displaying a keen sense of urgency and adaptability customary to a fast-paced startup environment.Debug .Net c# application codes, demonstrating a proactive approach to problem-solving.Drive, establish, and maintain best practices in both mobile and desktop web solutions.Contribute to product roadmapping sessions, providing technical perspectives and insights.Design, craft, and maintain APIs that will integrate with all front-end and backend applications. Showcase a deep curiosity in AI and its applications in the SaaS world, continuously brainstorming for its optimal use. Qualifications: Robust experience with Angular frameworks. Proficient in deploying and managing applications on AWS. Comprehensive understanding of system integrations and ensuring they are efficient and scalable. A passionate curiosity about AI, APIs, and the future of tech in SaaS.\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Home, KS",
        "url": "https://www.pasqualisolution.com.br/vagas/desenvolvedor-full-stack-2465.html"
    },
    {
        "job_title": "Python Developer",
        "company_name": "Two Fish Creative",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "Job DescriptionWe are looking for a Full Stack Developer to join our engineering team and help us develop and maintain various software products. Two Fish Creative is founded on the idea of \"Swim against the Current\" and we are looking for talented intellectual team members who embody this idea. We have collaboration at our core and work in team first agile environment. We want to be your dream job.Python Developer responsibilities include:Writing and testing code, debugging programs and integrating applications with third-party web services. To be successful in this role, you should have experience using server-side logic and work well in a team.Writing effective, scalable codeDeveloping back-end components to improve responsiveness and overall performanceIntegrating user-facing elements into applicationsUltimately, you’ll build highly responsive web applications that align with our or our clients business needs.ResponsibilitiesWrite effective, scalable codeDevelop back-end components to improve responsiveness and overall performanceIntegrate user-facing elements into applicationsTest and debug programsImprove functionality of existing systemsImplement security and data protection solutionsAssess and prioritize feature requestsCoordinate with internal teams to understand user requirements and provide technical solutionsRequirementsWork experience as a Python Developer (other development languages also considered)Expertise in at least one popular Python framework (like Django, Flask or Pyramid)Knowledge of object-relational mapping (ORM)Knowledge of SQLFamiliarity with front-end technologies (JavaScript and HTML5)Team playerGood problem-solving skills\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "West Palm Beach, FL",
        "url": "https://www.linkedin.com/jobs/view/python-developer-at-two-fish-creative-3730794047?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=1H%2FAE3Ihk4rhitYYpRO6tg%3D%3D&position=12&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Full Stack Engineer",
        "company_name": "Pylon",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "At Pylon, we’re a small team building a very ambitious product in the mortgage space.At this early stage, we’re looking for engineers who can see the opportunity of what we’re building towards and want to have a hand in building it.We're in search of people who find difficult problems invigorating and who fit well into a high-performing team built on mutual respect and reliance. If you like pushing yourself to learn a massive amount while shipping code that has a huge impact on the end product, Pylon Engineering could be a great place for you.About YouYou:Have strong opinions that you’re willing to defend. We have a culture of vigorous discussion and debate on technical decisions. We’ll push you to defend your choices, and we want you to push back. Don't settle. Challenge yourself to frequently and consistently deliver exceptional code. If something could be better, take the initiative to improve it. Have great ideas, and lots of them. You should see opportunities all around you to make the code, product and infrastructure better. We’ll give you an environment where you can act on those ideas. Are self-motivated. You can take a goal and drive towards it without needing extensive hand-holding. The team is supportive and loves to share knowledge and advice, but there’s no time for micromanaging your work. Are comfortable with ambiguity. There's a million ways to do things; you should feel at ease making a decision under uncertainty while balancing competing constraints. Are confident you can learn quickly. Mortgage is complex, our platform is complex, good software engineering is complex. You’ve got to have an attitude that you can absorb it, get on top of it, and build something better than what came before. Love strong typing. We're a team full of people who love Haskell and Rust (and Idris!) and take pride in pushing Typescript to its limits. Know SQL. We use an ORM and query builder, but it’s a thin wrapper over SQL. You’ve got to know SQL inside and out to really be successful. About The TeamWhat we’re not:Building a CRUD app:We’re building a platform that’s only possible due to deep technology investments and thinking hard from first principles. Cargo-culting what’s come before won’t be sufficient. If you’re looking to do mostly plumbing / lego piece assembling, Pylon may be very frustrating for youA machine learning / AI shop (currently):Sorry! If you’re looking to do ML-heavy stuff, Pylon may not be right for you. We won’t rule out any tool to solve a problem, but our current challenges aren’t ones that ML is particularly suited to. An easy job:We’re building a lot of things from the ground up for the first time. Working at Pylon is like a research project where you have to ship to intelligent, opinionated customers regularly. It’s basically guaranteed you’ll be handed a task that is too difficult for you to do. You might fail sometimes. You might have no idea where to start. Our team leans heavily on each other, but there’s no getting around the difficulties. That being said, we aren’t into performatively working long hours. We have a generous vacation policy and night and weekend work is the exception, not the norm. Come to work refreshed and energized and ready to get stuff done. What we are:A small team:We don’t have an army of engineers. If you find something is broken, you are probably the best one to fix itAll the code we write has to punch above its weight in maintainability and toil reductionIf you have a good idea, you have much more ability to put it into action than at a large companyWe need generalists: specialization is for big companies that already have everything figured out. If you’re smart, flexible and like getting into everything, we want you. Working in a regulated space:Mortgage is regulated both federally and at the state level. We move fast, but breaking things isn’t an option. About The JobBasicsJob title: Software EngineerStock options: own a piece of the company and we all win togetherNo preset vacation day limitHealth insurance, dental, etc. Remote friendly: our team is spread across all 4 continental US timezones. Moving stipend if you want to move to the SF Bay Area: several of us are physically in SV, working within driving distance of each other is nice!Our technology stack:To be up front: we don’t require that you’ve worked with any of these technologies before. We list these mainly for you in case you don’t want to work with any of these technologies. If you do .NET or Java or COBOL development and you’re ok working with this stack, then we’re golden.Typescript front and backendReact on the frontendGraphQL & JSON/REST APIsPostgreSQLNestJS web frameworkNx build systemAWS stack using CDK for declarative infrastructureWe currently use ECS rather than Kubernetes. If you have questions about this choice and want to know more, please apply!General philosophy: monolith until it hurts. If we can do something without introducing a new service, we willAbout PylonPylon is the first API-driven Mortgage-as-a-Service platform. We are building a set of APIs to allow companies to build mortgage services. Customers rely on us to manage a core part of their business.Pylon is partnered with financial institutions such as Bayview, Neuberger Bergman, UWM, and First American as well as backed by investors such as Conversion Capital, QED, Fifth Wall, Peter Thiel, Montage Ventures, and Village Global.Compensation Range: $150K - $200K\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "United States",
        "url": "https://jobs.ashbyhq.com/pylon/7957c176-286e-406a-a4d9-ab85ae02fef3/application?utm_source=jkmANXM540"
    },
    {
        "job_title": "Software Developer",
        "company_name": "Ascendion",
        "listing_details": "Seniority level: Entry level, Employment type: Contract, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Position Details:Position 1: Sr. AEM Software DeveloperType : Long Term Contract RoleLocation: Hybrid role based out of Austin, TXDescription:Develop AEM components translated from design outputs for an optimal user experience on a variety of devices and screen sizes.Ensure code quality through testing and code reviews. Troubleshoot and maintain existing components.Provide solution recommendations based on business requirements. Responsibilities;Generate front-end code for Adobe Experience Manager Test and validate code deploys Provide code reviews for other developers Create documentation for other developers or QA staff to use in the futureWhat technical skills will successful candidates possess?Adobe Experience Managerfront-end developmentDeploys usingGit repositoryJira ticket management and scrumJavaScript, JQuery and NodejsReact and AngularJSGraphQL\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Austin, TX",
        "url": "https://www.monster.com/job-openings/software-developer-austin-tx--09b43fb6-7399-4ede-8c8d-24eeae045031?mescoid=1500127001001&mstr_dist=true&jclickid=c15bb439-07d0-4011-89e8-de9f1b35e332"
    },
    {
        "job_title": "Software Engineer",
        "company_name": "Glytec",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Hospitals and Health Care",
        "description": "Essential Job Functions:Design and implement innovative applications, features and systemsImplement scalable components, APIs and servicesImprove performance, availability and scalability of application platformData analysis and modelingObject oriented analysis and designImplement modern web interfaces using HMTL5, CSS and JavaScriptWork with cross functional team to define feature specificationsCompetencies:Minimum Requirements: You confirm that you meet the following requirements for the Software Engineer position: Education BS or BA in Computer Science, Engineering or related field; or equivalent experience.4+ years experience in enterprise software developmentSkills Strong programming skills including software engineering methodologies, best practicesStrong SQL data modeling and programming skillsStrong understanding of object oriented programming and MVC paradigmStrong web application development experienceStrong knowledge of web application architectures, trends and emerging technologiesExperience with JavaScript, JQuery and AJAXFamiliarity with Web Services and RESTful architecture principlesFamiliarity with Agile software development (e.g. Scrum)Excellent communication and interpersonal skillsEntrepreneurial attitude, able to work independently with initiativeKnowledgeExperience with PHP MVC framework (e.g. Codeigniter) is a plusExperience with ASP.NET Core is a plusExperience with CI/CD (Bitbucket Pipelines) is a plusExperience with Jira and Confluence is a plusHealthcare IT experience is a plusExperience with FDA class II regulated software is a plusAdditional NotesThe above statements are intended to describe the general nature and level of work being performed by personnel assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Waltham, MA",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-at-glytec-3727716867?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=bAg36Jsdr0ZUPXgUAeM14w%3D%3D&position=15&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Full-Stack Software Engineer",
        "company_name": "Odyn AI",
        "listing_details": "Seniority level: Entry level, Employment type: Contract, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "We can be flexible with working experience based on your skills.At Odyn we're looking for an excellent Full-Stack Software Engineer that will be a critical part of the team reporting directly to the CTO. The role is for a contractor working full time. We expect you to be involved in the everyday of the company and interact with different team members of the team. Besides the typical full stack tasks, you will also be doing software engineering tasks.What will you do?:Developing Web Applications: Build robust, scalable, and user-friendly web applications powered by our AI system to serve our customers, ensuring both frontend and backend excellence.Interact with Other Web Services: Create efficient algorithms to interface and interact with various external web services and APIs.Third-party Integration: Seamlessly integrate our solution with third-party services, ensuring interoperability and enhancing the user experience.Must HaveProficiency in Python. More backend languages like Go is a plus.Proficiency in HTML, CSS, and JavaScriptProficient in React and related frameworks like Next.js or others. Proficient in using git for version control.Experience designing, implementing, and maintaining APIsExperience implementing authentication and authorization solutions, possibly using OAuth, JWT, etc.Excellent algorithms and data structures developmentExperience setting up and maintaining CI/CD pipelinesStrong belief in writing unit, integration, and end-to-end tests. Familiarity with testing frameworks like Jest, Mocha, or PyTest.Experience with SQL and noSQL databases (MongoDB is a plus)High level software architecture understanding. Nice To Have Experience with real-time data processing and streaming platforms such as Kafka, WebSockets, or WebRTC Familiarity with OpenAI API  Hands-on experience with cloud platforms like AWS. This includes services like EC2, Lambda or S3. Familiarity with container solutions like Docker and orchestration tools like Kubernetes. Understanding of cybersecurity best practices to ensure the integrity and confidentiality of sensitive meeting data. Given the nature of the product, any experience with machine learning, especially in the context of audio processing or NLP, would be beneficial. Given that you'll be a key role, experience in mentoring junior developers could be beneficial.IMPORTANT We will ask you to provide your GitHub profile and projects portfolio before scheduling any interview.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "San Francisco, CA",
        "url": "https://wellfound.com/jobs/2800145-full-stack-software-engineer?utm_campaign=linkedin_syndication&utm_source=linkedin"
    },
    {
        "job_title": "Junior Software Development Engineer - US/Canada",
        "company_name": "Pattern Learning AI - Career & Tech Recruitment Reimagined!",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Junior Software Development Engineer - US/Canada Residents only, Full-Time, Salary $75K-$85KMinimum 1 year of work experience - fully remote position. Freshers are also encouraged to apply.About us: The Future of AI is Patterned We are a stealth-mode technology startup that is revolutionizing the way AI is used. Our platform uses pattern recognition to train AI models that are more accurate, efficient, and robust than ever before.We are backed by top investors and we are hiring for almost everything! If you are passionate about AI and want to be a part of something big, then we want to hear from you.Make a positive impact on the world. Be a part of a fast-growing startup. If you are interested in learning more, please visit our website.We Are Looking For People Who ArePassionate about AI.Excellent problem solvers.Team players.Driven to succeed.RequirementsJob Description:We are seeking a talented and motivated Junior Software Development Engineer to join our dynamic team. As a Junior Software Development Engineer, you will play a crucial role in the design, development, and maintenance of our software applications. You will work closely with senior engineers and collaborate with cross-functional teams to deliver high-quality solutions. This is an exciting opportunity to kick-start your career in software development and contribute to innovative projects in a supportive and collaborative environment.ResponsibilitiesCollaborate with the development team to understand project requirements and objectivesParticipate in the entire software development lifecycle, from design to deploymentWrite clean, efficient, and maintainable code following best practices and coding standardsContribute to the development of both front-end and back-end componentsCollaborate with designers to ensure a visually appealing and user-friendly interfaceIntegrate APIs and web services to enable seamless communication between different systemsConduct testing and debugging to ensure the functionality and performance of applicationsParticipate in code reviews and provide constructive feedback to improve code qualityStay up-to-date with the latest software development trends and technologiesDocument technical specifications and project detailsQualificationsBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience)Solid understanding of software development principles and best practicesProficiency in at least one programming language (e.g., Java, C++, Python, Ruby)Familiarity with front-end development languages such as HTML, CSS, and JavaScriptKnowledge of relational databases and SQLUnderstanding of version control systems (e.g., Git)Strong problem-solving and analytical skillsExcellent communication and collaboration abilitiesAbility to work independently and within a teamEagerness to learn new technologiesPreferred QualificationsExperience with software development projects (personal or professional)Familiarity with front-end frameworks/libraries like React, Angular, or Vue.jsKnowledge of back-end frameworks (e.g., Spring, Django, Ruby on Rails)Exposure to cloud platforms such as AWS, Azure, or Google CloudUnderstanding of Agile development methodologiesBasic understanding of software testing principles and methodologiesBenefitsSpecial Benefits you will love:Flexible vacation, unlimited paid holidays, and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insuranceWhy Patterned Learning AI?Patterned Learning AI is made up of incredibly bright, mission-driven coworkers who are passionate about using technology to solve real-world problems---and we're growing quickly. In order to continue building an engaging and dynamic organization, we're committed to giving everyone the support they need to do great work.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. Patterned Learning AI is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Phoenix, AZ",
        "url": "https://jobs.gohire.io/patterned-learning-ai-b9qwy5ki/junior-software-development-engineer-us-canada-146549/"
    },
    {
        "job_title": "Junior Web Developer",
        "company_name": "Pattern Learning AI - Career & Tech Recruitment Reimagined!",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Junior Web Developer, US/Canada Residents only, Full-Time, Salary $75K-$85K.Minimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply.About us: The Future of AI is Patterned We are a stealth-mode technology startup that is revolutionizing the way AI is used. Our platform uses pattern recognition to train AI models that are more accurate, efficient, and robust than ever before.We are backed by top investors and we are hiring for almost everything! If you are passionate about AI and want to be a part of something big, then we want to hear from you.Make a positive impact on the world. Be a part of a fast-growing startup. If you are interested in learning more, please visit our website.We Are Looking For People Who ArePassionate about AI.Excellent problem solvers.Team players.Driven to succeed.RequirementsJob Description:We are seeking a motivated and talented Junior Web Developer to join our growing team. As a Junior Web Developer, you will work closely with our senior developers to design, develop, and maintain high-quality websites and web applications. This is an excellent opportunity to gain hands-on experience in a collaborative environment and contribute to exciting projects.ResponsibilitiesCollaborate with the development team to understand project requirements and design web solutionsWrite clean, efficient, and well-structured code using HTML, CSS, and JavaScriptAssist in the development and implementation of responsive and user-friendly web interfacesIntegrate front-end designs with back-end functionality using appropriate technologiesConduct thorough testing and debugging to ensure seamless functionalityAssist in website maintenance, updates, and enhancementsStay up-to-date with industry trends and emerging web development technologiesCollaborate with cross-functional teams to deliver projects on time and within scopeDocument technical specifications, project details, and development processesQualificationsBachelor's degree in Computer Science, Web Development, or a related fieldSolid understanding of web development principles and best practicesProficiency in HTML, CSS, and JavaScriptFamiliarity with front-end frameworks such as Bootstrap or FoundationBasic understanding of back-end development technologies (e.g., PHP, Python, or Ruby)Knowledge of version control systems (e.g., Git)Experience with responsive web design and mobile-first developmentStrong problem-solving and analytical skillsExcellent communication and teamwork abilitiesSelf-motivated with a strong desire to learn and grow as a developerPreferred QualificationsPrevious experience with web development projects (personal or professional)Knowledge of JavaScript frameworks/libraries (e.g., React, Angular, or Vue.js)Familiarity with content management systems (e.g., WordPress, Drupal, or Joomla)Understanding of SEO principles and best practicesExperience with web accessibility standards and guidelinesKnowledge of web security best practicesBenefitsSpecial Benefits you will love:Flexible vacation, unlimited paid holidays, and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insuranceWhy Patterned Learning AI?Patterned Learning AI is made up of incredibly bright, mission-driven coworkers who are passionate about using technology to solve real-world problems---and we're growing quickly. In order to continue building an engaging and dynamic organization, we're committed to giving everyone the support they need to do great work.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. Patterned Learning AI is proud to be an equal opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Phoenix, AZ",
        "url": "https://jobs.gohire.io/patterned-learning-ai-b9qwy5ki/junior-web-developer-146564/"
    },
    {
        "job_title": "Software Engineer, MTS 1",
        "company_name": "eBay",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Looking for a company that inspires passion, courage and creativity, where you can be on the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to crafting an ambitious and inclusive work environment, join eBay – a company you can be proud to be with.We are looking for highly motivated and talented software engineer who have experience or interest in data engineering. As a member of the team, you'll build the exciting systems and services needed to fuel the next wave of Ebay's growth. You will collaborate with applied researchers, data engineers, product managers to implement end-to-end reliable, scalable, efficient production services in Python, Go, Java, Scala or similar languages. The ideal candidate will have minimum 7 years experience in software development, strong engineering skills, and excellent communication skills.ResponsibilitiesWork with data scientists, engineers, and cross-functional teams to produce end-to-end production-ready solutionsDesign and development of solutions for large scale problems in eBayTransformations and pre-processing of data (ETL)RequirementsBS/MS/PhD in Computer Science/Engineering or related technical disciplineHands on experience with Docker and KubernetesExperience with large data sets and related technologies, e.g., Hadoop and SparkExcellent understanding of computer science fundamentals, data structures, and algorithms. Strong programming skills in (two or more) Java, Scala, Python, . Minimum 7+ years in software developmentAgility to adapt to emerging challenges and execute under ambiguity Strong communication skillsBenefits are an essential part of your total compensation for the work you do every day. Whether you’re single, in a growing family, or nearing retirement, eBay offers a variety of comprehensive and competitive benefit programs to meet your needs. Including maternal & paternal leave, paid sabbatical, and plans to help ensure your financial security today and in the years ahead because we know feeling financially secure during your working years and through retirement is important.Here at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn’t just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work. To learn about eBay’s Diversity & Inclusion click here: https://www.ebayinc.com/company/diversity-inclusion/The pay range for this position at commencement of employment in California, Washington, or New York is expected in the range below.$135,200 - $205,700Base pay offered may vary depending on multiple individualized factors, including location, skills, and experience. The total compensation package for this position may also include other elements, including a target bonus and restricted stock units (as applicable) in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as PTO and parental leave). Details of participation in these benefit plans will be provided if an employee receives an offer of employment.If hired, employees will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible. View our accessibility info to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. For more information see: EEO is the Law Poster and EEO is the Law Poster Supplement.Jobs posted with location as \"Remote - United States (Excludes: HI, NM)\" excludes residents of Hawaii and New Mexico.This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "San Francisco, CA",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-mts-1-at-ebay-3729862384?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=YOJCI27N67DFLQuwKzvcHg%3D%3D&position=19&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Associate Software Engineer (Remote)",
        "company_name": "Patterson Companies, Inc.",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Medical Equipment Manufacturing",
        "description": "Dolphin Imaging Systems has a great opportunity available for an Associate Software Engineer to join our fully remote team. Dolphin Imaging Systems (a division of Patterson Companies, a Fortune 500 company) provides imaging, diagnostic, patient education and management software solutions for dental-specialty practices and institutions.As an Associate Software Engineer, you will be part of the Imaging Team and will be primarily focused on our 2D imaging software line. Orthodontists and maxillofacial surgeons use our software to acquire and store imaging records, diagnose and analyze patient issues, simulate treatment, and show patients what they can look like when a procedure is finished. Our planning software even designs 3D-printable guides to use in treatment. The results can truly be life-changing for those who receive these procedures, as many problems they have dealt with their entire life are corrected.Our Dolphin team consists of many long-tenured employees who have created a great culture in a casual environment built around teamwork, flexibility and innovation.Associate Software Engineer Main Responsibilities Include Developing medical imaging software for Windows, in C++ / MFC, using Microsoft Visual Studio.  Develop and implementation of standards and processes around definition, development, test, analysis, and maintenance of software applications in support of the business.  This includes processes and standards on writing, coding, testing, and analyzing software programs and applications. Associate Software Engineer Qualifications B achelor's Degree in Computer Science or a combination of equivalent education and experience.  1+ years of programming experience required.  Experience in all aspects of application development and project life cycles.  E xperience writing high-quality Windows desktop applications with Microsoft Visual C++ Environment and MFC.  Experience with GUI Design.  Experience in object-oriented programming and in multiple development technologies with proven ability to maintain software products written in different languages and platforms.  Experience using source code management system.  Excellent verbal and written communication skills.  Ability to write functional and technical software specifications. Associate Software Engineer Preferred Qualifications Win32 API experience  SQL database design and SQL access via C++  Experience with C# and .NET  Experience with Azure DevOps (ADO) and GitHub Repositories  Database (relational and hierarchical) and operating systems experience.  Please visit   www.dolphinimaging.com   for more information on our company and mission. The potential compensation range for this role is below. The final offer amount could exceed this range, based on various factors such as candidate location (geographical labor market), experience, and skills.$65,000 - $80,000The potential compensation range for this role is below. The final offer amount would be based on various factors such as candidate location (geographical labor market), experience, and skills. $67,500.00 - $85,200.00\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Los Angeles, CA",
        "url": "https://www.linkedin.com/jobs/view/associate-software-engineer-remote-at-patterson-companies-inc-3731770315?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=Fm2Js%2F1LkDyAKVdzxHk2Lg%3D%3D&position=20&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Full Stack Engineer",
        "company_name": "Pylon",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "At Pylon, we’re a small team building a very ambitious product in the mortgage space.At this early stage, we’re looking for engineers who can see the opportunity of what we’re building towards and want to have a hand in building it.We're in search of people who find difficult problems invigorating and who fit well into a high-performing team built on mutual respect and reliance. If you like pushing yourself to learn a massive amount while shipping code that has a huge impact on the end product, Pylon Engineering could be a great place for you.About YouYou:Have strong opinions that you’re willing to defend. We have a culture of vigorous discussion and debate on technical decisions. We’ll push you to defend your choices, and we want you to push back. Don't settle. Challenge yourself to frequently and consistently deliver exceptional code. If something could be better, take the initiative to improve it. Have great ideas, and lots of them. You should see opportunities all around you to make the code, product and infrastructure better. We’ll give you an environment where you can act on those ideas. Are self-motivated. You can take a goal and drive towards it without needing extensive hand-holding. The team is supportive and loves to share knowledge and advice, but there’s no time for micromanaging your work. Are comfortable with ambiguity. There's a million ways to do things; you should feel at ease making a decision under uncertainty while balancing competing constraints. Are confident you can learn quickly. Mortgage is complex, our platform is complex, good software engineering is complex. You’ve got to have an attitude that you can absorb it, get on top of it, and build something better than what came before. Love strong typing. We're a team full of people who love Haskell and Rust (and Idris!) and take pride in pushing Typescript to its limits. Know SQL. We use an ORM and query builder, but it’s a thin wrapper over SQL. You’ve got to know SQL inside and out to really be successful. About The TeamWhat we’re not:Building a CRUD app:We’re building a platform that’s only possible due to deep technology investments and thinking hard from first principles. Cargo-culting what’s come before won’t be sufficient. If you’re looking to do mostly plumbing / lego piece assembling, Pylon may be very frustrating for youA machine learning / AI shop (currently):Sorry! If you’re looking to do ML-heavy stuff, Pylon may not be right for you. We won’t rule out any tool to solve a problem, but our current challenges aren’t ones that ML is particularly suited to. An easy job:We’re building a lot of things from the ground up for the first time. Working at Pylon is like a research project where you have to ship to intelligent, opinionated customers regularly. It’s basically guaranteed you’ll be handed a task that is too difficult for you to do. You might fail sometimes. You might have no idea where to start. Our team leans heavily on each other, but there’s no getting around the difficulties. That being said, we aren’t into performatively working long hours. We have a generous vacation policy and night and weekend work is the exception, not the norm. Come to work refreshed and energized and ready to get stuff done. What we are:A small team:We don’t have an army of engineers. If you find something is broken, you are probably the best one to fix itAll the code we write has to punch above its weight in maintainability and toil reductionIf you have a good idea, you have much more ability to put it into action than at a large companyWe need generalists: specialization is for big companies that already have everything figured out. If you’re smart, flexible and like getting into everything, we want you. Working in a regulated space:Mortgage is regulated both federally and at the state level. We move fast, but breaking things isn’t an option. About The JobBasicsJob title: Software EngineerStock options: own a piece of the company and we all win togetherNo preset vacation day limitHealth insurance, dental, etc. Remote friendly: our team is spread across all 4 continental US timezones. Moving stipend if you want to move to the SF Bay Area: several of us are physically in SV, working within driving distance of each other is nice!Our technology stack:To be up front: we don’t require that you’ve worked with any of these technologies before. We list these mainly for you in case you don’t want to work with any of these technologies. If you do .NET or Java or COBOL development and you’re ok working with this stack, then we’re golden.Typescript front and backendReact on the frontendGraphQL & JSON/REST APIsPostgreSQLNestJS web frameworkNx build systemAWS stack using CDK for declarative infrastructureWe currently use ECS rather than Kubernetes. If you have questions about this choice and want to know more, please apply!General philosophy: monolith until it hurts. If we can do something without introducing a new service, we willAbout PylonPylon is the first API-driven Mortgage-as-a-Service platform. We are building a set of APIs to allow companies to build mortgage services. Customers rely on us to manage a core part of their business.Pylon is partnered with financial institutions such as Bayview, Neuberger Bergman, UWM, and First American as well as backed by investors such as Conversion Capital, QED, Fifth Wall, Peter Thiel, Montage Ventures, and Village Global.Compensation Range: $150K - $200K\n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "United States",
        "url": "https://www.linkedin.com/jobs/view/full-stack-engineer-at-pylon-3731717324?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=8RemZNyGuk1LJW%2FkpwIonw%3D%3D&position=21&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "React Developer",
        "company_name": "Tech Brains Solutions, Inc.",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Internet Publishing",
        "description": "Role: React DeveloperLocation: Chicago, IL – Onsite(This opportunity is onsite and requires you to be local to the Chicagoland area)Full Time roleAbout The Role:We are looking for a talented mid-level React Developer who will work with our UI/UX development team, business stakeholders, and designers to build interfaces for our leading-edge web-based products. This position reports to the Head of UI/UX Design and the role will work at our Chicago downtown office.What You’ll Do:Work with designers to implement pixel-perfect UI designs and produce functionality as described by product managers.Help to troubleshoot, test, and maintain the quality and security of web applications.Produce meaningful unit tests for functionality to ensure backwards compatibility.Leverage React's efficiency with re-painting in order to develop highly performant applications that handle heavy data flows.What We’re Looking For:Bachelor's degree in computer science, business, engineering, or related field or equivalent work experience2 to 5 years of building web apps experience.Demonstrated ability in developing in JavaScript with React, Monaterial UI, Node.js, Typescript and ES6 or equivalent experience.Knowledge of development methodologies, software design patterns, integration standards, and versioning.Experience working in an Agile environment.Additional technical skills in C#, Python and SQL a plus.Knowledge of the financial markets a plusStrong work ethicCommunication with end users, assessing requirements and managing expectations professionally.Powered by JazzHRI9421pg7hy\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Chicago, IL",
        "url": "https://www.linkedin.com/jobs/view/react-developer-at-tech-brains-solutions-inc-3731758352?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=Ck9wg60L2dgI%2Bnx%2BUyk2dQ%3D%3D&position=22&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer",
        "company_name": "Experfy",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Contract, Job function: Information Technology, Industries: Technology, Information and Internet",
        "description": "Position Overview: (Major Functions and Non-Essential Functions): Software Engineer is suppose to design and build back-end services that support our portfolio of data-centric clinical and analytic applications. These applications leverage cloud computing, big data, mobile, data science, data warehousing, machine learning using state of the art software development applications and frameworks. Our Software Engineers ensure that these cloud-based micro-services adhere to uptime and accuracy targets, are resilient, and scale as data volumes and traffic increaseThey work closely with the data engineering, platform, and solutions teams to develop applications as required to benefit our practice and patients. Works closely with the Product Owners, Product Managers, Architects to translate requirements into code. Developing services around data warehousing, big data, cloud computing, business intelligence, analytics and machine learning. Participate in DevOps, Agile, continuous development and integration frameworks. Programming in high-level languages such as Go, Python, Java etc. Work on deployment automation/configuration management with tools including but not limited to ADO, Puppet, Chef or Ansible or Azure Pipelines, CloudFormation, Terraform following a DevOps model. Ensure all appropriate documentation of processes and source code is created and maintained. Communicate effectively with peers, leaders, and customers throughout the organization. Participate in expert level troubleshooting and resolve problems through root cause analysis, data and system investigation. Continues to build knowledge of the organization, processes and customers. Performs a range of mainly straightforward assignments. Uses prescribed guidelines or policies to analyze and resolve problems. Receives a moderate level of guidance and directionThe work at hand is support and enhancement of an existing system used by our Occupational Health and Recovery Claims Services groups. This web application is written in C# (.Net framework, v4.8) and uses a SQL Server back end. There is one portion of the system deployed to an on-prem server and a second, externally exposed, section that is deployed to Microsoft Azure. While the system is deployed to Azure, little cloud knowledge is required as the build/deployment pipeline is already in placeWe have a team of business analysts that we work with that provide requirements for new feature requests. We also have a backlog of technology upgrades (updating old programs written in Java 6 to .Net). We're looking for someone that can assist with those activitiesWe have a team of business analysts that we work with that provide requirements for new feature requests. We also have a backlog of technology upgrades (updating old programs written in Java 6 to .Net). We're looking for someone that can assist with those activities.RequirementsSkills we're looking for:C# ProgrammingSQL (Capability to write SQL statements to query or update data)Web application development (jQuery for JavaScript and Bootstrap CSS)Has Achieved Competency in the Following Areas, Job Knowledge and Additional ConsiderationsPreferred qualifications for this position include:Â· Ability to use a wide variety of open-source technologies and cloud-based services.Â· Experience with Google and Azure cloud environmentsÂ· Experience in databases, analytics, big data systems or business intelligence products Â· Experience with building high-performance, highly available and scalable distributed systems.Â· Experience developing software for healthcare related industries.Minimum Degree Required: Bachelor's DegreeRequired Skills: BOOTSTRAP CSQL SERVERAdditional Skills:JQUERYJAVASCRIPT\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Rochester, MN",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-at-experfy-3729843557?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=gmlk2KozEdRfbarF3lqL7Q%3D%3D&position=23&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer – Entry Level",
        "company_name": "General Dynamics Mission Systems",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "At General Dynamics Mission Systems, we rise to the challenge each day to ensure the safety of those that lead, serve, and protect the world we live in. We do this by making the world’s most advanced defense platforms even smarter. Our engineers redefine what’s possible and our manufacturing team brings it to life, building the brains behind the brawn on submarines, ships, combat vehicles, aircraft, satellites, and other advanced systems. We pride ourselves in being a great place to work with this shared sense of purpose, committed to a diverse and exciting employee experience that drives innovation and creates a community where all feel welcome and a part of something amazing. We offer highly competitive benefits and a flexible work environment where contributions are recognized and rewarded. To see more about our benefits, visit https://gdmissionsystems.com/careers/why-work-for-us/benefits General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce. EOE/Disability/Veteran Requires a Bachelor’s degree in Software Engineering, or a related Science, Engineering or Mathematics field. Agile experience preferred. Due to the nature of work performed within our facilities, U.S. citizenship is required. ROLE AND POSITION OBJECTIVES:As a software engineer for Cyber Systems, you’ll be a member of a cross functional team responsible for creating our PitBull and truMLS products.  What sets you apart:Clear understanding of the software engineering concepts, principles, theories, software development process, and agile methodologyClear understanding of the software development process, with agile experienceAbility to grasp and apply new information quickly and handle increasing responsibilities with growing complexityTeam player who thrives in collaborative environments and revels in team successCommitment to ongoing professional development for yourself and othersOur Commitment to You:An exciting career path with opportunities for continuous learning and development.Research oriented work, alongside award winning teams developing practical solutions for our nation’s securityFlexible schedules with every other Friday off work, if desired (9/80 schedule)Competitive benefits, including 401k matching, flex time off, paid parental leave, healthcare benefits, health & wellness programs, employee resource and social groups, and moreSee more at gdmissionsystems.com/careers/why-work-for-us/benefits Workplace Options:Option to work remote. While on-site, you will be a part of the Dedham, MA facility.  \n\n\n        Show more\n\n        \n\n\n        Show less",
        "location": "Dedham, MA",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-%E2%80%93-entry-level-at-general-dynamics-mission-systems-3727235499?refId=VJGCKRUmVaXvl32Q2Y4XZg%3D%3D&trackingId=AmsWtMSKuwkAxxV1mXMeFQ%3D%3D&position=24&pageNum=2&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Entry level Software programmer (Remote)",
        "company_name": "SynergisticIT",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "SYNERGISTICIT is aware that the Job Market is Challenging because of Tech Layoffs. The Job market is flooded with hundreds and thousands of laid-off Jobseekers competing with existing Jobseekers. For entry-level Job seekers to get client interviews and jobs they need to differentiate themselves by ensuring they have exceptional skills and technologies to be noticed by clients.Since 2010 we have helped Jobseekers differentiate themselves by providing clients with candidates who have the requisite skills and experience to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a Job we make careers. All Positions are open for all visas and US citizens We at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped thousands of candidates get jobs at technology clients like Apple, Google, and Paypal, western union, Client, visa, Walmart labs, etc., to name a few. We have an excellent reputation with the clients. Currently, we are looking for Entry Level software programmer(Remote)Who Should Apply Recent Computer Science/Engineering /Mathematics/Statistics or Science Graduates looking to make their careers in IT Industry We welcome candidates with all visas and citizens to apply. We assist in filing for STEM extension and also for H1b and Green card filing to CandidatesWe also offer Skill enhancement programs for candidates who are either missing skills or lacking Industry/Client experience with Projects and skills. Candidates have difficulty finding jobs or cracking interviews or want to improve their skill portfolio. If they are qualified with enough skills and have hands-on project work with clients then no need for skill enhancement.Candidates can benefit from skill enhancement if they fall into the below categories.Candidates who Lack Experience or are fresher with No actual Job experience with projects with clients who Have had a break in careers Lack Technical Competency or skills being demanded by clients Different visa candidates (Like OPT/H4EAD/L2EAD) who want to get employed and settle down in the USA please check the below links to see success outcomes of our candidates (url removed)Watch the below videos of us participating in Industry events with the Top companies in Technology at Oracle Cloud World/Oracle Java One (Las Vegas) and at Gartner Data Analytics Summit (Florida)Oracle Cloud World Event (OCW) Las Vegas 2022 | SynergisticIT - YouTube (url removed)(url removed) (url removed)(url removed) SynergisticIT at Gartner Data and Analytics Summit 2023 - YouTube(url removed) (url removed) (url removed)If you have relevant skills and industry experience, please apply if not then candidates can opt for Skill enhancement.For getting help with interviews please visit(url removed)REQUIRED SKILLS For Java /Software Programmers Bachelor's degree or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT Highly motivated, self-learner, and technically inquisitive Experience in programming language Java and understanding of the software development life cycle Project work on the skills Knowledge of Core Java, java script, C++ or software programming Spring boot, Micro-services, Docker, Jenkins and REST API's experience Excellent written and verbal communication skillsFor data Science/Machine learningRequired Skills Bachelor's degree or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT Project work on the technologies needed Highly motivated, self-learner, and technically inquisitive Experience in the programming language Java and understanding of the software development life cycle Knowledge of Statistics, SAS, Python, Computer Vision, and data visualization tools Excellent written and verbal communication skillsPreferred skills: NLP, Text mining, Tableau, Power BI, Time series analysisPlease understand skills and relevant experience on real-world projects are required by clients for selection even if it's a Junior or entry-level position the additional skills and Project work with hands-on experience building projects at the client site are the only way a candidate can be picked by clients. If not having the skills or hands-on project work at the client site, candidates can opt for skill enhancement to gain the required skills and project work. No third-party candidates or c2c candidatesplease only apply to the postingNo phone calls, please. Shortlisted candidates would be reached out to.\n      \n\n        Show more\n\n        \n\n\n        Show less",
        "location": "San Diego, CA",
        "url": "https://www.resume-library.com/job/view/123808184/Entry-level-Software-programmer--Remote-"
    }
]