[
    {
        "job_title": "Solutions Engineer",
        "company_name": "Mark43",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQFV-Mtue0GltA/company-logo_100_100/0/1659553790419?e=2147483647&v=beta&t=IFwDZSJhhnU1DEAjSc7Ek8i47a0CHGDqN7WOR2ipNh0",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "Mark43 is approved to hire in 39 states, including AL, AZ, CA, CO, CT, DC, DE, FL, GA, IL, IN, IA, KS, KY, LA, MA, MD, ME, MI, MN, NE, NH, NJ, NM, NY, NC, OH, OR, PA, SC, SD, TN, TX, UT, VA, VT, WA, WV, and WI. Before applying to a remote role, please ensure that you are able to perform the position in one of the states listed above. State locations and specifics are subject to change as our hiring requirements shift.Mark43's mission is to empower communities and their governments with new technologies that improve the safety and quality of life for all. We build powerful, scalable, and elegant software that sets a new standard for the tools upon which our first responders rely. Our users are diverse, and we are therefore committed to embracing diversity of thought and experience within our team.We are seeking a Solutions Engineer to join our team. A background in public safety is strongly preferred. This role requires close collaboration with several different internal teams at Mark43. You will be responsible for designing and implementing software solutions that meet the needs of clients. To be successful in this role, you will need to establish a personal rapport with potential and current customers, vendors, and partners. You will need a deep understanding of the technical requirements that will ensure the success of our product deployments to public safety agencies. This is a fully remote position with a 25% travel expectation. Primary Responsibilities: Proposal Engineering: You will create documentation for project bids, including estimated timelines, costs, and potential risks. You will review requests for proposals (RFPs) to analyze the company's requirements and determine if the customer is a good fit.Identify customer needs and develop solutions that meet their requirements. Work alongside other sales team members to present products to clients and answer any technical questions they may have. Analyze client requirements and determine if a potential customer is a good fit for Mark43. Outline anticipated timelines for projects by leveraging internal resources and determining the most efficient processes. Create documentation for project bids, including estimated timelines, costs, and potential risks. Develop practical demonstrations of proposed solutions. Test newly implemented software and correct any programming flaws that lead to system issues. Secondary Responsibilities: Solutions Engineering: You will collaborate with other department engineers to create practical demonstrations of proposed solutions. You are required to test the implemented software and fix programming bugs that create errors with the system.Implementation Engineering: You will be responsible for SCOPING Mark43 technologies with enterprise systems. You will work with a variety of clients, from small agencies to large police departments. You will help them integrate new software into their existing infrastructure.What You Will Need:To be successful in this role, you should have:A bachelor's degree in Computer Science, Software Engineering or related engineering fields. Experience developing IT and cloud infrastructure. Up-to-date understanding of best practices regarding system security measures. Experience with software engineering, customer experience, and design architecture. Advanced understanding of business analysis techniques and processes. Project development and leadership skills are preferred. Mark43 is committed to the full inclusion of all qualified individuals. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. As part of this commitment, we will ensure that persons with disabilities are provided reasonable accommodations. If reasonable accommodation is needed, please email recruiting@Mark43.com requesting the accommodation.",
        "location": "New York, NY",
        "date": "10/09/2023 02:24PM",
        "url": "https://mark43.com/list-job/?gh_jid=5392308&gh_src=b9b520a21us"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "RapDev",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQFPvZO6YeDZ3Q/company-logo_100_100/0/1688649253688?e=2147483647&v=beta&t=LYNbiK9wvZYkWfge7OaaDGojgS4Z9T3rZa4ZclNt5yE",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Information Technology & Services",
        "description": "DescriptionAbout RapDevWe specialize in modern ITOM & DevOps ServiceNow delivery, and implementations & integrations for Datadog. Our experienced team of SREs and DevOps engineers powerfully brings together these two ecosystems to drive better observability, availability, and deployment velocity across your organization.About The JobRapdev is seeking a highly skilled Presales Solutions Consultant to join our Datadog and/or ServiceNow Sales team. In this role, you will be responsible for providing technical expertise and guidance to customers and prospects, helping them understand and utilize the full range of RapDev’s services to maximize the value of their Datadog or ServiceNow platform. You will work closely with the sales team, customers, and technical staff to design and implement customized solutions that meet each customer's unique needs.ResponsibilitiesCollaborate with the sales team to identify and qualify new opportunities and develop a deep understanding of customer needsConduct in-depth technical presentations and demonstrate unique expertise in achieving the value of Datadog's or ServiceNow’s solutions in production and at scaleDesign and propose customized solutions that leverage Datadog's or ServiceNow's products and RapDev services to meet customer needsLead technical discussions with customers and prospects, answering questions and providing guidance on technical features, functionality, and integrationConduct hands-on proof of concept testing and product evaluations to demonstrate the value of Datadog's or ServiceNow’s solutionsDevelop technical content and collateral to support sales and marketing initiativesAct as a subject matter expert on Datadog's or ServiceNow’s solutions and stay up-to-date on industry trends and competitive offeringsContinuously learn and improve technical knowledge of ServiceNow and supporting technologiesWork collaboratively with the sales, marketing, and engineering teams to ensure successful customer outcomesRequirementsBachelor's degree in Computer Science, Engineering, or a related field5+ years of experience in a presales or technical sales role, preferably in the software industryHands-on experience with Datadog or ServiceNow solutions and a strong understanding of use cases and value propositionsExcellent presentation and communication skills, with the ability to convey technical concepts to a non-technical audienceStrong problem-solving skills and the ability to think creatively to develop customized solutionsAbility to work independently and manage multiple projects and prioritiesStrong collaboration and team-oriented mindsetCommitment to ongoing learning and professional developmentBenefitsHealth Care Plan (Medical, Dental & Vision)Retirement Plan (5% 401k Match, IRA)Unlimited Paid Time Off (4-week minimum) (Vacation, Sick & Public Holidays)Family Leave (Maternity, Paternity)Commuter BenefitsFree Food & Snacks & LunchEquity (without a vesting period)Relocation AssistanceSL & LT DisabilityVisa Sponsorship",
        "location": "Boston, MA",
        "date": "10/09/2023 02:24PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-rapdev-3730306453?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=5oNEA%2F1%2FdeYacmoTh9DmrQ%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Thena",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQFoSufBlGCzkQ/company-logo_100_100/0/1683091349274?e=2147483647&v=beta&t=yyF_7aWNyEEPDarlKXP0TF_-NQmJXLqJDT1LmxFIM4A",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "About us:Thena is the leading platform for customer engagement and intelligence, built for the needs of modern businesses. Forward-thinking brands such as Mixpanel, WorkRamp, Sprig, Incident, and Etsy use Thena to supercharge their customer facing functions by tapping into the synergy of AI and real-time messaging platforms like Slack.Founded in 2022 and backed by First Round Capital and Lightspeed VP, we are a fast growing team spanning across Mountain View, New York City and Bangalore. Thena is ranked by G2 as #1 for chat/live support, workflows, and ticket response user experience. We believe the future of customer communications is one of simplicity, unity, and empowerment. Interested in learning more? Visit www.thena.aiRole:Work directly with customers to understand their technical challenges and requirements. Design and propose solutions that maximize value and utility for both the customer and Thena. Collaborate closely with the customer success, product, and sales teams to ensure holistic support and solutions. Engage in continuous learning about Thena's products, aiming to become an expert and advocate. Troubleshoot and resolve customer challenges in real-time or by coordinating with the appropriate internal teams. Participate in pre-sales activities, product demos, and technical Q&A sessions. Collect feedback from customers to drive continuous product improvement. Responsibilities:Proven experience in a solutions engineering or technical consultant role. Strong understanding of Thena's technology and ability to match product capabilities to customer needs. Collaborative nature, able to work seamlessly with customer success, product, and sales teams. Strong problem-solving skills; ability to tackle complex challenges with innovative solutions. Excellent communication skills, both written and verbal. Passion for ensuring a positive customer experience and journey. Benefits:Comprehensive health insurance for you and your family, ensuring peace of mind. ESOPs offering a stake in our company's success and growth trajectory. Generous flexible budgets dedicated to your learning and development. Access to high-end hardware and software tools, ensuring the best in performance and innovation. Compensation Range: $80,000 - $120,000",
        "location": "Mountain View, CA",
        "date": "10/04/2023 02:24PM",
        "url": "https://boards.greenhouse.io/thena/jobs/4097586007?gh_src=87f6d5af7us"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Arthur",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQGPgeJ07g9Ntw/company-logo_100_100/0/1688265734760?e=2147483647&v=beta&t=DwOLPOZb5tEJVtYd5SFxr5amDqwqSbmtM0SP3dcP1JA",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "About ArthurAt Arthur, we are deeply passionate about building technology to make AI understandable, effective, and fair. Arthur makes machine learning work for enterprises through performance monitoring, explainability, and bias detection. We're built by AI experts and backed by world-class, diverse investors.This position is a rare (and fun!) opportunity to help shape the future of AI and its real-world impact. We are an equal opportunity employer and believe strongly in front-end ethics: building a company and industry where strong performance and a positive human impact are inextricably linked.About The RoleArthur is looking for a Solutions Engineer who will work with some of the world's most innovative companies to help deploy fair, safe, and reliable ML systems. This person will be a team player and builder who is ready to contribute to the success of Arthur and our clients, and they'll have the opportunity to learn every day from the brightest minds in AI, both at Arthur and amongst our customers and partners.What You'll DoPartner with Sales to identify technical problem statements that impact clients' AL/ML initiatives, and map issues and challenges to features and capabilities of the Arthur platformEngage with data scientists, model owners, line-of-business, executives, and other related personas to unpack AI problem statements and deliver high-impact business outcomesBuild strong relationships with technical users to ensure they are successful in their AI agendaWork with customers to plan and execute successful proof-of-value activities by testing Arthur's solutions within their own environmentsInterface with our Product team to provide customer feedback and help determine priorities for product evolutionWhat We're Looking For4-5+ years of experience in sales engineering, solutions engineering, or similar relevant experience with enterprise software productsSolid experience with software product demonstrations, technical deep-dive presentations, and technical objection handlingAbility to engage effectively with both technical and executive audiences to demonstrate business valueA solid understanding of machine learning concepts, use cases and benefits, including experience building and running models with Python, Jupyter Notebook, etc. General knowledge of big data, infrastructure and cloud technologies and how these co-exist in order to ensure AI deliveryThe ability to effectively collaborate and communicate with internal teamsThe ability to operate in ambiguity and adapt to evolving requirements in a startup environment; eager to build from the ground up, with a \"no task too small\" mindsetWhat To Expect At ArthurTeammates who value curiosity, hard work, collaboration, and creative problem-solving -- and good swag. A team of professionals who are passionate about our work and making a positive impact through AI. A caring culture; we value and prioritize our team's physical and mental health, encouraging and celebrating life outside of work. Autonomy to pursue your role and interests with room to grow, with a team behind you that always has your back. Joy, humor, and a little dose of healthy competition (in our business, we win as a team; on company game night, may the best Arthurian win…). We offer Competitive compensation plus medical, dental, and vision insurance, and a 401K. Our target base salary range for this role is $175,000 - $220,000, based on your experience and how your skills align with role requirementsEquity in what we're building together, backed by some of the most respected VCs in the industry. A flexible learning and development budget: we'll cover a masters in computer science, or support ways to learn and grow in the areas that matter to you. Highly discounted fitness and wellness benefits. Flexible PTO with vacation minimums, which we really want you to take and enjoy. The ability to work in a highly flexible hybrid environment with our team in NYC. Arthur is an equal-opportunity employer; we believe strongly in front-end ethics: building a company and industry where strong performance and a positive human impact are inextricably linked. This reflects in our desire and commitment to build teams that comprise different backgrounds and experiences. Arthur provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "location": "New York, NY",
        "date": "10/09/2023 02:25PM",
        "url": "https://www.arthur.ai/job-req?gh_jid=4821789003&gh_src=1dac3b353us"
    },
    {
        "job_title": "Solution Engineer",
        "company_name": "BillingPlatform",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQFezrdT8v5m8g/company-logo_100_100/0/1660776720775?e=2147483647&v=beta&t=NidLiysi89RejKi_xbsowe-cEIiFZCOUPSSTULIf0Sk",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Sales, Industries: Technology, Information and Internet",
        "description": "BillingPlatform is an industry-leading, fast-growing SaaS company. Our decision to build a world-class revenue lifecycle management platform was driven by the belief that all industries face disruption with respect to how they monetize goods and services. Leveraging successful years of product development and customer feedback, and partnering with leading private equity partner Columbia Capital, we built the industry's most powerful, cloud-based revenue management platform able to automate the entire workflow from quote to cash (CPQ, mediation, billing, invoicing, revenue recognition, payment, and collections), providing enterprises a flexible and scalable platform to monetize the customer relationship using virtually any variable.We have achieved remarkable recognition in the industry, having been listed on the Deloitte Tech Fast 500 as one of the fastest-growing companies in North America for three consecutive years and hold a position in the Inc. 5000 for two years running. In 2023, we are recognized by Forrester Wave as the leading SaaS Recurring Billing Solution, received the top score in MGI 360™'s report on agile billing, honored with the 2023 CODiE award for Best Subscription Billing Solution, and awarded the Silver Stevie® Award from the 2023 American Business Awards®. Our reputation as a leader is further endorsed by industry analysts and Fortune 500 companies.At BillingPlatform, our values-based culture centers around collaboration, innovation, and transparency. We seek bright, enthusiastic, and creative professionals looking to be part of an incredible team focused on challenging the status quo and driving transformational value to customers. As a Solution Engineer, you will be part of the team responsible for technically and strategically positioning the BillingPlatform solution to IT, Management, and Finance executives. You will leverage your business and technical skills to solicit business requirements and develop a technical sales strategy. You have a passion for consulting with prospects to drive unmatched business value for customers.ResponsibilitiesWork with the Enterprise sales team to develop sales strategy and effectively position the company and solution in sales pursuitsEffectively configure and present the BillingPlatform solution to support prospect’s unique requirementsSuccessfully align BillingPlatform with business drivers and clearly differentiate the solution from the competitionDevelop and demonstrate extensive knowledge of BillingPlatform’s solution, platform, integration capabilities, infrastructure, and securityRespond to RFI’s and RFP’sPartner with Product Management to provide customer feedback and insight to further the BillingPlatform productRequirementsAs a Solution Engineer, you will be part of a team responsible for technically and strategically positioning the BillingPlatform solution to IT, Management, and Finance executives. You will leverage your business and technical skills to solicit business requirements and develop a technical sales strategy. You have a passion for consulting with prospects to drive unmatched business value for customers.Qualifications3+ years Solution Engineering experience in high growth SaaS company selling to commercial and enterprise companiesConsultative, credible, and passionate, with excellent presentation skillsUnderstanding of finance, revenue recognition, quote-to-cash processes, and billingUnderstanding of relational database, web technologies, and API integrationsDesire to join a fast-paced, high-growth environment with unlimited growth opportunityAbility to travel as requiredBenefitsJoin one of the fastest-growing companies in the United StatesReceive competitive compensation that includes a robust benefits package—medical, dental, vision, life and disability, HSA, FSA, and many perks related to health and wellness provided by our medical carriers401(k) match that is 100% immediately vestedDiscretionary and charitable time off programHome office setup allowanceThe base salary range for this position is $110,000 to $180,000 per year, depending on job-related knowledge, skills, experience, and market location. Salary information is provided per state regulations in CA, CO, NY, and WA.BillingPlatform provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law.",
        "location": "United States",
        "date": "10/05/2023 02:25PM",
        "url": "https://www.linkedin.com/jobs/view/solution-engineer-at-billingplatform-3733900803?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=DfmIJWI0%2FDGb%2BJ7mTarwPQ%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer - West",
        "company_name": "ScanSource",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQF-NcnN0qaTRg/company-logo_100_100/0/1688150239165?e=2147483647&v=beta&t=DrzRLDKqrLDckQ0_9ibj971gLYwBppTzEyVIRaKR_GU",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Job DetailsDescriptionIntelisys, a ScanSource company (NASDAQ: SCSC) located in the North Bay, is the industry's leading Technology Services Distributor and has been named as North Bay Business Journal's \"Best Places to Work\" for the fifth time. Intelisys is also recognized as an Entrepreneur Magazine winner of the “Best Entrepreneurial Companies in America Award”. We are looking for a Solutions Engineer that would be responsible for first-level technical support resource for sales partners on all opportunities, assist with on-boarding activities as required for new partners within their first year, and other engineering-related tasks to support sales partner sales activities.This assignment is a quota bearing position focused both on bringing in new revenues through Sales Partners, as well as working in a general technical-sales support role under the Director of Engineering to drive profitable margin growth overall.Essential FunctionsRegional SME ensuring end-user requirements align with best-fit solutions and suppliersDeliver differentiated assistance in qualifying cloud, networking, and communications opportunities to ensure that Intelisys and ScanSource resources are positioned to optimize performance and profitability.Work directly with sales partners and target customers in defining opportunities.Work with vendor suppliers in understanding their value propositionTo partner with sales to achieve monthly revenue targets and quotasCoordinate supplier sales and engineering supportKey point of escalation at the supplier level to ensure vendor performance and issue resolutionDefines the value proposition of each Intelisys supplier and how they fit strategically into the Intelisys portfolioCoordinate Intelisys supplier sales presentations via meetings and / or conference callsAttend and manage technology education sessions both remote as well as onsiteInfluence profitable revenue and margin targetsParticipate in on-boarding activities with partner support as requiredActively orient Sales Partners to the Intelisys value proposition and educations programsSupport Director of Engineering on assigned tasksWork with the marketing department to develop communication strategy to enhance Intelisys’ reputation as the leading Technology Distributor for best of breed cloud suppliers, education and sales resources & support.Provide feedback to Director of Engineering regarding holes in the overall Intelisys technology portfolioCompensationBase Range : $108,000-$120,000 and total compensation range $180,000-$200,000Actual annual salary offered to a candidate will be based on a number of variables including work experience, education and skills/ achievements, and will be mutually agreed upon at the time of offer.For non-sales roles and sales roles with a variable component, total compensation reflects both a base salary and variable targets .While we’re committed to providing top-tier solutions, we’re just as committed to supporting our own team. Our employees enjoy a variety of comprehensive benefits, including medical/dental/vision coverage, life insurance, and a 401(k) plan with matching provision. Outside of CA, ScanSource grants 128 hours of paid time off (PTO) each calendar year (prorated for date of hire). In the state of CA, employees accrue a set number of hours each pay period equaling the same 128 hours of PTO. ScanSource also celebrates 8 paid company holidays.ScanSource, Inc. is an Equal Opportunity EmployerEOE/M/F",
        "location": "Addison, TX",
        "date": "10/09/2023 02:25PM",
        "url": "https://recruiting.ultipro.com/SCA1004SCSO/JobBoard/220bcab6-cf46-46e3-8fd5-181b273b0628/OpportunityDetail?opportunityId=824f44fb-4640-4eda-bb96-430ecdf9c7db"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "iBase-t",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQEdDb5Tbic3mg/company-logo_100_100/0/1684033690149?e=2147483647&v=beta&t=PnnqZKrGG1OwQK66BUHc4yXuE7_YjGbfBxP6h2xML2c",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Sales, Industries: Technology, Information and Internet",
        "description": "About The CompanyHeadquartered in Lake Forest, California, iBase-t simplifies complex manufacturing. Its solutions replace disparate production, quality, and MRO applications with paperless, digitally integrated solutions. From process and inspection, planning to the shop floor, and the execution of sustainment activities, iBase-t is a proven, pre-configured, and out-of-the-box solutions deliver real-time visibility and control that accelerates manufacturing performance.We apply that same dedication to creating a diverse and inclusive work culture that inspires our core values: Professionalism, Excellence, Teamwork, Continuous Improvement, Customer Focus and Innovation.We believe our team members are the best in the business, and we will continue to recruit, retain, develop and reward our most important asset – our people!Solution Engineer supports the sales team to gain new customers and help drive business growth. They will be motivated risk takers and team players. Solution Engineers are strategic and focused thinkers who understand their prospects’ business and how the iBASEt solutions deliver value inside and out. They have the courage and poise to quickly develop relationships and to get through to the right decision makers and make an impact upon the customer’s sales. They have experience in managing individual as well as team targets and have a natural flair for selling. To thrive in this role, you will be an overachiever who is always pushing yourself to do more. You will be able to positively overcome resistance to gain commitment, establishing long term client relationships and help make iBASEt’s concepts simple and compelling. You enjoy taking a problem and converting into relatable ideas your customer can understand. You are both a logical visionary, technically minded and can quickly assess a situation and adjust your presentation, discussion, and focus to the audience level.Essential Functions:Partner with and support the Account Executives (AE) to accelerate iBase-t software revenue growth. Collaborate with AE team and provide input on region and client account plans as necessary. Assist in business case development – value of iBase-t solutions against client strategic objectives. Provide and deliver technical presentations and demonstrations to describe how iBase-t products will best meet the customer’s business and technical requirements. Develop a strong ability to deliver targeted messaging around iBase-t and customer initiatives. Become proficient in all iBase-t solutions – with the ability to present and demonstrate against client requirements. Evaluate product/service marketability in terms of customers’ technical and manufacturing needs. Develop and deliver workshops and product demonstrations. Maintain up-to-date awareness of activities, industry trends & government regulations. Establish long-term, ongoing customer relationships. Describe industry best practices to prospects in an effective manner. Provide fundamental training and best practices. Lead or assist with Return on Investment (ROI) evaluations. Recommend solution enhancements or modifications to customers. Team with product development and R&D departments to drive customer value for roadmap and future capabilities. Relay customer needs/wants back to Product to drive development priority. Assist in all aspects of bringing an account to closure. Support services implementations as requested. Support partner sales as requested. Support marketing activities through presenting product and industry knowledge via webinars, conferences, website materials and other marketing collateral Requirements:Knowledge of Aerospace & Defense manufacturing processes Extremely detail oriented and customer focused. Analytical nature with the ability to solve complex business issues. Excellent knowledge of basic computer systems functions & MS Office Suite Excellent communication and customer relations skills, both written and oral, with the ability to build effective customer relationships. Well-developed presentation skills Ability to work and problem solve individually as well as in team setting. Hands-on experience with iBASEt Solumina, Product Lifecycle Management systems (e.g., PTC Windchill, Siemens Teamcenter), Enterprise Resource Planning systems (SAP, Oracle, IFS, Infor) or Salesforce CRM Past software deployment experience (e.g., MES, PLM, ERP) Experience with general consulting skills that include team facilitation, business case development, strong business analysis skills, process mapping, and business process redesigning. Knowledge of basic IT functions: server/VM configuration, authentication factors (SAML, SSO, LDAP), certificate authority (SSL) Competency with Atlassian (Confluence, Jira), Roadmonk or Zendesk products Must be able to travel nationally, up to 50% at times, providing on-site consulting work to clients and can work remotely from your home officeSalary Midpoint $110,000.00RequirementsBachelor's degree in technical or business-related fieldFive or more years of hands-on experience in complex discrete manufacturing such as aerospace, medical devices, defense, or other highly regulated manufactured products and their supply chainThree or more years' experience working with an electronic execution system (e.g., MES, MoM, PLM) BenefitsWe are committed to offering the best to our employees. We offer a comprehensive benefits package that includes:Competitive salaryYearly Performance BonusesReferral BonusesComprehensive Medical/Dental/Vision PlansCompany Paid LTD/STDCompany Paid Life InsuranceHSA/FSAUnlimited Vacation40 hours of sick time per yearPaid Holidays (10 per year)WFH Equipment StipendInternet/WIFI stipend401K - company matchEducational Assistance ProgramOur company values work-life balance, and for this offers benefits such as Remote Work, Flexible hours, and a Wellness program.",
        "location": "Lake Forest, CA",
        "date": "10/09/2023 02:25PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-ibase-t-3710330715?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=bUhokulXkkZF20tMGx%2FPTQ%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Courier",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQGuFeTsshD-cw/company-logo_100_100/0/1616806962489?e=2147483647&v=beta&t=m3JgsD7T0Tlqvebyt0YZLZ-L9z7SXuDU_u4PcOGOv00",
        "listing_details": "Seniority level: Not Applicable, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Transportation, Logistics, Supply Chain and Storage",
        "description": "At Courier, we are on a mission to make software-to-human communication delightful.Courier is doing for notifications what Stripe did for payments, making it easy for developers to build and manage notifications infrastructure for mobile and web apps. We’ve combined a powerful API with a web-based design studio that lets teams create automated product-triggered notifications that deliver the right message to the right user at the right time over email, Push, Slack, SMS—you name it.Backed by top-tier investors including Google Ventures, Bessemer Venture Partners, Matrix Partners, Twilio, SendGrid, Slack, and Y Combinator, our goal is to build a platform that developers don’t just use but one that they love. If you want to push the frontier in developer tooling, we want to work with you.We’re solving a complex and tedious problem for developers: product notification infrastructure. Companies like LinkedIn, Slack, and GitHub dedicate large engineering teams and tens of millions of dollars per year to building and maintaining the systems that power their user notifications, alerts, reminders, digests, and other programmatic communication. With Courier, the next generation of startups will be able to dedicate those resources to delivering customer value rather than reinventing the wheel.As a Solutions Engineer, you will educate and guide prospective customers on how Courier Enterprise can help them deliver a better notification experience. You will be the technical advisor during the customer's technical evaluation of Courier and responsible for ensuring they understand how Courier works. You should be passionate about helping software engineering teams work more efficiently, reduce complexity, and in general doing more with less.ResponsibilitiesAdvise customers on the complexity of notification infrastructure and the different ways in which Courier can be leveraged to reduce that complexityCreate solutions to customer's pain points around notification infrastructureBecome a domain expert on notification infrastructure Demo Courier Enterprise to technical audiencesBecome a Courier product expert and communicate our value and features to potential customersBe the voice of the customer by sharing customer feedback to the product and engineering teamsQualifications 3+ years of experience consulting with software engineering teamsExperience building technical proof-of-conceptsExcellent communicator with the ability to simply explain complex technical conceptsOur Values Zoom Out: Don't just stay in your lane. Take the blinders off and look at the entire business Keep It Real: Be honest about what is going well and what isn't. Celebrate wins and have hard conversations Talk To Customers: Working with developers isn't a job role here - it is something we all need to do. Hop on a Zoom, reach out in Slack, and build a relationship Have An Opinion: Each team member is an expert on what success will look like for Courier. Nobody else has the answers JFDI: There will always be more work to do than people to do it. If you see something that needs to get done, just f*cking do it. Don't wait for someone elseDiversity, Equity & InclusionAt Courier, we believe that our diverse perspectives are our biggest strengths — and that embracing them will create real change in how software communicates with humans. As an equal opportunity employer, we are committed to building an inclusive environment where you can be you. Please don’t hesitate to ask if we can accommodate you in any way, both during the interview process and after.Benefits Top of market salary Generous equity plan Top of the line health insurance plan (medical, dental & vision) covered 100% for both you and your dependents 401k through Vestwell Flexible health spending account including $500 employer contribution Unlimited paid time off (1 week per quarter required) $100 monthly wellness stipend 12 covered therapy sessions per year through Samata Health A brand new workstation and credit card to cover any other necessary expenses Free lunch in the office, DashPass covered, and $25 DoorDash credit on Fridays $2000 annual personal development budget $100 monthly commuter benefit contribution Other perks and discounts through SequoiaSecurity & ComplianceCourier takes protecting our customers' data – and of their notification recipients – seriously. Every Courier employee goes through security training and a background check as part of onboarding. Each employee is expected to follow Courier's security and compliance processes and uphold industry best practices.",
        "location": "San Francisco, CA",
        "date": "10/09/2023 02:26PM",
        "url": "https://jobs.lever.co/trycourier/cbd10d22-0c4a-4057-a1ce-a2392362e9ea/apply?lever-source=LinkedIn"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Conveyor Solutions, Inc.",
        "company_logo": "https://media.licdn.com/dms/image/C510BAQGc4Cn0z0W2Hw/company-logo_100_100/0/1519881467166?e=2147483647&v=beta&t=gn4W9aH7S2Lf8RpXeJ2lVYyLYbNx34n-xXHkS1DXJB8",
        "listing_details": "Employment type: Full-time",
        "description": "POSITION OVERVIEW: The Solutions Engineer will support our corporate and direct sales teams on estimating quotes, developing and maintaining standard work process.PRIMARY DUTIES AND RESPONSIBILITIES  Perform engineering calculations and conceptual layouts of a variety of material handling systems, including high speed sortationPerform required calculations to validate system throughput and workabilityProvide project scheduling input for systems implementationDevelop detailed SOW (mechanical, electrical, Controls, and WCS functionality)Specify and design system demolition and rework pertaining to the re-use of existing equipmentSpecify equipment and consult with vendors on project needs and deliverablesSelect vendors and document the intended use.Ensure the development and maintenance of company standards and estimating servicesEstablish the proper equipment application to meet customer’s needs and budgetEnsure competitive quotes for outside vendors (Equipment, Mechanical & Electrical installations & Controls.Coordination- Facilitate effective communication within the department and organizationEnsure a pro-active communication process back to sales team is in place so concepts, ideas, designs, etc. can be implemented up-stream to minimize repeatable errors and great ideas can be used as a competitive advantage during the sales cycle.Prioritizing workload effectively and responding to all teams in a timely fashion.Execution- Ensure the commitments are fulfilled.This includes working with the Sales Team to finalize concepts to meet customer investmentFacilitate effective communication and efficient resource deployment within the estimating group as well as with the Sales Team.OTHER DUTIES AND RESPONSIBILITIES Provide technical guidance to associates and management.Assist in proposal presentation, if requiredAssure that all company and/or project goals are properly communicated to and acted upon by all estimating personnelProject site visits to gather required dimensions and project informationDECISION MAKING Decide which equipment options and vendors are needed for the customers applicationConcepting a design, deciding the best use of available space, and best desired flow of product.  EDUCATIONBSME Mechanical Engineering, BSEE Electrical Engineering, or equivalent EXPERIENCE5+ yrs. with a conveyor manufacturer and/or systems integrator experience CERTIFICATIONS/LICENSESValid Driver’s LicenseSolidWorks, AutoCAD, PMP, PE or other professional certification a plus TECHNICAL/COMPUTER SKILLSBasic computer knowledge, Excel, Word, Outlook, Internet, QuickBooks, AutoCADUnderstanding of pneumatic and controls applications  SKILLS REQUIRED Ability to read drawings and visualize details in three dimensions.Attention to detail required.Knowledge of mechanical equipment, electrical equipment, and their installation.Excellent problem-solving skills.Effective communication abilities.Possess excellent leadership skills and have the ability to effectively lead employees in the estimating group.",
        "location": "Greater Chicago Area",
        "date": "10/09/2023 02:26PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-conveyor-solutions-inc-3727236900?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=OyA%2BL3FsbeFTig47EWJH3Q%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer (Remote)",
        "company_name": "CometChat",
        "company_logo": "https://media.licdn.com/dms/image/C510BAQHPG420VJc-Cw/company-logo_100_100/0/1549571011648?e=2147483647&v=beta&t=AeG8WASAZkifITc7vbjhOnygmWa8sLY_qtQpCl7uFpw",
        "listing_details": "Seniority level: Associate, Employment type: Full-time, Job function: Sales, Industries: IT Services and IT Consulting",
        "description": "Who We AreCometChat builds advanced digital communications infrastructure to help thousands of businesses around the world create customized in-app messaging experiences. Our products allow developers to seamlessly add voice, video and text chat to their websites and mobile apps so that their users can communicate with each other, resulting in a unified customer experience, increased engagement and retention, and revenue growth.A global business from the start, we have 100+ team members across our Denver , Salt Lake city and Mumbai offices serving over 50,000 users around the world. With solid financials, strong organic growth, and increasing interest in developer tool-focused companies (from the market and with top technical talent), we’re heading into an exciting period of growth and acceleration.CometChat is an alumni of Techstars Boulder 2019 and raised their Series A in October 2021. Investors include Signal Peak Ventures, iSeed Ventures, Range Ventures, Silicon Badia, eonCapital, and Matchstick Ventures.Job Summary:This remote position is based in the USA. Preference will be given to candidates in the Eastern time Zone.As a Business-to-Developer (B2D) company, CometChat’s product is evaluated by technical teams that often have technical questions or need a technical thought partner. The job of the Solutions Engineer is to be the technical lead on sales opportunities, working directly with potential and new customers in the technical conceptualization and design of CometChat for their intended use case. The Solutions Engineer will sit in the revenue organization and liaison with Product on product requirements and functionality.Our mission… Fuel customer growth through meaningful user-to-user engagement.Responsibilities:As part of the sales org, responsible for contributing to the overall revenue target as the technical member of deal teamsDevelop and convey out-of-the-box solutions, along with solution ideas to key decision makers to focus on their business issuesUnderstand and articulate the benefits of CometChat to educate customers on the value proposition of our productsAssist in creating Proof of Concepts and tailored demos wherever required to validate technical requirementsWorking experience in mobile developmentWork with Account managers and Business Development managers to pilot complex deal cycles with C-level executivesWork cross-functionally with sales, marketing, and engineering to ensure the timely and successful delivery of the solutions according to customer needs and objectivesRecognize product and technology disparity with customers and present a point of view to product and leadership teamsAssist sales team representatives in achieving their targets by conducting pilots, showcasing results and building convictionOther duties as assignedMust Have:Ability to multi task with a high degree with passion, strong initiative and positive attitudeExcellent written and verbal communication skills and the ability to persuade, influence, negotiate and make formal presentations in meetings and training environmentsConfident and dynamic working persona, which can bring fun to the team, and sense of humor, is a plusStrong organizational skills, judgment and decision-making skills, and the ability to work under continual deadline pressureSupervisory Responsibilities:We are expanding this function in the US; there is an opportunity to also lead this function as the team growsAdditional Eligibility Requirements:Ability to work hours that accommodate a global teamAbility to travel as required, including internationally (must have or obtain valid passport)Education & Experience:Bachelor’s Degree in Computer Science or related field3-5 years of experience in technical pre-sales or sales in a SaaS companySolid know-how of SaaS productsProficient in ReactTravel:Occasional travel for eventsSee Additional Eligibility Requirements AboveCompensation:$125,000-175,000Benefits:Equity PlanMedical, Dental, Vision: 80% Employer paid for you AND your dependentsEmployer paid Life InsuranceUnlimited Time Off Policy401kAnd more…Working @ CometChatOur Values: Go Above and Beyond | Be Relentless | Be Genuine | Have FunCometChat is committed to fostering a culture of innovation & collaboration. Our people are our strength so we respect and nurture their individual talent and potential.As a scaling business with strong financial backing, we’re excited about the opportunity in front of us. The digital communications market is rapidly expanding and our business is scaling along with it.CometChat is an equal opportunity employer that values workplace diversity. We strive to create an inclusive workplace that embraces diverse backgrounds, life experiences, and perspectives. We do not discriminate on the basis of race, color, religion, sex (including pregnancy, sexual orientation, or gender identity), national origin, age (40 or older), disability and genetic information (including family medical history or any other characteristic protected by law).Job Functions Disclaimer:The above job description reflects the general nature of work and functions of the job. It is not designed to contain or be interpreted as a comprehensive summary. Job duties are subject to change based on departmental need and changing business needs and conditions.",
        "location": "New York, NY",
        "date": "10/09/2023 02:26PM",
        "url": "https://careers.cometchat.com/jobs/PBQohIUUibcY/solutions-engineer-remote?ft_source=2000146092&ft_medium=2000139527"
    }
]