[
    {
        "job_title": "Alibaba Group-Software Engineer-Seattle, WA",
        "company_name": "Alibaba Group",
        "company_logo": "https://media.licdn.com/dms/image/C4D0BAQFm7hV8es67ZQ/company-logo_100_100/0/1662629307293/alibaba_group_logo?e=2147483647&v=beta&t=Om4tkLvTS3AxEE08mjsKhrChrYW72yKo2IrcIzgAMPs",
        "listing_details": "Seniority level: Associate, Employment type: Full-time, Job function: Engineering, Industries: Technology, Information and Internet",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<p>This is a hands-on position where you will be asked to perform work from building rock-solid components to formulate strategy and evangelize technology, mentor other engineers and provide training and support for our supported technologies. Below are some of the responsibilities you will have:</p><p>‧Design, developing and testing large-scale cloud storage services;</p><p>‧Large-scale software system deployment, management, monitoring, and diagnosis;</p><p>‧Creating innovative solutions toward system scalability, reliability, and availability problems;</p><p>‧Creating innovative solutions to tackle the engineering challenges of very complex distributed system software</p><p><br/></p><p><strong>Qualifications</strong></p><p>Minimum qualification:</p><p>‧Proficiency in C/C++ programming, Experience with Python or other scripting languages.</p><p>‧Familiar with commonly used algorithms, data structures, network programming and multi-threaded programming.</p><p>‧Excellent communication skills. Highly independent, open-minded and collaborative.</p><p>‧Creative, willing to face challenges and responsible.</p><p>‧Team work spirit: honest, diligent, and rigorous.</p><p><br/></p><p>Preferred qualification:</p><p>-Hands-on and seasoned experience in development of cloud infrastructures;</p><p>‧Deep knowledge to the internals of open source systems such as Linux, HBase,Cassandra, Hadoop, Kubernetes, and so on;</p><p>‧Experience in distributed computing environments such as MPI, Parameter Serve, TensorFlow, Caffe, PyTorch</p><p>‧Development experience with Paxos, Raft and other fault-tolerant protocols.</p><p>‧Passionate about technology, demonstrated ability to generate new ideas and innovations</p><p>‧Deep collaboration with product team on interception and enabling</p><p><br/></p><p>The pay range for this position at commencement of employment is expected to be between $128,760 and $210,600/year. However, base pay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience.</p><p><br/></p><p>If hired, employee will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.</p><p><br/></p><p>Alibaba U.S. based full time regular employees have access to medical, dental, and vision insurance, a 401(k) plan and basic life insurance, and wellbeing benefits like FSA, subject to the terms and conditions of the applicable plans then in effect. U.S. based employees are also eligible to receive up to 12 paid holidays, accrue up to 15 paid vacation days for this position, and receive up to 72 hours paid sick time (front-loaded) per calendar year.</p>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Seattle, WA",
        "date": "10/30/2023 03:40PM",
        "url": "https://www.linkedin.com/jobs/view/alibaba-group-software-engineer-seattle-wa-at-alibaba-group-3745286279?refId=zakmTJad%2BfmniWfTm%2FzZxA%3D%3D&trackingId=chz5DLGBcq60JGdqPEhBRA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work. With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility. Your Mission is Ours.<br/><br/>Lockheed Martin Space is seeking a full-time Early Career Software Engineer. In this role, you will troubleshoot and<br/><br/>implement solutions to a variety of software engineering problems in a timely manner, work in a highly collaborative environment with frequent and direct interaction with peers and occasional customer interactions, and create test scenarios for code changes to test new capability or verify defect fix using Python. The successful candidate will have experience and/or knowledge of Java and excellent team orientation, oral and written communications skills.<br/><br/>Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access.<br/><br/><strong>Basic Qualifications<br/><br/></strong>Graduate with a Computer Science or other<br/><br/>engineering related degree program from an<br/><br/>accredited college/university<br/><br/>The selected candidate must have experience<br/><br/>developing software in Java, and have<br/><br/>experience with the Linux OS.<br/><br/>Must be a US Citizen; this position will require<br/><br/>obtaining a government security clearance. This<br/><br/>position is located at a facility that requires<br/><br/>special access.<br/><br/><strong>Desired Skills<br/><br/></strong><ul><li> Agile methodology</li><li> SW lifecycle (from development through<br/><br/></li></ul>integration/testing to deployment)<br/><br/><ul><li> Domain knowledge of mission planning and<br/><br/></li></ul>scheduling<br/><br/><ul><li> IntelliJ, JMS, Junit, Gradle, Jenkins, Python</li><li> Experience with J2EE and web services</li><li> C++ and algorithm experience<br/><br/></li></ul>Strong ability to work as a member of a small<br/><br/>highly skilled team in a dynamic environment is<br/><br/><strong>Required<br/><br/></strong><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>TS/SCI w/Poly<br/><br/><strong>Other Important Information You Should Know<br/><br/></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>9x80 every other Friday off<br/><br/><strong>Pay Rate<br/><br/></strong>The annual base salary range for this position in Colorado or Washington is $57,800 - $110,800. Please note that the salary information is a general guideline only. Lockheed Martin considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/ training, key skills as well as market and business considerations when extending an offer.<br/><br/><strong>Benefits offered:</strong> Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.<br/><br/>(Washington state applicants only) Non-represented full time employees: accrue 10 hours per month of Paid Time Off (PTO); receive 40 hours of Granted PTO annually for incidental absences; receive at least 90 hours for holidays. Represented full time employees accrue 6.67 hours of PTO per month; accrue up to 52 hours of sick leave annually; receive at least 96 hours for holidays. PTO is prorated based on hours worked and start date during the calendar year.<br/><br/>This position is incentive plan eligible.<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>At Lockheed Martin, we use our passion for purposeful innovation to help keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.<br/><br/>With our employees as our priority, we provide diverse career opportunities designed to propel, develop, and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. We place an emphasis on empowering our employees by fostering an inclusive environment built upon integrity and corporate responsibility.<br/><br/>If this sounds like a culture you connect with, you’re invited to apply for this role. Or, if you are unsure whether your experience aligns with the requirements of this position, we encourage you to search on Lockheed Martin Jobs, and apply for roles that align with your qualifications.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>SPACE<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Littleton, CO",
        "date": "11/13/2023 03:41PM",
        "url": "https://www.lockheedmartinjobs.com/job/-/-/694/56943637664"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Part-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.<br/><br/>With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work.<br/><br/>At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility.<br/><br/>Your Mission is Ours.<br/><br/>Lockheed Martin Space in King of Prussia, PA is seeking a full-time Early Career Software Engineer. In this role, you will join the Warriors Path team in building software solutions to model coordinated space activities for a wide range of scenarios.<br/><br/><ul><li> Incredible technology innovation centered on Space wargaming, strategy, tactics, techniques, gaming and optimization strategies.</li><li> Looking for full-stack software engineer help energized team design, implement and deploy capabilities for our Stakeholders. Performance of all phases of software development including design, implementation, testing and verification<br/><br/></li></ul>The successful candidate will have experience/training (BS) in a science or technology related discipline and experience in at least one of these skill or computer language areas: C, C++, C#, Java, XML, Windows, .NET, and LINUX/UNIX, system software and scripting development, Java programming, web development, System analysis, System design, Software Design, Software Development and Implementation, Software Test. Candidate will work in a team environment utilizing software methodologies and processes. Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. Must be a US Citizen ; this position will require obtaining a government security clearance. This position is located at a facility that requires special access.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Pursuing a bachelor’s degree from an accredited college in only science and technology related programs such as Computer Science, Systems Engineering, Electrical Engineering, Computer Engineering, Physics, Mathematics etc.</li><li> Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access</li><li> Excellent written and verbal communication skills</li><li> Ability to work in a collaborative and team-based environment</li><li> Proficient with Microsoft Office<br/><br/></li></ul><strong>Desired Skills<br/><br/></strong><ul><li> Proficiency with one or more of the following software languages: Java, C++, C#.</li><li> Candidate will have knowledge of basic software practices such as coding standards, unit testing and configuration management, database and System administration.</li><li> Good communication skills.</li><li> Strong team player. Candidate will work in a team environment utilizing software methodologies and processes.</li><li> Familiarity with Agile Development Process a plus.</li><li> Strong communication skills a results oriented team player, creative thinker and problem-solver and follow all ethical standards of the Lockheed Martin Corporation.<br/><br/></li></ul><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>TS/SCI<br/><br/><strong>Other Important Information You Should Know<br/><br/></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Part-time Remote Telework: The employee selected for this position will work part of their work schedule remotely and part of their work schedule at a designated Lockheed Martin facility. The specific weekly schedule will be discussed during the hiring process.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>9x80 every other Friday off<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br/><br/>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>SPACE<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "King of Prussia, PA",
        "date": "11/13/2023 03:41PM",
        "url": "https://www.lockheedmartinjobs.com/job/-/-/694/56936451728"
    },
    {
        "job_title": "Software Engineer",
        "company_name": "Microsoft",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQE88xCsONDULQ/company-logo_100_100/0/1630652622688/microsoft_logo?e=2147483647&v=beta&t=4ft1hh_UdO2TMuqRWlFPHTTr2B3BN0E2LmTE6tEYwJI",
        "listing_details": "Seniority level: Not Applicable, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        Any Developer. Any App. Any Platform.<br/><br/>Microsoft continues to make big investments to empower every person and every organization on the planet to achieve more. In Developer Division, we build the tools, platforms, and services that built Microsoft – and the world. Today, developers everywhere trust and love products such as Visual Studio, VS Code, Azure, .NET, Python tools, C++, and TypeScript, just to name a few. We build these products and services in a work environment that is customer-focused, collaborative, and fun. Join us as we help make developers successful in building the applications of the future.<br/><br/>We create solutions together in a rich, collaborative environment and while we work hard together, work/life balance and having fun are also core values. Make your mark, make an impact, and make developers the most successful and productive developers in the world!<br/><br/>We are looking for a software engineer to help us deliver additional tools &amp; services to significantly improve developers’ productivity. You will work with program managers to understand customer needs, develop experiences that make them more productive as they work with their team members to develop their apps &amp; services.<br/><br/>You will work in a collaborative environment to build features in tools &amp; services, ship them to customers frequently and learn from customer feedback. You will build simple and powerful experiences in developer tools, highly scalable cloud services that the tools will connect to, and systems that monitor the health of the services. The software you build will help millions of developers all over the world.<br/><br/>You will become part of a team where learning from peers and growing as a team is a core principle.<br/><br/>Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.<br/><br/>In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.<br/><br/>Read about, Developer Division here, https://aka.ms/DevDivCareers<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Loves working with a smart, technical customer base</li><li>Likes the idea that the code you build &amp; design has one of the most direct correlations to developer satisfaction, and by delivering high quality, performant, and elegant experiences you can greatly enhance a developer's day-to-day enjoyment</li><li>Wants to be part of a motivated and collaborative engineering team</li><li>Design, implement, debug, and deliver rich developer experiences and services using C#, TypeScript (JavaScript), and/or C++<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><strong>Required/Minimum Qualifications<br/><br/></strong><ul><li> Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><li></li><ul><li>OR equivalent experience.<br/></li></ul></ul><strong>Additional Or Preferred Qualifications<br/><br/></strong><ul><li> Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><ul><li>OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li><li> OR equivalent experience.<br/></li></ul></ul>Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.<br/><br/>Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay<br/><br/>#DDJL<br/><br/>#AT<br/><br/>#SHPE<br/><br/>#SWE<br/><br/>Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Redmond, WA",
        "date": "11/21/2023 03:41PM",
        "url": "https://jobs.careers.microsoft.com/us/en/job/1657998/Software-Engineer?jobsource=linkedin"
    },
    {
        "job_title": "Software Engineer",
        "company_name": "The Home Depot",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHzR2llYqUBtg/company-logo_100_100/0/1630656428961/the_home_depot_logo?e=2147483647&v=beta&t=NH5wv1AXmlH4oUpVAOaSorm4nU1y-uttFDDEbY5Veps",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Retail",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Position Purpose<br/><br/></strong>The Software Engineer is responsible for assisting in developing and designing a product that Home Depot customers and associates will love. As a Software Engineer, you will be part of a dynamic team with engineers of all experience levels who help each other build and grow technical and leadership skills while creating, deploying, and supporting production applications. In addition, Software Engineers may be involved in product configuration, security, resilience, performance tuning and production monitoring.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>60% Delivers and Executes - Assists in developing, testing, deploying, and maintaining software; Follows best practices established by the organization and participates in improvement conversations; Consistently helps the team achieve results, even under tough circumstances</li><li>20% Learns and Grows - Learns through successful and failed experiment when tackling new problems; Actively seeks ways to grow and be challenged using both formal and informal development channels</li><li>20% Plans and Aligns - Builds partnerships and works collaboratively with others to meet shared objectives; Collaborates with other team members in agile processes; Relates openly and comfortably with diverse groups of people<br/><br/></li></ul><strong>Direct Manager/Direct Reports<br/><br/></strong><ul><li>This position typically reports to Software Engineer Manager or Sr. Manager </li><li>This position has 0 Direct Reports<br/><br/></li></ul><strong>Travel Requirements<br/><br/></strong><ul><li>No travel required.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.<br/><br/></li></ul><strong>Working Conditions<br/><br/></strong><ul><li>Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Must be eighteen years of age or older.</li><li>Must be legally permitted to work in the United States.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Exposure to front end technology such as HTML, CSS, and Javascript/Typescript frameworks</li><li>Exposure to an object-oriented programming language (preferably Java)</li><li>Exposure to source code version control</li><li>Exposure to Relational or noSQL database technology</li><li>Exposure to cloud computing techniques</li><li>Exposure to CI/CD tools</li><li>Exposure to microservice-based architecture<br/><br/></li></ul><strong>Minimum Education<br/><br/></strong><ul><li>The knowledge, skills and abilities typically acquired through the completion of a bachelor's degree program or equivalent degree in a field of study related to the job.<br/><br/></li></ul><strong>Preferred Education<br/><br/></strong><ul><li>No additional education<br/><br/></li></ul><strong>Minimum Years Of Work Experience<br/><br/></strong><ul><li>1<br/><br/></li></ul><strong>Preferred Years Of Work Experience<br/><br/></strong><ul><li>No additional years of experience<br/><br/></li></ul><strong>Minimum Leadership Experience<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Preferred Leadership Experience<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Certifications<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Global Perspective</li><li>Manages Ambiguity</li><li>Nimble Learning</li><li>Self-Development</li><li>Collaborates</li><li>Cultivates Innovation</li><li>Situational Adaptability</li><li>Communicates Effectively</li><li>Drives Results</li><li>Interpersonal Savvy</li></ul>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Columbus, OH",
        "date": "11/20/2023 03:41PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-at-the-home-depot-3764900040?refId=zakmTJad%2BfmniWfTm%2FzZxA%3D%3D&trackingId=g0VMPLTRSZ2NcQUSTblzGw%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card"
    }
]