[
    {
        "job_title": "SOFTWARE ENGINEER",
        "company_name": "The Home Depot",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHzR2llYqUBtg/company-logo_100_100/0/1630656428961/the_home_depot_logo?e=2147483647&v=beta&t=NH5wv1AXmlH4oUpVAOaSorm4nU1y-uttFDDEbY5Veps",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Retail",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Position Purpose<br/><br/></strong>The Software Engineer is responsible for assisting in developing and designing a product that Home Depot customers and associates will love. As a Software Engineer, you will be part of a dynamic team with engineers of all experience levels who help each other build and grow technical and leadership skills while creating, deploying, and supporting production applications. In addition, Software Engineers may be involved in product configuration, security, resilience, performance tuning and production monitoring.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>60% Delivers and Executes - Assists in developing, testing, deploying, and maintaining software; Follows best practices established by the organization and participates in improvement conversations; Consistently helps the team achieve results, even under tough circumstances</li><li>20% Learns and Grows - Learns through successful and failed experiment when tackling new problems; Actively seeks ways to grow and be challenged using both formal and informal development channels</li><li>20% Plans and Aligns - Builds partnerships and works collaboratively with others to meet shared objectives; Collaborates with other team members in agile processes; Relates openly and comfortably with diverse groups of people<br/><br/></li></ul><strong>Direct Manager/Direct Reports<br/><br/></strong><ul><li>This position typically reports to Software Engineer Manager or Sr. Manager </li><li>This position has 0 Direct Reports<br/><br/></li></ul><strong>Travel Requirements<br/><br/></strong><ul><li>No travel required.<br/><br/></li></ul><strong>Physical Requirements<br/><br/></strong><ul><li>Most of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.<br/><br/></li></ul><strong>Working Conditions<br/><br/></strong><ul><li>Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable. <br/><br/></li></ul><strong>Minimum Qualifications<br/><br/></strong><ul><li>Must be eighteen years of age or older.</li><li>Must be legally permitted to work in the United States.<br/><br/></li></ul><strong>Preferred Qualifications<br/><br/></strong><ul><li>Exposure to front end technology such as HTML, CSS, and Javascript/Typescript frameworks</li><li>Exposure to an object-oriented programming language (preferably Java)</li><li>Exposure to source code version control</li><li>Exposure to Relational or noSQL database technology</li><li>Exposure to cloud computing techniques</li><li>Exposure to CI/CD tools</li><li>Exposure to microservice-based architecture<br/><br/></li></ul><strong>Minimum Education<br/><br/></strong><ul><li>The knowledge, skills and abilities typically acquired through the completion of a bachelor's degree program or equivalent degree in a field of study related to the job.<br/><br/></li></ul><strong>Preferred Education<br/><br/></strong><ul><li>No additional education<br/><br/></li></ul><strong>Minimum Years Of Work Experience<br/><br/></strong><ul><li>1<br/><br/></li></ul><strong>Preferred Years Of Work Experience<br/><br/></strong><ul><li>No additional years of experience<br/><br/></li></ul><strong>Minimum Leadership Experience<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Preferred Leadership Experience<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Certifications<br/><br/></strong><ul><li>None<br/><br/></li></ul><strong>Competencies<br/><br/></strong><ul><li>Global Perspective</li><li>Manages Ambiguity</li><li>Nimble Learning</li><li>Self-Development</li><li>Collaborates</li><li>Cultivates Innovation</li><li>Situational Adaptability</li><li>Communicates Effectively</li><li>Drives Results</li><li>Interpersonal Savvy</li></ul>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Atlanta, GA",
        "date": "11/20/2023 02:55PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-at-the-home-depot-3770759878?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=m8YmwuR3dku446nNnidE6Q%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>What We’re Doing<br/><br/></strong>Our most advanced radar systems are designed by our Integrated Warfare System and Solutions (IWSS) team, and we are looking for highly talent individuals, like yourself, with a passion for RADAR and Electronic Warfare Technology. We provide surface, air and undersea solutions, including radar and surveillance systems, undersea combat systems, and surface combat systems and sensors.<br/><br/><strong>THE WORK<br/><br/></strong>We are looking for a talented and motivated early career Software Engineer to join our growing team. As a Software Engineer you will have the opportunity to work on exciting projects, collaborate with a diverse and talented group of individuals, and contribute to the development of innovative solutions.<br/><br/><strong>In This Role You Will<br/><br/></strong><ul><li> Support one of a number of state-of-the-art programs and systems (Radar, Sonar, Surveillance) as part of an integrated team.</li><li> Collaborate with other engineering disciplines and program personnel.</li><li> Participate in cross-functional Six Sigma-style product or process improvement meetings.</li><li> Stay up-to-date on emerging technologies and tools.</li><li> Be flexible, motivated, dedicated, detail-focused, team-oriented, and capable of multi-tasking.</li><li> Participate in all phases of the development lifecycle, including design, coding, and testing.</li><li> Use RMS engineering processes and procedures while performing your respective software engineering and verification activities.<br/><br/></li></ul><strong>Please Note<br/><br/></strong><ul><li> This position requires a government security clearance; you must be a US Citizen for consideration.<br/><br/></li></ul><strong>Who We Are<br/><br/></strong>At Lockheed you won’t be just another face in the crowd. We may think big, but we develop small. You’ll be part of a small team of five to seven other engineers working with other similar teams to build products larger than you thought possible while collaborating with the smartest people around.<br/><br/>Our customers are world-wide and so is our reputation for creating innovative solutions with the latest technologies. Our products keep our customers safe and bring them home to their families at night.<br/><br/>We provide the resources, inspiration, and focus - if you have the resourcefulness and courage to work hard, then we want to build a better tomorrow with you.<br/><br/>Learn More About Our Portfolio Of Radar Solutions Here<br/><br/>Visit Our Syracuse Site Virtually Here<br/><br/><strong>Who You Are<br/><br/></strong>Are you the kind of person who can’t resist taking something apart to see how it works? Do you look at everyday products and ask yourself why they aren’t better designed or built? Are you the one family and friends turn to when they need help with technology? Do you want to work with people whose eyes don’t glaze over when you talk about some interesting gadget you read about?<br/><br/>This position is typically for an engineer with <strong>2-5 years’ experience</strong> looking to expand their skill set while contributing to some of the most advanced systems being built today.<br/><br/><strong>WHY JOIN US<br/><br/></strong><strong>Your Health, Your Wealth, Your Life<br/><br/></strong>Our flexible schedules, competitive pay and comprehensive benefits enable you to live a healthy, fulfilling life at and outside of work.\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Liverpool, NY",
        "date": "11/20/2023 02:56PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-early-career-at-lockheed-martin-3770709028?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=Km8rK%2FyPHoVuoeBgkQ6CxA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work. With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility.<br/><br/>Your Mission is Ours.<br/><br/>Lockheed Martin Space is seeking a full-time Early Career Software Engineer. In this role, you will troubleshoot and<br/><br/>implement solutions to a variety of software<br/><br/>engineering problems in a timely manner, work<br/><br/>in a highly collaborative environment with<br/><br/>frequent and direct interaction with peers and<br/><br/>occasional customer interactions, and create test<br/><br/>scenarios for code changes to test new capability<br/><br/>or verify defect fix using Python. The successful<br/><br/>candidate will have experience and/or<br/><br/>knowledge of Java and excellent team orientation, oral and written communications skills.<br/><br/>Optional as Required: Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access.<br/><br/><strong>Basic Qualifications<br/><br/></strong>Graduate with a Computer Science or other<br/><br/>engineering related degree program from an<br/><br/>accredited college/university.<br/><br/>The selected candidate must have experience<br/><br/>developing software in Java, and have<br/><br/>experience with the Linux OS.<br/><br/>Must be a US Citizen; this position will require<br/><br/>obtaining a government security clearance. This<br/><br/>position is located at a facility that requires<br/><br/>special access.<br/><br/><strong>Desired Skills<br/><br/></strong><ul><li> Agile methodology</li><li> SW lifecycle (from development through<br/><br/></li></ul>integration/testing to deployment)<br/><br/><ul><li> Domain knowledge of mission planning and<br/><br/></li></ul>scheduling<br/><br/><ul><li> IntelliJ, JMS, Junit, Gradle, Jenkins, Python</li><li> Experience with J2EE and web services</li><li> C++ and algorithm experience<br/><br/></li></ul>Strong ability to work as a member of a small<br/><br/>highly skilled team in a dynamic environment is<br/><br/><strong>Required<br/><br/></strong><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>TS/SCI w/Poly<br/><br/><strong>Other Important Information You Should Know<br/><br/></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>9x80 every other Friday off<br/><br/><strong>Pay Rate<br/><br/></strong>The annual base salary range for this position in Colorado or Washington is $57,800 - $110,800. Please note that the salary information is a general guideline only. Lockheed Martin considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/ training, key skills as well as market and business considerations when extending an offer.<br/><br/><strong>Benefits offered:</strong> Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.<br/><br/>(Washington state applicants only) Non-represented full time employees: accrue 10 hours per month of Paid Time Off (PTO); receive 40 hours of Granted PTO annually for incidental absences; receive at least 90 hours for holidays. Represented full time employees accrue 6.67 hours of PTO per month; accrue up to 52 hours of sick leave annually; receive at least 96 hours for holidays. PTO is prorated based on hours worked and start date during the calendar year.<br/><br/>This position is incentive plan eligible.<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>At Lockheed Martin, we use our passion for purposeful innovation to help keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.<br/><br/>With our employees as our priority, we provide diverse career opportunities designed to propel, develop, and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. We place an emphasis on empowering our employees by fostering an inclusive environment built upon integrity and corporate responsibility.<br/><br/>If this sounds like a culture you connect with, you’re invited to apply for this role. Or, if you are unsure whether your experience aligns with the requirements of this position, we encourage you to search on Lockheed Martin Jobs, and apply for roles that align with your qualifications.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>SPACE<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Littleton, CO",
        "date": "11/14/2023 02:56PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-early-career-at-lockheed-martin-3756077021?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=44eKQ1OthUVvUNKXSNsrjw%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer – Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.<br/><br/>With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work.<br/><br/>At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility. Your Mission is Ours.<br/><br/>Lockheed Martin Rotary and Mission Systems in King of Prussia, PA is seeking a full-time Early Career Software Engineer. In this role, you will work within AGILE teams to develop, test and execute software features. The successful candidate will have experience and/or knowledge of C++/C, Linux Operating Systems and Agile Methodology.<br/><br/>Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access.<br/><br/><strong><strong>Basic Qualifications:<br/><br/></strong></strong><ul><li> BS degree in Computer Science, Computer Engineering, Electrical Engineering, Software Engineering, or equivalent STEM field from an accredited college.</li><li> Academic or professional experience using Java, C++, C#, Python, or similar programming languages</li><li> Strong verbal and written communication skills</li><li> Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access<br/><br/></li></ul><strong><strong>Desired Skills:<br/><br/></strong></strong><ul><li> Understand Software Development Methodologies</li><li> Understand Full Software Life-Cycle Development</li><li> Proficient in software development tools</li><li> Academic or professional experience in Database design and development</li><li> Academic or professional experience in computer operating system (Windows, Unix/Linux, Shell Scripting)</li><li> Ability to work with cross-functional teams (Hardware, Systems Engineering, Integration &amp; Test, and other disciplines)</li><li> Willing to support business travel as required<br/><br/></li></ul><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>Secret<br/><br/><strong><strong>Other Important Information You Should Know<br/><br/></strong></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Part-time Remote Telework: The employee selected for this position will work part of their work schedule remotely and part of their work schedule at a designated Lockheed Martin facility. The specific weekly schedule will be discussed during the hiring process.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>4x10 hour day, 3 days off per week<br/><br/><strong><strong>Pay Rate:<br/><br/></strong></strong>The annual base salary range for this position in California and New York (excluding most major metropolitan areas), Colorado, or Washington is $57,800 - $110,800. Please note that the salary information is a general guideline only. Lockheed Martin considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/ training, key skills as well as market and business considerations when extending an offer.<br/><br/><strong>Benefits offered:</strong> Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.<br/><br/>(Washington state applicants only) Non-represented full time employees: accrue 10 hours per month of Paid Time Off (PTO); receive 40 hours of Granted PTO annually for incidental absences; receive at least 90 hours for holidays. Represented full time employees accrue 6.67 hours of PTO per month; accrue up to 52 hours of sick leave annually; receive at least 96 hours for holidays. PTO is prorated based on hours worked and start date during the calendar year.<br/><br/>This position is incentive plan eligible.<br/><br/><strong><strong>Pay Rate:<br/><br/></strong></strong>The annual base salary range for this position in most major metropolitan areas in California and New York is $66,500 - $125,300. Please note that the salary information is a general guideline only. Lockheed Martin considers factors such as (but not limited to) scope and responsibilities of the position, candidate’s work experience, education/ training, key skills as well as market and business considerations when extending an offer.<br/><br/><strong>Benefits offered:</strong> Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.<br/><br/>This position is incentive plan eligible.<br/><br/><strong><strong>Pay Rate:<br/><br/></strong></strong>The annual base salary range for this position in California and New York (excluding most major metropolitan areas), Colorado, or Washington is $57,800 - $110,800. Please note that the salary information is a general guideline only. Lockheed Martin considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/ training, key skills as well as market and business considerations when extending an offer.<br/><br/><strong>Benefits offered:</strong> Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.<br/><br/>(Washington state applicants only) Non-represented full time employees: accrue 10 hours per month of Paid Time Off (PTO); receive 40 hours of Granted PTO annually for incidental absences; receive at least 90 hours for holidays. Represented full time employees accrue 6.67 hours of PTO per month; accrue up to 52 hours of sick leave annually; receive at least 96 hours for holidays. PTO is prorated based on hours worked and start date during the calendar year.<br/><br/>This position is incentive plan eligible.<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br/><br/>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>RMS<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Colorado Springs, CO",
        "date": "10/24/2023 02:57PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-%E2%80%93-early-career-at-lockheed-martin-3746286426?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=cBco7flmpuSm8RkKtZjtQA%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Junior Software Engineer",
        "company_name": "Twine",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQFTX32G2axybQ/company-logo_100_100/0/1693468686107/twineis_logo?e=2147483647&v=beta&t=ZRCiP_B7cIqDM3D27IMPwKUur8oi409f60hUuqf-sho",
        "listing_details": "Seniority level: Associate, Employment type: Contract, Job function: Engineering, Industries: Technology, Information and Internet",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>About Twine<br/><br/></strong>We're a thriving ecosystem of top-tier freelancers from around the world. Trusted by Fortune 500 companies and Silicon Valley startups, Twine is the go-to platform for mission-critical projects. Twine's experts get to participate in generating quality datasets at an unprecedented scale. With over half a million registered freelancers and a growing roster of 35,000+ companies, we've become the comprehensive solution for all things freelancing.<br/><br/><strong>Our Mission<br/><br/></strong>At Twine, we recognize that companies require a flexible approach to hiring expert freelancers for their most critical projects. Traditional freelance platforms often fall short when it comes to scalability and diversity. That's where we shine. Twine operates as a thriving global freelance network, with diverse experts across various fields, including marketing, engineering, and AI. Our core mission is to empower creators, whether they're businesses or individual freelancers, to thrive in their creative endeavours.<br/><br/><strong>About The Role<br/><br/></strong><strong>We are seeking a Junior Software Engineer for a workforce management technology company. </strong>Tackle system challenges, engage in all aspects of software engineering, and continuously improve. Collaborate closely with colleagues, product managers, and architects to forge innovative solutions.<br/><br/>Note: This is a hybrid position, which entails a minimum requirement of being present in the office at least three times per week. The office is located in Lake Forest, CA.<br/><br/><strong>Description<br/><br/></strong><ul><li>Drive progress within our elite software engineering team by embracing Lean/Agile methodologies</li><li>Tackle system challenges by identifying underlying issues and developing actionable plans</li><li>Engage wholeheartedly in all aspects of software engineering, including design, development, and process enhancement</li><li>Maintain a mindset geared towards continuous improvement in all areas</li><li>Forge innovative solutions to complex challenges, collaborating closely with colleagues, product managers, and architects</li><li>Commit to personal growth using a wealth of resources, training, and collaborative learning opportunities<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>A Bachelor’s Degree in Computer Science or Software Engineering with 5+ years of hands-on software development experience</li><li>Solid expertise in crafting Microservices with C# / .NET Core</li><li>Strong skills in web development utilizing JavaScript, HTML5, Angular</li><li>A robust understanding of Object-Oriented design and programming</li><li>Real-world application of Lean and/or Agile development principles</li><li>Cloud computing experience, notably with Azure DevOps, Azure functions/microservices, containerization, and Kubernetes</li><li>A knack for innovation, willing to embrace new ideas and apply them to improve existing systems</li><li>Clear, concise communication abilities</li><li>A result-driven approach, constantly seeking to enhance efficiency and productivity</li><li>A self-starter mentality with a hunger for new knowledge and skills</li><li>A responsible attitude with excellent command of English (and prefer Mandarin to meet our client’s diverse needs)</li></ul>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Los Angeles, CA",
        "date": "11/21/2023 02:57PM",
        "url": "https://www.linkedin.com/jobs/view/junior-software-engineer-at-twine-3771075836?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=JATalf7FwyImcG5tfqB3YA%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Junior Full Stack Web Developer",
        "company_name": "Fitness Matrix Inc",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQGmk8ZefBUxLg/company-logo_100_100/0/1698352894604/fitness_matrix_inc_logo?e=2147483647&v=beta&t=72cgj7Ot5k670-7oCMGX7QoHQoicVzzbGuWzPstPuXw",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        This is a remote position.<br/><br/>Junior Full Stack Web Developer <strong>- Work from Home<br/><br/></strong><strong>Full-time<br/><br/></strong><strong>$63K - $74K per annum<br/><br/></strong><strong>1+ Year Experience Required<br/><br/></strong><strong>Visit fitnessmatrixinc.com </strong> to learn more &amp; apply with your resume and cover letter.<br/><br/><strong>Introduction:<br/><br/></strong>FitnessMatrixInc is an unique approach to health and wellness that is based on the principle of bio-individuality. This means that we believe that everyone is different and has their own unique needs and challenges. We will work with you to understand your biochemistry and develop a personalized plan that is right for you.<br/><br/>Job Description:<br/><br/>This position is ideal for individuals who are passionate about both front-end and back-end development and want to gain valuable experience in a supportive and collaborative environment.<br/><br/>Responsibilities:<br/><br/><ul><li>Collaborate with the development team to design, develop, and maintain web applications </li><li>Implement responsive and user-friendly front-end designs using HTML, CSS, and JavaScript </li><li>Develop server-side code and APIs using programming languages such as Python, Ruby, or Node.js </li><li>Design and maintain databases and perform database queries for data retrieval and manipulation </li><li>Write clean, modular, and efficient code for both front-end and back-end components </li><li>Participate in code reviews and provide constructive feedback </li><li>Troubleshoot and debug issues to ensure optimal performance and user experience </li><li>Contribute to improving the overall web development process <br/><br/></li></ul>Requirements:<br/><br/><ul><li>Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience) </li><li>Strong knowledge of HTML5, CSS3, and JavaScript </li><li>Experience with front-end frameworks (such as React, Angular, or Vue.js) </li><li>Proficiency in at least one server-side programming language (Python, Ruby, Node.js, etc.) </li><li>Familiarity with databases and SQL </li><li>Understanding of RESTful APIs and web services </li><li>Experience with version control systems (e.g., Git) </li><li>Good problem-solving and analytical skills </li><li>Excellent communication and teamwork abilities <br/><br/></li></ul>Preferred Qualifications:<br/><br/><ul><li>Familiarity with back-end frameworks (such as Django, Ruby on Rails, Express, etc.) </li><li>Knowledge of NoSQL databases (MongoDB, Firebase, etc.) </li><li>Understanding of web security best practices </li><li>Familiarity with cloud platforms (AWS, Azure, Google Cloud) </li><li>Experience with testing frameworks (Jest, Mocha, Jasmine, etc.) </li><li>Projects or personal portfolio showcasing your full-stack development skills <br/><br/></li></ul><strong>Why should we work with FitnessMatrixInc?<br/><br/></strong>FitnessMatrixInc is the leading provider of holistic and multidimensional health and wellness services. We offer a comprehensive approach to health and wellness. We take into account all aspects of your life, from your physical fitness and nutrition to your mental, emotional, and spiritual well-being. We use the latest science and technology to develop our programs and services. We are constantly innovating and finding new ways to help our clients achieve their goals. We offer a variety of programs and services to meet your needs and budget.<br/><br/>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Los Angeles, CA",
        "date": "11/21/2023 02:57PM",
        "url": "https://www.linkedin.com/jobs/view/%E2%80%8Bjunior-full-stack-web-developer-at-fitness-matrix-inc-3771145782?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=ZyL1Kt7co9l3olXIyXq%2FWQ%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work. With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility. Your Mission is Ours.<br/><br/>Lockheed Martin Space is seeking a full-time Early Career Software Engineer. In this role, you will troubleshoot and<br/><br/>implement solutions to a variety of software engineering problems in a timely manner, work in a highly collaborative environment with frequent and direct interaction with peers and occasional customer interactions, and create test scenarios for code changes to test new capability or verify defect fix using Python. The successful candidate will have experience and/or knowledge of Java and excellent team orientation, oral and written communications skills.<br/><br/>Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access.<br/><br/><strong>Basic Qualifications<br/><br/></strong>Graduate with a Computer Science or other<br/><br/>engineering related degree program from an<br/><br/>accredited college/university<br/><br/>The selected candidate must have experience<br/><br/>developing software in Java, and have<br/><br/>experience with the Linux OS.<br/><br/>Must be a US Citizen; this position will require<br/><br/>obtaining a government security clearance. This<br/><br/>position is located at a facility that requires<br/><br/>special access.<br/><br/><strong>Desired Skills<br/><br/></strong><ul><li> Agile methodology</li><li> SW lifecycle (from development through<br/><br/></li></ul>integration/testing to deployment)<br/><br/><ul><li> Domain knowledge of mission planning and<br/><br/></li></ul>scheduling<br/><br/><ul><li> IntelliJ, JMS, Junit, Gradle, Jenkins, Python</li><li> Experience with J2EE and web services</li><li> C++ and algorithm experience<br/><br/></li></ul>Strong ability to work as a member of a small<br/><br/>highly skilled team in a dynamic environment is<br/><br/><strong>Required<br/><br/></strong><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>TS/SCI w/Poly<br/><br/><strong>Other Important Information You Should Know<br/><br/></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>9x80 every other Friday off<br/><br/><strong>Pay Rate<br/><br/></strong>The annual base salary range for this position in Colorado or Washington is $57,800 - $110,800. Please note that the salary information is a general guideline only. Lockheed Martin considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/ training, key skills as well as market and business considerations when extending an offer.<br/><br/><strong>Benefits offered:</strong> Medical, Dental, Vision, Life Insurance, Short-Term Disability, Long-Term Disability, 401(k) match, Flexible Spending Accounts, EAP, Education Assistance, Parental Leave, Paid time off, and Holidays.<br/><br/>(Washington state applicants only) Non-represented full time employees: accrue 10 hours per month of Paid Time Off (PTO); receive 40 hours of Granted PTO annually for incidental absences; receive at least 90 hours for holidays. Represented full time employees accrue 6.67 hours of PTO per month; accrue up to 52 hours of sick leave annually; receive at least 96 hours for holidays. PTO is prorated based on hours worked and start date during the calendar year.<br/><br/>This position is incentive plan eligible.<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>At Lockheed Martin, we use our passion for purposeful innovation to help keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.<br/><br/>With our employees as our priority, we provide diverse career opportunities designed to propel, develop, and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. We place an emphasis on empowering our employees by fostering an inclusive environment built upon integrity and corporate responsibility.<br/><br/>If this sounds like a culture you connect with, you’re invited to apply for this role. Or, if you are unsure whether your experience aligns with the requirements of this position, we encourage you to search on Lockheed Martin Jobs, and apply for roles that align with your qualifications.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>SPACE<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Littleton, CO",
        "date": "11/14/2023 02:58PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-early-career-at-lockheed-martin-3756073766?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=CWzovMLEfcgpa8cqFLr%2BHQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Part-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work.<br/><br/>With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work.<br/><br/>At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility.<br/><br/>Your Mission is Ours.<br/><br/>Lockheed Martin Space in King of Prussia, PA is seeking a full-time Early Career Software Engineer. In this role, you will join the Warriors Path team in building software solutions to model coordinated space activities for a wide range of scenarios.<br/><br/><ul><li> Incredible technology innovation centered on Space wargaming, strategy, tactics, techniques, gaming and optimization strategies.</li><li> Looking for full-stack software engineer help energized team design, implement and deploy capabilities for our Stakeholders. Performance of all phases of software development including design, implementation, testing and verification<br/><br/></li></ul>The successful candidate will have experience/training (BS) in a science or technology related discipline and experience in at least one of these skill or computer language areas: C, C++, C#, Java, XML, Windows, .NET, and LINUX/UNIX, system software and scripting development, Java programming, web development, System analysis, System design, Software Design, Software Development and Implementation, Software Test. Candidate will work in a team environment utilizing software methodologies and processes. Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information. Must be a US Citizen ; this position will require obtaining a government security clearance. This position is located at a facility that requires special access.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Pursuing a bachelor’s degree from an accredited college in only science and technology related programs such as Computer Science, Systems Engineering, Electrical Engineering, Computer Engineering, Physics, Mathematics etc.</li><li> Must be a US Citizen; this position will require a government security clearance. This position is located at a facility that requires special access</li><li> Excellent written and verbal communication skills</li><li> Ability to work in a collaborative and team-based environment</li><li> Proficient with Microsoft Office<br/><br/></li></ul><strong>Desired Skills<br/><br/></strong><ul><li> Proficiency with one or more of the following software languages: Java, C++, C#.</li><li> Candidate will have knowledge of basic software practices such as coding standards, unit testing and configuration management, database and System administration.</li><li> Good communication skills.</li><li> Strong team player. Candidate will work in a team environment utilizing software methodologies and processes.</li><li> Familiarity with Agile Development Process a plus.</li><li> Strong communication skills a results oriented team player, creative thinker and problem-solver and follow all ethical standards of the Lockheed Martin Corporation.<br/><br/></li></ul><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>TS/SCI<br/><br/><strong>Other Important Information You Should Know<br/><br/></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Part-time Remote Telework: The employee selected for this position will work part of their work schedule remotely and part of their work schedule at a designated Lockheed Martin facility. The specific weekly schedule will be discussed during the hiring process.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>9x80 every other Friday off<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br/><br/>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>SPACE<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "King of Prussia, PA",
        "date": "11/14/2023 02:58PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-early-career-at-lockheed-martin-3756075195?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=U2R6NrfFbru%2FkzRGiGOoAA%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Early Career",
        "company_name": "Lockheed Martin",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQHF1YKEZdN4LA/company-logo_100_100/0/1668532986109/lockheed_martin_logo?e=2147483647&v=beta&t=MAt3FDVkp1mxAnqi-7a-mmVAi8Lcd_S1_XvT0Y_Z40s",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Defense and Space Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Description:</strong>By bringing together people that use their passion for purposeful innovation, at Lockheed Martin we keep people safe and solve the world's most complex challenges. Our people are some of the greatest minds in the industry and truly make Lockheed Martin a great place to work. With our employees as our priority, we provide diverse career opportunities designed to propel development and boost agility. Our flexible schedules, competitive pay, and comprehensive benefits enable our employees to live a healthy, fulfilling life at and outside of work. At Lockheed Martin, we place an emphasis on empowering our employees by fostering innovation, integrity, and exemplifying the epitome of corporate responsibility. Your Mission is Ours.<br/><br/><strong>Role<br/><br/></strong>Lockheed Martin Space is seeking a full-time Early Career Software Engineer. In this role, you will be assigned to a scrum team within the development organization supporting numerous activities to include:<br/><br/><ul><li> Planning, conducting, and coordinating agile software development activities.</li><li> Designing, developing, documenting, testing, and debugging software that contains logical and mathematical solutions to critical mission issues.</li><li> Applying the appropriate standards, processes, procedures, and tools throughout the development life cycle.</li><li> Applying knowledge of computer hardware and software, subject matter to be programmed in mission applications, information processing techniques used, and information gathered from system users to develop software.</li><li> Correcting program errors, compiling documentation of program development, and analyzing system capabilities to resolve questions of program intent, output requirements, input data acquisition, programming techniques, and controls.<br/><br/></li></ul>The successful candidate will have experience with Java development, integration of COTS/FOSS and the ability to navigate multiple operating systems to include LINUX/Windows.<br/><br/>The applicant must be a US Citizen; this position will require that the candidate obtain a government security clearance.<br/><br/><strong>Basic Qualifications<br/><br/></strong><ul><li> Bachelor’s degree in computer science or similar field.</li><li> Java development experience.</li><li> Experience in COTS/FOSS integration and support.</li><li> Ability to troubleshoot and navigate multiple operating system environments (e.g., LINUX/Windows).</li><li> Ability to learn and implement new technologies.</li><li> Applicants selected must be a US Citizen, will be subject to a government security investigation and must meet eligibility requirements for access to classified information.</li><li> Ability to obtain a TS/SCI Clearance required for this role.<br/><br/></li></ul><strong>Desired Skills<br/><br/></strong><ul><li> Agile development experience and associated tools and processes.</li><li> Understanding of Cloud infrastructure.</li><li> Strong problem-solving skills. Strong communication skills. Proven team player.</li><li> Interest and experience in development tools and technologies (e.g., Angular, Oracle, Microservices, Docker, Kubernetes).</li><li> Big data technologies to include data Ingest, Analytics, Elasticsearch, and COTS Integration.<br/><br/></li></ul><strong>Security Clearance Statement: </strong>This position requires a government security clearance, you must be a US Citizen for consideration.<br/><br/><strong>Clearance Level: </strong>TS/SCI<br/><br/><strong>Other Important Information You Should Know<br/><br/></strong><strong>Expression of Interest: </strong>By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.<br/><br/><strong>Ability to Work Remotely: </strong>Onsite Full-time: The work associated with this position will be performed onsite at a designated Lockheed Martin facility.<br/><br/><strong>Work Schedules: </strong>Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.<br/><br/><strong>Schedule for this Position: </strong>Standard Monday to Friday 40 hour work week<br/><br/><strong>Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.<br/><br/></strong>Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.<br/><br/>As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.<br/><br/><strong>Experience Level: </strong>4 yr and up College<br/><br/><strong>Business Unit: </strong>SPACE<br/><br/><strong>Relocation Available: </strong>Possible<br/><br/><strong>Career Area: </strong>Software Engineering<br/><br/><strong>Type: </strong>Full-Time<br/><br/><strong>Shift: </strong>First\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Herndon, VA",
        "date": "10/31/2023 02:58PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-early-career-at-lockheed-martin-3747572617?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=qab5ND6IeSn%2B%2Bvq3hWyeUg%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Software Engineer - Frontend / Fullstack",
        "company_name": "Vellum",
        "company_logo": "https://media.licdn.com/dms/image/D4D0BAQHWGDLoouF-TA/company-logo_100_100/0/1689082718416/vellumai_logo?e=2147483647&v=beta&t=CBR4xM9essEELy3gIGbt8xULNGkT0XbMN31iOyYDw9A",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        What it means to be an early engineer<br/><br/>Joining Vellum this early means that you’re going to play a huge part in guiding both the technical and cultural evolution of the company. Together, we’re going to face the hardest technical challenges this journey has to offer head on. As the team grows, you’ll be the battle hardened expert that everyone looks towards for guidance.<br/><br/>With great power comes great responsibility 🙂<br/><br/>What you’re signing up for<br/><br/><ul><li>Tackling our most difficult (and interesting) problems - chaining, onboarding flows and prompt iteration, just to name a few</li><li>Shaping the way users experience Vellum</li><li>Optimizing the performance of our frontend</li><li>A/B testing changes to maximize the number of users that achieve successful outcomes</li><li>Defining and scoping green field projects that move the company forward</li><li>Working closely with customers to understand what the need, figuring out how to make them successful, and owning the solutions end to end</li><li>Serving as a cultural pillar of the team<br/><br/></li></ul>Our stack<br/><br/><strong>In Case You’re Curious<br/><br/></strong><ul><li>React - as our frontend framework</li><li>Typescript - what we write our frontend in</li><li>Django - for our webservers</li><li>Flask - for our microservices</li><li>Python - what we write our backend in</li><li>Postgres - as our primary database</li><li>Google Cloud Platform - as our cloud provider<br/><br/></li></ul>Working at Vellum<br/><br/>--<br/><br/><ul><li>We’re laser focused on helping companies bring AI into production and providing real value. Decision making is simple: if what we do allows our users to increase how many use cases of AI they’re able to successfully put into production, then we do it!</li><li>Don’t cut corners, cut the right corners. What can you do with 10% of your time to get 90% of the desired impact? Now that you only spent 10% of the time doing something, imagine how much more can be done with the rest of your time!!</li><li>Everyone is a 1000x engineer/designer/pm when they’re passionate about the problems they’re solving and love the people they’re working with</li><li>Because we trust each other, we can move fast and have fun doing it 😄</li></ul>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "New York, NY",
        "date": "10/21/2023 02:59PM",
        "url": "https://www.linkedin.com/jobs/view/software-engineer-frontend-fullstack-at-vellum-3742828071?refId=3usz5MpkixUnHWUwbbXmNA%3D%3D&trackingId=nQ%2Folav5DNF1mm8Z7vSiDw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card"
    }
]