[
    {
        "job_title": "DevOps Engineer (in QE department)",
        "company_name": "Zortech Solutions",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQFLYN9bJoNeQg/company-logo_100_100/0/1570462760656?e=2147483647&v=beta&t=kcFWriA8Saq_l2G59fyDnLgf9CTYsn8LeY0is-2Tni4",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Human Resources Services",
        "description": "JOB TITLE  DevOps Engineer (in QE department) LOCATION Austin, TX/RemoteDURATION  6+ MonthsJob Description5+ years of strong DevOps experience Experience with GIT actions, Yaml, SonarQube and scripting Good Understanding of various technologies (Angular, Csharp, Terraform) Knowledge of at least one scripting language (powershell, Bash) Experience with developing automated test scripts using Python or Java Self-Starter who can design testing approach and test automation for CICD templates Experience in continuous testing practices in a CI/CD development pipeline, and deploying test automation Experience working with build & deployment tools eg: Octopus, GitLab etc. Good exposure to agile testing process, test strategy planning and implementation, test execution and reporting Ability to work independently with little to no daily supervision Excellent verbal and written communication skills",
        "location": "United States",
        "date": "06/09/2023 03:26PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-in-qe-department-at-zortech-solutions-3620453158?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=vo4tsJAzc9OqJYy1RxKQDw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "DevOps Engineer (Entry Level)",
        "company_name": "HireMeFast - Land A Job - Hire Top Talents Remotely - Staffing & Recruitment",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQHlXWAbZ9qThg/company-logo_100_100/0/1691335433746?e=2147483647&v=beta&t=CQW_t539u4j8MXtZv8OWAvf7sqlkYJjPGvHFCs5bSiY",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Staffing and Recruiting",
        "description": "DevOps Engineer (Entry Level), US/Canada Residents only, Full-Time, Salary $66K-$70KMinimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: Looking for a job change? We can help! Visit hiremefast.net to get started with your job search and land incredible offers on automation!HireMeFast LLC is a staffing & recruitment agency connecting employers with world-class talent in the tech industry. Our industry delivers services tailored to the unique qualities and specifications of our selected client base.About The Role & TeamThe ideal candidate should have strong technical skills, hands-on experience with DevOps tools and technologies, and a passion for automation and continuous improvement. Development teams at Patterned Learning consist of intelligent, driven, and dedicated individuals across disciplines who are passionate about what they do and committed to each other's success.What skills and experience do I need to succeed?You will need to have proven experience delivering commercial software applications.You will need hands-on experience with DevOps tools and technologies such as Jenkins, Octopus, Docker, Kubernetes, and Git. Experience with cloud-based infrastructure and services, preferably Azure is essential.About the job requirements:DevOps EngineeringWeb development (HTML, CSS, Angular)Software EngineeringContent Management SystemsDatabases and Structured DataFlexible and adaptable with the ability to align to changing prioritiesWhy HireMeFast LLC?HireMeFasts most recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible.We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected. HireMeFast is proud to be an equal-opportunity workplace, and we welcome applicants from all backgrounds regardless of race, color, ancestry, religion, gender identity or expression, sexual orientation, marital status, age, citizenship, socioeconomic status, disability, or veteran status.",
        "location": "Buffalo, NY",
        "date": "10/09/2023 03:26PM",
        "url": "https://www.careers-page.com/hiremefast-llc/job/L583Y855?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "DevOps Engineer (Entry Level)",
        "company_name": "SkyRecruitment",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQF7WjabFalnzQ/company-logo_100_100/0/1695570700378?e=2147483647&v=beta&t=nZem-MYgbcxb4ub40pbzUPWpCmzZGiefRJ-rq0g6feU",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "DevOps Engineer (Entry Level), US/Canada Residents only, Full-Time, Salary $60K-$70KMinimum 1 year of project experience required - fully remote position. Freshers are also encouraged to apply!About us: SkyRecruitment company is a specialized organization that connects employers with qualified individuals. It strives to focus on providing quality recruitment services. SkyRecruitment aims to match employers with qualified candidates. They have a customer-centric approach and strive to ensure a successful match for both parties. The company values transparency and honesty in its recruitment process.Job ResponsibilitiesMore About the Role & TeamThe ideal candidate should have strong technical skills, hands-on experience with DevOps tools and technologies, and a passion for automation and continuous improvement. Development teams at Patterned Learning consist of intelligent, driven, and dedicated individuals across disciplines who are passionate about what they do and committed to each others success.What skills and experience do I need to succeed?You will need to have proven experience delivering commercial software applications.You will need hands-on experience with DevOps tools and technologies such as Jenkins, Octopus, Docker, Kubernetes, and Git. Experience with cloud-based infrastructure and services, preferably Azure is essential.About the job requirements:DevOps EngineeringWeb development (HTML, CSS, Angular)Software EngineeringContent Management SystemsDatabases and Structured DataFlexible and adaptable with the ability to align to changing prioritiesIf you may have worked as a Software Engineer, DevOps Engineer, or 'Software Developer, you can apply for the post!!Special Benefits you will love:Flexible vacation paid unlimited holidays and paid sick daysHealth, vision, and dental insuranceWhy SkyRecruitment?SkyRecruitment's most recruitment clients have incredibly bright, mission-driven coworkers passionate about using modern web technologies to solve real-world problems---and we're multiplying. To continue building an engaging and dynamic organization, we're committed to giving everyone the support & connections with the best clients worldwide possible. We believe diverse perspectives and backgrounds are critical to building great technology, and our goal is to cultivate an environment where people feel equally valued and respected.",
        "location": "Cherry Hill, NJ",
        "date": "10/08/2023 03:27PM",
        "url": "https://www.careers-page.com/sky-recruitment-2/job/QW8Y3Y66?utm_medium=free_job_board&utm_source=linkedin"
    },
    {
        "job_title": "DevOps Engineer",
        "company_name": "IT Minds LLC",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQEZkh7wG0X0ew/company-logo_100_100/0/1618287716162?e=2147483647&v=beta&t=IvfZp1dm4au_9by-tkAyPoVik0mM9SlOwwmxj9c6AD8",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Role- Senior DevOps EngineerLocation: Reston, VA (Remote)In-Person Interview on 9th Sept.Address- North America Metro 101, Suite 600, 101 Wood Avenue South, Iselin, New Jersey - 08830, USAKey Skills- DevOps, AWS, Jenkins, GitLab, Terraform, Kubernates.",
        "location": "United States",
        "date": "09/09/2023 03:27PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-at-it-minds-llc-3711723224?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=vkuCwlToK9SaH8xgUbltZg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "DevOps Engineer",
        "company_name": "C2S Technologies, Inc.",
        "company_logo": "https://media.licdn.com/dms/image/C4D0BAQEfXsXRNU8ucg/company-logo_100_100/0/1519958367439?e=2147483647&v=beta&t=Yn7Y-nWFxFQJSGjmjOsGkI9C-DP_IgmbG8cVlX8esXc",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "Job title: DevOps EngineerJob DutiesCollaboration and Communication: Foster effective communication and collaboration between development, operations, and other cross-functional teams.Facilitate regular meetings, discussions, and knowledge sharing sessions.Infrastructure Automation: Automate the provisioning, configuration, and management of infrastructure resources using tools like Ansible, Terraform, or Chef.Implement infrastructure as code (IaC) practices to ensure consistency and repeatability.Continuous Integration and Deployment: Implement and maintain CI/CD pipelines to enable automated build, test, and deployment of applications.Integrate version control systems, build tools, and testing frameworks to enable smooth code integration and delivery.Monitor and Performance: Implement and manage monitoring tools and systems to ensure high availability and performance of applications and infrastructure.Collect and analyze metrics to identify performance bottlenecks, troubleshoot issues, and optimize resource utilization.Release Management: Coordinate release activities and ensure smooth deployments, rollback procedures, and versioning control.Work closely with development teams to establish release schedules and manage dependencies.Security and Compliance: Implement and enforce security measures, best practices, and compliance requirements across infrastructure and application deployments.Collaborate with security teams to conduct vulnerability assessments and implement necessary remediation measures.Incident Management and Troubleshooting: Respond to and resolve production issues, incidents, and outages in a timely manner.Perform root cause analysis and implement preventive measures to avoid future occurrences.Continuous Improvement: Continuously identify areas for process improvement, automation, and optimization.Stay up to date with emerging DevOps practices, tools, and technologies to enhance the efficiency and effectiveness of the team.Degree Requirement: This position requires, at a minimum, a bachelor's degree in computer science, computer information systems, information technology or advanced educational background equating to the U.S. equivalent of a Bachelor's degree in one of the aforementioned subjects.Work Schedule: Full Time, 40 Hours/Week",
        "location": "Washington, United States",
        "date": "07/09/2023 03:27PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-at-c2s-technologies-inc-3644646873?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=DF4MjdsFaamiWR%2Fcl5zMXA%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "DevOps Engineer",
        "company_name": "Stellar Professionals",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQGveZ81BUBqcg/company-logo_100_100/0/1607348675025?e=2147483647&v=beta&t=gUe03J4QJPPGcwV-QRWeKfYaYNrTikSm0kpZEjK7nEk",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Contract, Job function: Engineering and Information Technology, Industries: Information Services, Government Relations Services, and Government Administration",
        "description": "Skills Required 6+ years in a technical position. 4+ years as a DevOps Engineer 4+ years of experience with GIT 3+ years of architecture design, implementation, and support of highly distributed setups (ensure high availability and reliability). 2+ years of experience with Azure DevOps Experience with scripting languages (bash, batch, PowerShell, Python, YAML, etc.) Experience with object oriented programming languages (Java, APEX, etc.) Excellent problem-solving, troubleshooting, and debugging skills. Self-starter, motivator, and ability to work within a team and solo.",
        "location": "Lansing, MI",
        "date": "10/02/2023 03:27PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-at-stellar-professionals-3727334838?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=r2s4pdIF0Q3GFxNO57oeNw%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "DevOps Engineer",
        "company_name": "Ryan Consulting Group, LLC",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQFSZVLfIHeaiw/company-logo_100_100/0/1696870534020?e=2147483647&v=beta&t=0LXE_MZUqulquotQgwTL31Q_zbTtDXFF8_vwPeZU4Pw",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Staffing and Recruiting",
        "description": "Job DescriptionSummary of Position: The DevOps Engineer will possess expertise skill in Azure and a strong focus on building and deploying Android, iOS, and web applications. The ideal candidate should have a deep understanding of the software development lifecycle, continuous integration, and continuous delivery processes, with a specific emphasis on mobile application development. The candidate will play a crucial role in optimizing development workflows, automating processes, and ensuring efficient and reliable deployment pipelines.Responsibilities: The DevOps Engineer position will require experience performing the following: Azure Expertise: Leverage Azure DevOps services to design, implement, and maintain robust CI/CD pipelines for mobile applications. Utilize Azure services such as Azure Pipelines, Azure Repos, and Azure Artifacts to automate build, test, and deployment processes.  Mobile Application Deployment: Work closely with mobile development teams to understand application requirements and implement deployment solutions for Android and iOS platforms. Ensure seamless integration of mobile application builds into the CI/CD pipelines.  Build Automation: Expertise in building Android and iOS applications. Expertise in using Visual Studio Build (VSBuild) for building APIs, services, and websites. Implement and optimize build scripts and configurations to achieve efficient and reproducible builds. Utilize YAML for defining and managing CI/CD pipelines.  Scripting Languages: Proficiency in PowerShell and Bash for automation and deployment tasks.  Infrastructure as Code (IaC): Implement and manage infrastructure as code using tools like Terraform or ARM templates for Azure resources. Automate the provisioning and scaling of infrastructure required for mobile application development.  Deployment to Mobile Platforms: Utilize Microsoft App Center for comprehensive lifecycle management of mobile applications. Manage deployment processes to the Google Play Store and Apple Store, including the Apple B2B Store for business applications.  Monitoring and Logging: Implement monitoring solutions to track the performance of CI/CD pipelines and application deployments. Set up logging and alerting mechanisms for timely issue identification and resolution. DevOps Engineer Collaboration and Documentation: Collaborate with development, testing, and operations teams to streamline processes and ensure a smooth workflow. Maintain detailed documentation of CI/CD pipelines, infrastructure configurations, and best practices.  Security and Compliance: Implement security best practices for CI/CD pipelines and infrastructure. Ensure compliance with industry standards and organizational security policies. Required Education & Experience:Bachelor’s degree in computer science, Engineering, or related field.Proven experience as a DevOps Engineer with a focus on Azure.Hands-on experience with mobile application development for Android and iOS.Strong knowledge of CI/CD best practices and tools. Familiarity with IaC tools and infrastructure automation.Excellent problem-solving and communication skills.Key Technologies:Azure DevOps, Azure Pipelines, Azure Repos, Azure Artifacts Visual Studio Build (VSBuild) YAML PowerShell, Bash Microsoft App Center, Google Play Store, Apple Store, Apple B2B Store Terraform or ARM templates Monitoring and logging tools (e.g., Azure Monitor, Log Analytics)",
        "location": "Charlotte, NC",
        "date": "10/04/2023 03:28PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-at-ryan-consulting-group-llc-3733152618?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=JIXBEyJLbfown%2BvxUAFvpA%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Devops Engineer",
        "company_name": "Wise Skulls",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQFPO-9zPmptEw/company-logo_100_100/0/1686585509563?e=2147483647&v=beta&t=etdzsjJ4h7NcIKguMoRcHpHUaIzv6dr0eIZ5KYFmhbo",
        "listing_details": "Seniority level: Entry level, Employment type: Contract, Job function: Engineering and Information Technology, Industries: Information Services",
        "description": "Title: DevOps EngineerLocation: Philadelphia, PA (Day 1 on-site)Duration: 6+ monthsImplementation Partner: InfosysEnd Client: To be disclosedJd5+ years of experience as DevOps EngineerExpertise in Python scriptingExperience in monitoring and analytics tools preferably DatadogPipeline setup for ingesting telemetry data into monitoring tools preferably DatadogAutomated alert triggering",
        "location": "Philadelphia, PA",
        "date": "10/09/2023 03:28PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-at-wise-skulls-3734718178?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=Vdn4Bzcgz4sj%2Bamh%2BUjegA%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Devops Engineer",
        "company_name": "TechTammina LLC",
        "company_logo": "https://media.licdn.com/dms/image/C510BAQGfT3LTL31mMg/company-logo_100_100/0/1519896608629?e=2147483647&v=beta&t=nWtALMNYnI8U6R6wLTMoxX_I5OAaAUxcgm0NNu6D00E",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Role: Devops EngineerLocation: Washington DC (Day one onsite, 3days onsite and 2 days remote)Duration: Long termRate: MarketMust haves: AWS, Kubernetes, AWS Cloudformation, Linux, Python, Shell ScriptingSchedule: Some flexibility required to accommodate occasional after hours production support.Job DetailsExperience in developing and maintaining CI/CD process for SaaS applications by accessing tools like Maven, Jenkins, etc. Hands-on experience in using configuration management tools like Puppet, SaltStack, Ansible, etc.Hands-on experience to build and handle VM's, Containers utilizing tools like Kubernetes, Docker, etc. Hands-on experience in building, designing and maintaining cloud-based applications with AWS, Azure, etc.Working in regulation with industry-standard best practices in close coordination with integration and deployment team. Interview InformationRounds: 2Duration: 1st round - 30 min 2nd round - 60 minAdditional Notes: MS Teams, Video MandatoryThanks & Regards,Nikhil KanchiSr Technical RecruiterTech Tammina LLC | 4460 Brookfield Corporate Dr. Suite N, Chantilly, VA-20151Phone: 571-685-2150 | 703-349-1053E-mail: nikhil.kanchi@tammina.com",
        "location": "Washington, IN",
        "date": "07/09/2023 03:28PM",
        "url": "https://www.linkedin.com/jobs/view/devops-engineer-at-techtammina-llc-3632572103?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=s5OWUe8MeyHrdzQzKo3vjA%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Junior DevOps Engineer",
        "company_name": "GliaCell Technologies",
        "company_logo": "https://media.licdn.com/dms/image/C4D0BAQFaa2wszqjcdw/company-logo_100_100/0/1624468622195?e=2147483647&v=beta&t=fSYV21hpkNvYlDlyd-ZjaLugjcw-HdHiCcITPVILbEI",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Internet Publishing",
        "description": "Are you a Junior DevOps Engineer who is ready for a new challenge that will launch your career to the next level?Tired of being treated like a company drone?Tired of promised adventures during the hiring phase, then dropped off on a remote contract and never seen or heard from the mothership again?Our engineers were certainly tired of the same. At GliaCell our slogan is “We make It happen”.We will immerse you in the latest technologies.We will develop and support your own personalized training program to continue your individual growth. We will provide you with work that matters with our mission focused customers, and surround you with a family of brilliant engineers. Culture isn’t something you need to talk about…if it just exists. If this sounds interesting to you, then we’d like to have a discussion regarding your next adventure! If you want to be a drone, this isn’t the place for you.We Make It Happen!GliaCell Technologies focuses on Software & System Engineering in Enterprise and Cyber Security solution spaces. We excel at delivering stable and reliable software solutions using Agile Software Development principles. These provide us the capability to deliver a quick turn-around using interactive applications and the integration of industry standard software stacks. GliaCell’s Enterprise capabilities include Full-Stack Application Development, Big Data, Cloud Technologies, Analytics, Machine Learning, AI, and DevOps Containerization. We also provide customer solutions in the areas of CND, CNE, and CNO by providing our customers with assessments and solutions in Threat Mitigation, Vulnerability Exposure, Penetration Testing, Threat Hunting, and Preventing Advanced Persistent Threat.We Offer:Long term job securityCompetitive salaries & bonus opportunitiesChallenging work you are passionate aboutAbility to work with some amazingly talented peopleJob Description:GliaCell is seeking a Junior DevOps Engineer on one of our subcontracts. This is a full-time position offering the opportunity to support a U.S. Government customer. The mission is to provide technical expertise that assists in sustaining critical mission-related software and systems to a large government contract.Key Responsibilities:Provide support for deploying and maintaining software on existing systems.Support migrating deployments to new cloud systems.Research, design, implement, and manage software deployments including CI/CD processes.Identify areas for modification in existing systems and subsequently developing these modifications within the contract.Work closely with developers, platform maintainers and systems analysts.Key Requirements:To be considered for this position you must have the following:Possess an active or rein-statable TS/SCI with Polygraph security clearance.U.S. Citizenship.0+ years of Software/System Engineering experience and a BS Degree in Computer Science (or related). 5 years of Software/System Engineering experience may be substituted for a technical bachelor's degree.Works well independently as well as on a team. Strong communication skills. Key Skills:Kubernetes, Docker, Docker-compose, Helm, Git, Gitlab, Gitlab runners, Experience using Rancher, Linux command line tools.Desired:Experience with dockerized microservice architecture. Experience with AWS Tools such as CloudFormation, EC2 instances, S3, ECS, EKS.Location: Columbia, MD + Partial TeleworkSalary: Based on Education, Years of Experience, Skill and AbilitiesCheck Out Our Benefits:Paid Time OffMedical, Dental & Vision BenefitsLife & Disability InsurancesTuition, Training & Certification Reimbursement401K ContributionEmployee Referral Bonus ProgramEquipment ReimbursementTeam Engagement & OutingsSwag…And more!Learn more about GliaCell Technologies:To apply for this position, respond to this job posting and attach an updated resume for us to review. GliaCell Technologies, LLC is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.Powered by JazzHRnm0voBKUzU",
        "location": "Columbia, MD",
        "date": "10/07/2023 03:28PM",
        "url": "https://www.linkedin.com/jobs/view/junior-devops-engineer-at-gliacell-technologies-3735221944?refId=czKdvjWU55BQ%2BXrQ4%2FNG%2Fw%3D%3D&trackingId=p0VnIcSuwStkTXCP8F%2BP6g%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card"
    }
]