[
    {
        "job_title": "Solutions Engineer",
        "company_name": "Scandit",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQGL7PQZzO8bkg/company-logo_100_100/0/1673974680398?e=2147483647&v=beta&t=cBX5zl0hwPOk1hfbIl2UvfDnuSVa80yIX3ibGxUawyw",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting, Software Development, and Technology, Information and Internet",
        "description": "Fantastic opportunity to engage directly with a worldwide leading retailer based in Bentonville (relocation package is available):Scandit is currently seeking a Solutions Engineer to join our growing team. Based in Bentonville, Arkansas, you will act as the product expert working with our sales team to offer Scandit’s disruptive Mobile Data Capture and Augmented Reality Solutions to one of our key Enterprise clients in the retail vertical.You are a high-performing professional who has a strong technical background, and can communicate complex concepts in a crisp and credible manner to a technical and non-technical audience. You excel in understanding customer business needs.You have a natural passion for technology and bring previous experience working in a fast growing and innovative tech company with a high degree of autonomy.You will actively engage in the sales process, play a key part in clarifying customer needs and wants, and communicate these back to influence Scandit product development. As part of your role, you will educate and evangelize to customers about Scandit products and advise them on how to gain the most value from our offerings.What You Will DoIdentify and present to customers how our mobile data capture and augmented reality solutions can improve current business processesProvide day-to-day product expertise during the sales process, including directly interfacing with the sales team and potential customersInfluence our product strategy by effectively communicating feedback from customers and prospects and work with the product team to develop new product featuresLead the design and delivery of solutions for customers.Support partners closely with technical expertise.Ensure that the sales teams are accurately and suitably supported resulting in successfully closed dealsWho You AreExtensive experience in a presales, technical consulting, solutions or engineering roleAdvanced written and verbal communication skills, including presentations and proposals for both business and technical audiences.Strong strategic thinking and analytic skills.Solid understanding of mobile eco-system and enterprise IT architectures is desirable.Degree in Computer Science, Engineering, or equivalent field is preferred.Who We AreScandit enables enterprises and consumers to change the way they interact with everyday objects and augment the physical world with real-time data captured by scanning barcodes and recognizing text, objects, and other visual identifiers using smartphones, tablets, wearables, drones and robots.Scandit’s mobile data capture platform is built on proprietary computer vision, augmented reality, and machine learning technologies. Companies in industries such as retail, transportation & logistics, manufacturing, and healthcare can use Scandit’s technology to create and power mobile apps for crucial enterprise workflows like mobile point of sale, mobile shopping, self-checkout, inventory management, and proof of delivery.Many of the world's most innovative and successful companies are benefiting from Scandit’s enterprise-grade mobile data capture platform, including Sephora, DHL, and Levi Strauss & Co.Imagine The What. Build The How.“Everybody is welcome here” - Is a celebrated component of our DNA.At Scandit we strive to create an inclusive environment that empowers our employees. We believe that our products and services benefit from our diverse backgrounds and experiences and are proud to be a safe space for all.All qualified applications will receive consideration for employment without regard to race, colour, nationality, religion, sexual orientation, gender, gender identity, age, physical [dis]ability or length of time spent unemployed.#LOC-RemoteUS",
        "location": "United States",
        "date": "10/09/2023 02:21PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-scandit-3729486337?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=bXDgxub59jtfmBjeCWomaQ%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Majors Solutions Engineer - East",
        "company_name": "Wiz",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQEHFdqwvI6ShA/company-logo_100_100/0/1654720939118?e=2147483647&v=beta&t=b0mkGHk4ve8jITdBLc5B7VAs_meJkzuqupIvI5Ayb-g",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Computer and Network Security",
        "description": "Come join the company that is reinventing cloud security and empowering businesses to thrive in the cloud. As the fastest-growing startup ever, Wiz is on a mission to help organizations secure cloud environments that will accelerate their businesses. Trusted by security teams all over the world, we have a proven track record of success and a culture that values world-class talent.Our Wizards from over 13 countries work together to protect the infrastructure of our hundreds of customers, including over 35% of the Fortune 100, who trust us to scan and secure over 230 billion files daily. We’re the leading player in a massive and growing market, but it’s still early enough for you to make a significant impact. At Wiz, you’ll have the freedom to think creatively, dream big, and use your full range of skills to contribute to our record growth. Come join our team and help us create secure cloud environments that allow the best companies to move faster.SummaryAs a Majors Solutions Engineer, you will be responsible for supporting our Major Accounts prospects and customers, reporting to the Majors Solutions Engineer Manager. You will partner directly with Majors account executives to help change our customers’ view and how they approach cloud security. You will be their trusted advisor for all matters related to cloud security across AWS, Azure, and GCP. We are passionate about technical sales and helping our customers achieve the maximum value from our solution.What You’ll DoPartner with the Majors team to provide technical leadership to our customers and prospective customers in conjunction with helping our team meet their quarterly sales targets. Provide presentations to our customers and prospective customers such as whiteboards, product demonstrations, slides, and proof of value outcomes. Help our customers and prospective customers plan in-depth test plans for showing the value of the Wiz platform in their environment (proof of value). Invest time in learning new product features, industry related developments, and broadening your overall technical skillset. Represent Wiz in technical forums such as trade shows, technical meetups, and industry events. What You’ll BringAbility to deliver world class demonstrations and training experience to our channel customers Mastered the technical sales process Thrive in a creative technical role assisting partners to build a technical business delivery model Experience in a sales engineering role delivering solutions to C-level executives at major account customers Cloud security experience AWS/Azure/GCP hands on experience Network engineering experience Strong operating system, virtual machine, and container knowledge Knowledge of risk-based security assessments and frameworks Understanding of cloud identity, access, certificates, and keys Experience with traditional CSPM tools SaaS experience Awareness of the CI/CD process Familiarity with Infrastructure as Code Location:This person must be located on the east coastIf your experience is close but doesn’t fulfill all requirements, please apply. Wiz is on a mission to build a special company. To achieve our goal, we are focused on hiring Wizards with different backgrounds, perspectives, and experiences.Wiz is an equal opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law.By submitting your application, you acknowledge that Wiz will process your personal data in accordance with Wiz's Privacy Policy.",
        "location": "New York, NY",
        "date": "10/04/2023 02:21PM",
        "url": "https://www.linkedin.com/jobs/view/majors-solutions-engineer-east-at-wiz-3732383730?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=r%2F9d3hsK443A%2B4CMQAO3UA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solution Engineer",
        "company_name": "ICEYE",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQEiRppK9uGGnw/company-logo_100_100/0/1630649897972?e=2147483647&v=beta&t=Kl51M3xsaQbGw_Cn2ZfgRVQoQI3yDfku2yvrT3btrWo",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Aviation and Aerospace Component Manufacturing",
        "description": "Position: Solution Engineer Location: Remote - United StatesHiring Model: Remote Who are we?We are a Finnish-based international New Space company with employees from more than 57 countries in Finland, the US, the UK, Spain, UAE, and Poland. Our team is a tight-knit group of experts from areas including engineering, software development, and radar technology. We're innovative, driven people who strive for excellence in everything we do. As advocates of our corporate culture, we value teamwork and curiosity and know how to have fun!What do we do?ICEYE is designing, building and operating its commercial constellation of small Synthetic Aperture Radar (SAR) satellites with SAR data available to customers. We are also the leading supplier of new-space SAR satellite missions to governments and large organizations. Our satellites acquire images of Earth at any time - even when it's cloudy or dark - providing commercial and government partners with unmatched persistent monitoring capabilities. Information derived from our SAR images helps customers make data-driven decisions to address time-critical challenges in various sectors, such as maritime, disaster management, defence & security, insurance, and finance.What are we looking for?To support the company's growth, we seek a Solution Engineer to join our Customer Solutions TeamResponsibilitiesBe an expert in the application of ICEYE data to solve insurance and government natural catastrophe use casesConsult with clients and prospects on effective ways to leverage ICEYE dataSupport Sales Executives and Strategic Account Managers throughout the customer lifecycle with technical and process requirements to realize the value from ICEYE's productsSupport Customer Success Managers throughout the implementation and integration of ICEYE's products in their processes and decision making tools.Create custom geospatial analyses to support clients, prospects, and ICEYE MarketingRequirementsMust have:At least 3 years experience of practical experience performing geospatial analyses for data driven decision makingCreative problem solver with a passion for telling stories with data and analyticsAt least 2 years experience of working directly with clients in a technical pre-sales, data implementation or GIS consultant role. Skilled in multiple geospatial analysis techniques and comfort with multiple analysis platforms and languagesPreferred to have:Familiarity with remote sensing, especially SARExperience in natural catastrophe analyticsExperience supporting insurance or government clientsA higher degree in Geography, Earth Science, Environmental studies or related fieldBenefitsBenefitsA job that matters in a dynamic New Space environment with a scale-up approachAn independent role with a supportive and diverse work environmentOccupational healthcare, occupational and private insuranceTime for self-development, research, training, conferences, or certification schemes.Diversity & inclusion are core values at ICEYE. We are passionate about building and sustaining inclusive and equitable working and learning environments for all staff. Every team member enriches our diversity by exposing us to various ways to understand and engage with the world, identify challenges, and discover, design, and deliver solutions.Is this the role for you? Apply now to start your journey with ICEYE.We are making the impossible possible together.ContactJonathan Glibbery",
        "location": "United States",
        "date": "10/03/2023 02:21PM",
        "url": "https://www.linkedin.com/jobs/view/solution-engineer-at-iceye-3731830134?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=J0jpy8OeN7ijNUqPCOlisA%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "IoT Solutions Engineer",
        "company_name": "TEAL",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQFvjnKatRzjmg/company-logo_100_100/0/1545430891695?e=2147483647&v=beta&t=f4MV8b9vDBRBhxA_dgFKpYncXgEtAVK37tbOQz6V_8k",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Internet Publishing",
        "description": "Teal Communications, Inc. is an Internet of Things (IoT) company headquartered in Seattle, Washington that is looking for a motivated and experienced IoT Solutions Engineer to join the team. The ideal candidate will have 4-7 years’ experience in a technical solutions engineer role in the telecommunications or Internet of Things (IoT) industry. The IoT Solutions Engineer will report to the Solutions Manager and enhance the customer experience through pre- and post-sales efforts. The IoT Solutions Engineer will help troubleshoot technical sales escalations, working to provide solutions for successful customer product implementations. The hire may also be asked to provide occasional limited onsite support for Tier-1 customer rollouts. Typical pre-/post-sales support includes gaining an understanding of the customer's product strategy and analyzing the customer's testing and deployment challenges. The IoT Solutions Engineer is a wireless data subject matter expert on current and future wireless technologies. The ideal candidate has experience with M2M, IoT, eSIM/eUICC technologies. Familiarity with basic data packet layer networking concepts such as SGW/PGW, CGNAT, TCP/IP, MQTT, and CoAP all the way down to the data schemas a customer might use is a big plus. The IoT Solutions Engineer will often lead the coordination of cross functional teams including sales, engineering, operations and customer support for pre-/post-sales efforts. Individuals who thrive at Teal Communications exhibit the following success skills – Collaboration, Results Focus, Hard Working, Critical Thinking, Executive Presence, Growth Mindset, and Intellectual Curiosity.Responsibilities: Technical onboarding and implementation support for new M2M/IoT customers.Pre- and post-sales technical SME for US and international sales efforts. Engage with Account Executives to understand deal statuses and next steps Leverage technical knowledge of eSIM, IoT, and networking to overcome customer barriers and challenges during the product onboarding, implementation, and deployment process Send emails and conduct calls with prospects and customers as requested by VP of Sales or Account Executives. Services management for implementation support and new device testing. Become the trusted technical advisor for key decision makers (CEOs, CTOs, CIOs) Qualifications: Bachelor’s Degree or equivalent experience preferred. 4-7 years’ experience In Telecommunications, IT Administration or Network Engineering roles with a professional track record of successful technical leadership involving network and application troubleshooting skills. Deep technical understanding of eSIM and the Internet of Things (IoT) industry. Previous experience in a technical solutions engineer or technical sales role is preferred. Strong verbal and written communication skills including ability to communicate with all levels within the firm. Compensation:This hire will receive a base salary and equity package DOE with 100% of employee healthcare, vision and dental premiums paid for by Teal. Teal Communications, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, gender identity or any other characteristic protected by law.Seniority LevelMinimum 4-7 Years’ ExperienceIndustrySoftware, Telecommunications, IoTEmployment TypeFull-timeJob FunctionsEngineering, Sales, ProductPowered by JazzHRxjAZH2RH6v",
        "location": "Seattle, WA",
        "date": "10/09/2023 02:22PM",
        "url": "https://www.linkedin.com/jobs/view/iot-solutions-engineer-at-teal-3705850150?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=uDoTBn0RjrGMp6maBr4RjA%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solution Engineer",
        "company_name": "InfraHire",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQGrwjBMBuwD2g/company-logo_100_100/0/1613565737568?e=2147483647&v=beta&t=-l1aaEBPWDLoZIDqzEIhDT90FmPEbndKvnWBO2iJqQY",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Facilities Services",
        "description": "InfraHire is looking for a Sr. Solution Engineer in New York, NY.Job DescriptionThe team is looking for an experienced solutions engineer who will be able to develop these capabilities and their proof of concepts together with the engineering team (before the full product process), and formalize procedures to onboard large enterprises to the platform.Key ResponsibilitiesWork closely with Security and DevOps teams of new customers to design and implement tailor-made solutions to their architecture.Functioning as a subject matter expert for Cloud Providers' architectures, Infrastructure-as-code, and complex product deployments for customers.Work closely with our Product and Engineering teams to communicate customers' requirements and deliver generic solutions for repeating requirements.Ideate and design new solutions to help our customers gain more value from platform.Create innovative resources to equip and educate customers and peers: knowledge base articles, repositories, Terraform models, etc.Qualifications5+ years of experience as a Solutions Engineer working with large enterprises in the space of Cloud Solutions/ServicesStrong technical background with expertise in Public Cloud Providers (AWS, GCP, Azure) and all of their services, Kubernetes, etcStrong expertise in Infrastructure-as-code (Terraform, Cloudformation)Fundamental knowledge of Python, using APIs, SDKs, and CLIStrong people skills and ability to deliver complex messaging in a clear and logical mannerBachelor's Degree in Computer Science or other related field - advantageExperience in the space of Cloud Security / GRC - advantageInfraHire is an Equal Opportunity Employer.",
        "location": "New York, NY",
        "date": "10/09/2023 02:22PM",
        "url": "https://www.linkedin.com/jobs/view/solution-engineer-at-infrahire-3722165067?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=DlAZURRjsPOpSQJczbmVDQ%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Founding Solutions Engineer",
        "company_name": "Coast App",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQGJ6iGk0PsNxg/company-logo_100_100/0/1570496098638?e=2147483647&v=beta&t=Iws0Hvp4pu4H6mNm7KRY7i_PMuuvXdJuVx2uTmTiuR0",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "Coast is looking for a Founding Solutions Engineer who will primarily focus on post-sale implementation, support and success. This role will eventually help build a team beneath them.What We DoCoast helps API-first companies effectively demo their software. Our platform turns stale API docs into personalized and interactive demos for sales, marketing and implementation.Where Are WeWe support the world's leading API-first companies across Fintech, Healthtech, Fraud and more. We're backed by world class investors like Y Combinator.What We're Looking ForStrong experience working with and integrating vendor APIs. Ability to work with customers on technical problem solving with strong written and verbal communication skills.Excited to work at an early stage startup, where you will move fast, have a lot of autonomy and make a direct impact on a daily basis.Living in NYC and able to work in person 3 days a week.",
        "location": "New York, NY",
        "date": "10/09/2023 02:22PM",
        "url": "https://wellfound.com/jobs/2761267-founding-solutions-engineer?utm_campaign=linkedin_syndication&utm_source=linkedin"
    },
    {
        "job_title": "Lead Solution Engineer",
        "company_name": "Freshworks",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQE91pHKG3yvnw/company-logo_100_100/0/1666790263124?e=2147483647&v=beta&t=aNnu6SrT1XkaK7LigPGS_rTKYBXd4918fC3LK4g5BEQ",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Sales, Industries: Software Development",
        "description": "Company DescriptionFreshworks makes it fast and easy for businesses to delight their customers and employees. We do this by taking a fresh approach to building and delivering software that is affordable, quick to implement, and designed for the end user. Headquartered in San Mateo, California, Freshworks has a global team operating from 13 global locations to serve more than 65,000 companies -- from startups to public companies – that rely on Freshworks software-as-a-service to enable a better customer experience (CRM, CX) and employee experience (ITSM).Freshworks’ cloud-based software suite includes Freshdesk (omni-channel customer support), Freshsales (sales automation), Freshmarketer (marketing automation), Freshservice (IT service desk), Freshchat (AI-powered bots), supported by Neo, our underlying platform of shared services.Freshworks is featured in global national press including CNBC, Forbes, Fortune, Bloomberg and has been a BuiltIn Best Place to work in San Francisco and Denver for the last 3 years. Our customer ratings have earned Freshworks products TrustRadius Top Rated Software ratings and G2 Best of Awards for Best Feature Set, Best Value for the Price and Best Relationship.Job DescriptionFreshworks is looking for a self-motivated Lead Solutions Engineer to complement our Pre-Sales team. You will play a critical role by being the technical expert that helps the sales team with new business opportunities as well as consulting or selling to the most strategic prospects and accounts at Freshworks.Solutions Product Engineers are responsible for articulating our value proposition, architecting technology solutions and offering thought leadership to both business and technical audiences. This role is ideal for someone with mid-market software pre-sales experience in a SaaS or technology product organization and experience with customer engagement/support, ITSM/ITIL and cloud-based infrastructure. You have a passion for demoing solutions to prospects, great discovery skills, and the ability to act as a trusted advisor through all stages of the sales cycle to mid-market and enterprise customers.Your role and responsibilities:Work with our regional sales teams to convert prospects to customersPrepare and deliver bespoke technical product demonstrations at client meetings, webinars and customers events using storylines that resonate with the target audienceDeliver product messaging to highlight Freshworks value proposition through whiteboard and slide presentations, proof of concept management and RFP response documentsRespond to various functional and technical customers questions and requirements as well as performing complex workflow analysis and in-depth examinations of the interaction between Freshworks and the customer’s infrastructureCollect, assess and convey different customer requirements to central product managementBecome an advocate for our brand and actively promote our product solutions and services to prospects, potential and existing customers, and partnersCollaborate with internal organizations (including sales, product management, and client services) to execute sales strategyTrain sales teams on the Freshworks' products suite, technical aspects and new product featuresQualificationsMinimum 6 years of relevant experience in a similar technical pre-sales role, preferably in SaaS or software product environmentsBachelor's or Master’s degree in information technology, computer science or a related field is an advantageAbility to explain complex technical concepts in a simple manner. (“Tell me like I am five”)Excellent communicational and listening skills, high-level presentation and demonstration skills, enthusiastic about helping and serving clients, strong customer and solution-oriented personalityHighly driven individual with an execution focus and a strong sense of urgencyA standout colleague who enjoys working in a high-energy, high-volume sales team environmentAdditional InformationAll your information will be kept confidential according to EEO guidelines.At Freshworks, we are creating a global workplace that enables everyone to find their true potential, purpose, and passion irrespective of their background, gender, race, sexual orientation, religion and ethnicity. We are committed to providing equal opportunity for all and believe that diversity in the workplace creates a more vibrant, richer work environment that advances the goals of our employees, communities and the business.",
        "location": "San Mateo, CA",
        "date": "10/09/2023 02:23PM",
        "url": "https://www.linkedin.com/jobs/view/lead-solution-engineer-at-freshworks-3713991765?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=fRxREorSzeZpKaOap8TNkQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "ActivTrak",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQESJMWaHiP4uA/company-logo_100_100/0/1674672862553?e=2147483647&v=beta&t=qVQgufCK4N-Koj4UyNxJGMq0jwhT-Fx4Se6ESQigwMI",
        "listing_details": "Seniority level: Associate, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "ActivTrak is looking for a driven and customer-focused Solutions Engineer to work with ActivTrack’s largest customers. Partnering with our Sales and Customer Experience (CX) teams, you will work directly with customers on technical onboarding as a product subject matter expert, maintaining a continual focus on the customer’s business goals to maximize value out of their ActivTrak investment. This role will leverage your technical expertise to address and resolve deployment and integration challenges focused on customer satisfaction and driving value for customers.Key Responsibilities:  Be customer-obsessed. We believe understanding the customer experience across pre and post-sales activity helps our team build amazing products that solve real problems. Getting to know our customers and the challenges they face through conversations, research, and engagement with our community, will be a powerful input into this role. As a trusted advisor, the SE will possess extensive knowledge of the ActivTrak platform being able to translate business needs into solutions.  Collaborate with Sales and CX teams throughout the customer lifecycle to deliver joint customer engagements including onboarding. Act as an advocate for customers to develop and execute mutual action plans Manage client relationships at all levels and proactively set up customers for success through proactive platform optimization and subject matter expertise.  Serve as the technical liaison and collaborate with the engineering team to share knowledge and insight gained through customer engagements Gather customer feedback and insights on product enhancements, features, and improvements Care deeply about your own productivity. By understanding your own productivity and the productivity of those around you, you gain better insight into our customers’ challenges. We’re looking for someone who wants to talk openly about their own productivity successes for the purpose of innovation and performance elevationRequirementsQualifications:Strong technical background and expertise in the relevant industry or technology stackWork experience in one or more of the following: Technical Account Management, Technology Consulting, Technology Solutions Development, Solutions Architecture, Cloud Computing, Systems AdministrationExceptional communication and presentation skills with demonstrated ability to communicate and influence effectively at all levels of the organization, including executive levelSkills for both analyzing technical concepts and translating them into business terms and for mapping business requirements into technical featuresAbility to explain complex technical concepts in business-friendly terms to customers, then explain customer needs to internal partnersExperience leading efforts of cross-functional teams to facilitate resolution or disposition of customer needs or projectsSkills:Advanced Experience troubleshooting Windows and Mac applicationsExperience working in distributed multi-domain environmentsNetworking knowledge: Routing, Firewalls, Proxies, and General Knowledge of Cloud Security and InfrastructureSQL and Python scripting experienceExperience distributing software at scale and BYOD, Cloud Services: Azure AD, Intune, BigQueryFamiliar with BI applications such as PowerBI, Tableau, Google Looker StudioFamiliarity with system and policy management applications such as GPOFamiliar with SCIM, Json, and REST APIExperience with SAML and IAM solutionsBenefitsWork environment:Position is remote within the USMinimal travelLimited physical demands This is an incredible opportunity to embark on an exciting journey with a dynamic, VC-backed company. If you have a proven track record of creative thinking, a drive for learning, and a deep commitment to collaboration, we want to talk to you!ActivTrak is an equal-opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. ActivTrak does not discriminate on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, marital status, disability, age, protected veteran status, gender identity, or any other factor protected by applicable federal, state or local laws.",
        "location": "Austin, TX",
        "date": "10/09/2023 02:23PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-activtrak-3724696246?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=7ibWslNOesy68WGlgBj13Q%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Sayari | Commercial Risk Intelligence",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQF1Dzp36zDwnA/company-logo_100_100/0/1613158059516?e=2147483647&v=beta&t=1fRDW0UJ4BkG-xOKy3suFdYViqJBbixZbZMjsS9thgY",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering, Industries: Technology, Information and Internet",
        "description": "About Sayari LabsSayari is a venture-backed and founder-led global corporate data provider and commercial intelligence platform, serving financial institutions, governments, legal and advisory service providers, journalists, and commercial enterprises. Thousands of analysts and investigators in over 30 countries rely on our products to safely conduct cross-border trade, research front-page news stories, confidently enter new markets, and prevent financial crime.Our company culture is defined by a dedication to our mission of using open data to combat illicit commercial and financial activity, a passion for finding novel approaches to complex problems, and an understanding that diverse perspectives create optimal outcomes. We embrace cross-team collaboration, encourage learning opportunities, and reward initiative and innovation. If you like working with supportive, high-performing, and curious teams, Sayari is the place for you.What You Will DoSayari is looking for a Solutions Engineer to support technical sales by delivering analytical and technical solutions to meet client needs. You will work closely with sales to identify client requirements, explain technical and functional aspects of products, and support pre-sales evaluations and post-sales integrations. You will partner with leaders in Engineering, Product, and Sales to ensure seamless and consistent delivery of Sayari products and inform product development.We are a hybrid workplace and welcome candidates who prefer to work remotely; however, this role requires periodic in-person engagement with customers at our Washington, DC office, so we will give priority to local applicants.Responsibilities:Develop and execute reproducible analytical processes to support pre-sales RFIsDeliver technical demos of Sayari’s API and Bulk data productsConvey customer requirements and/or feedback to Product and Engineering leadersRequirementsSKILLS & EXPERIENCEMust Haves:4+ years of solutions engineering or client-facing data science experienceExperience executing and delivering reproducible analytical reports based on requirements gatheringFamiliarity with Apache SparkNice to Haves:Experience delivering data products (e.g., parquet)Familiarity with cloud platforms like AWS, GCP, and AzureExperience with business intelligence/dashboardingWillingness to take ownership of projects from requirements gathering to completion and deliveryBenefitsWhat We Offer:Limitless growth and learning opportunitiesA collaborative and positive culture - your team will be as smart and driven as youA strong commitment to diversity, equity & inclusionExceedingly generous vacation leave, parental leave, floating holidays, flexible schedule, & other remarkable benefitsOutstanding competitive compensation & commission packageComprehensive family-friendly health benefits, including full healthcare coverage plans, commuter benefits, & 401K matchingSayari is an equal opportunity employer and strongly encourages diverse candidates to apply. We believe diversity and inclusion mean our team members should reflect the diversity of the United States. No employee or applicant will face discrimination or harassment based on race, color, ethnicity, religion, age, gender, gender identity or expression, sexual orientation, disability status, veteran status, genetics, or political affiliation. We strongly encourage applicants of all backgrounds to apply.",
        "location": "Washington, DC",
        "date": "10/09/2023 02:23PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-sayari-commercial-risk-intelligence-3724532038?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=1HZHLGMsk%2BYwF1EVyHcMdQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Pre-Sales Engineer, Cloud",
        "company_name": "Vertice",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQHhg25DgUD4pA/company-logo_100_100/0/1665506702931?e=2147483647&v=beta&t=Rp7anSDqWVO56ejjtSK2InlxiOa7NrALi9sv5oDvN58",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Sales and Business Development, Industries: Technology, Information and Internet",
        "description": "Location: US, New York Vertice is a rapidly expanding technology company on a mission to help businesses manage their growing spend on SaaS and cloud. Businesses are turning to Vertice to gain visibility and savings on their SaaS stack and cloud spend, taking advantage of pricing insights, trend data, smart dashboards and expert negotiators.Founded by two brothers, Roy and Eldar Tuvey, with a successful history of building SaaS startups, Vertice has already become one of the fastest growing vendors in the market having raised $26million in our Series A funding.We’re well positioned to achieve our mission but we need the right people to ensure it happens. We’re looking to scale quickly but responsibly as we embark on an exciting new stage of growth. Headquartered in London, you’ll be joining a global company and working across talented cross-functional teams to drive innovation and make a significant impact.Your Role at Vertice:As one of the early members of our technical sales team and working closely with the wider Sales and Product teams, to provide technical expertise to support our global sales efforts, including conducting product demos for our potential customers. You will be an AWS/cloud sales expert, and be able to advise our commercial teams in detail about cloud cost optimisation and cloud infrastructure.Responsibilities:Be the technical subject matter expert for prospective and existing customers globally throughout the sales processWork with our customers to complete product demos to showcase the features and technical capabilities of our platform, while becoming a trusted partnerWork with the sales teams on strategy & discovery sessions, in order to understand customer requirements, and develop targeted technical solutionsIdentify the ongoing requirements of customers and partners, and recommend adjusted technical solutions in order to ensure customer successSupport the sales team in achieving revenue goals while maintaining a high level of customer satisfactionStay up-to-date on the latest cloud technologies and industry trendsRequirements3-5 years of industry experience in a pre-sales capacity (solution engineer, sales engineer, technical sales), including AWS or other cloud expertiseProven experience in technical sales and building successful relationships with customersExcellent communication and interpersonal skillsStrong analytical and problem-solving skillsAWS certification preferredBe an excellent communicator and consultative approach – strong sales skills; personable, charismatic, solutions oriented, creative thinkerWhy join Vertice?Be a part of a fast-growing, innovative startup that is changing the way businesses buy and sell SaaSWork with passionate and talented teams that value your contributions and expertiseBe part of a culture that promotes a growth mindset, transparency, collaboration, understanding and diversityShare in our success with equity options",
        "location": "New York, United States",
        "date": "10/09/2023 02:23PM",
        "url": "https://www.linkedin.com/jobs/view/pre-sales-engineer-cloud-at-vertice-3730418977?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=fdSjuMGUaGly420STZjIkg%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card"
    }
]