[
    {
        "job_title": "Cloud Solutions Engineer",
        "company_name": "Intellectt Inc",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQFOYtI3qgbARA/company-logo_100_100/0/1575361607445/intellecttinc_logo?e=2147483647&v=beta&t=01k4I1B1SWtkZeIQdkpRY7nsNiBRbfoxOAlT5e_YctU",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Staffing and Recruiting",
        "description": "Hello,Hope you are doing good.This is Shashank from Intellectt INC.We have an immediate opportunity. Please find the below job description and if you are interested, please forward your resume to shashank@intellectt.com or call me on 732-719-2427.Job Title: Cloud Solutions EngineerLocation: Englewood, CO (Onsite)Duration: 8 Months ContractJob DescriptionQualifications, Duties and Responsibilities:RequiredBachelor's degree in Computer Science, Engineering or related field, and / or equivalent work experience.Minimum Eight Years Of Experience In UNIX/Linux Engineering/administration.Solid (RPM and Debian) Linux engineering, troubleshooting, testing and hardening experience.Experience using new RPM tools like ip, dnf, nmcli.Experience using apt, ubiquity, debian installer, ufw.Familiar writing, reading and understanding yaml, and json files.Automation/Scripting skills: perl, bash and python.Hands-on experience designing, implementing and optimizing Linux file-systems.Experience with vcenter, vmware ovftool, and hashicorp vault and packer tools.Knowledge of CIS Workbench hardening, Linux Test Project and eliciting test cases; experience with Linux troubleshooting, hardening, and performance tuning.Gitlab experience creating workflows, CI/CD pipelines, setting variables.DesiredFamiliar with Test Driven Development (TDD).Experience with LDAP mandatory.Experience with API-driven configuration.Write and review pull/merge requests in Git.Hands-on experience with creating Linux system images and publishing to a repository system such as Artifactory, etc.Red Hat Certified System Administrator certification.",
        "location": "Englewood, CO",
        "date": "10/09/2023 02:26PM",
        "url": "https://www.linkedin.com/jobs/view/cloud-solutions-engineer-at-intellectt-inc-3599176619?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=%2BqbbolZ5TmYeZtwllaGBlA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "BuildBuddy",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQFuNsl4dZV1mw/company-logo_100_100/0/1583350843632?e=2147483647&v=beta&t=4jfocOcSZ2nV9Byw57gUkAJ2cgA7_M_jsjSNdO1nMfE",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "BuildBuddy was founded to make developers more productive. Today we're solving a small piece of this problem with an open-core remote build execution platform for Bazel - but our ambitions are much larger. Our mission is to take the world class engineering tools that are only available to employees of large companies and make them available to everyone.This is a unique opportunity to shape the future of how engineers build and test software. You’ll be working directly with engineering organizations developing the most cutting-edge tech.You will - Build a great customer experience for our users (other engineers!) - Define and prioritize product features, goals, roadmap, and strategy based on your frontline knowledge of customer needs - Design, build, test, deploy, and maintain reliable software - Debug complex production issues across the stack - Resolve customer issues via email, Slack, and video conferencing - Become a trusted technical advisor to our customers - Create or update documentation based on customer interactions - Continually research and learn the current and future best practices of using BazelWe're looking for someone who - Cares deeply about creating the best possible experience for our customers - Can lead technical discussions and help drive technical decisions - Is comfortable with ambiguity and working outside of their comfort zone - Can manage priorities well when there's a lot to be done - Holds yourself and others to a high bar when working with production - Is able to write high quality code in a programming language (e.g. Golang, Typescript) - Has knowledge of DevOps methodologies and appreciates the value technologies like Kubernetes bring to the software deployment and development process - Is experienced with build tools and CI/CD.Who you'll work with - Tyler Williams - GitHub: @tylerwilliams, Twitter: @tylerbw - Siggi Simonarson - GitHub: @siggisim, Twitter: @siggi - Brandon Duffany - GitHub: @bduffany, Twitter: @brandon_duffany - Vadim Berezniker - GitHub: @vadimbereznikerWhat's it like to work at BuildBuddy? - We're a small team of builders that value getting things done over busywork - We value curiosity and encourage employees to contribute to open source projects - We aim to create a warm & welcoming work environment - We treat our coworkers well, and offer platinum health benefits at no cost to employees - We offer generous equity & comp packages, and reward those that help the company grow - We work remotely, but are loosely based out of the San Francisco Bay Area",
        "location": "United States",
        "date": "10/09/2023 02:27PM",
        "url": "https://www.ycombinator.com/companies/buildbuddy/jobs/wAdl3At-solutions-engineer?utm_source=syn_li"
    },
    {
        "job_title": "Solutions Engineer - West",
        "company_name": "ScanSource",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQF-NcnN0qaTRg/company-logo_100_100/0/1688150239165?e=2147483647&v=beta&t=DrzRLDKqrLDckQ0_9ibj971gLYwBppTzEyVIRaKR_GU",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: IT Services and IT Consulting",
        "description": "Job DetailsDescriptionIntelisys, a ScanSource company (NASDAQ: SCSC) located in the North Bay, is the industry's leading Technology Services Distributor and has been named as North Bay Business Journal's \"Best Places to Work\" for the fifth time. Intelisys is also recognized as an Entrepreneur Magazine winner of the “Best Entrepreneurial Companies in America Award”. We are looking for a Solutions Engineer that would be responsible for first-level technical support resource for sales partners on all opportunities, assist with on-boarding activities as required for new partners within their first year, and other engineering-related tasks to support sales partner sales activities.This assignment is a quota bearing position focused both on bringing in new revenues through Sales Partners, as well as working in a general technical-sales support role under the Director of Engineering to drive profitable margin growth overall.Essential FunctionsRegional SME ensuring end-user requirements align with best-fit solutions and suppliersDeliver differentiated assistance in qualifying cloud, networking, and communications opportunities to ensure that Intelisys and ScanSource resources are positioned to optimize performance and profitability.Work directly with sales partners and target customers in defining opportunities.Work with vendor suppliers in understanding their value propositionTo partner with sales to achieve monthly revenue targets and quotasCoordinate supplier sales and engineering supportKey point of escalation at the supplier level to ensure vendor performance and issue resolutionDefines the value proposition of each Intelisys supplier and how they fit strategically into the Intelisys portfolioCoordinate Intelisys supplier sales presentations via meetings and / or conference callsAttend and manage technology education sessions both remote as well as onsiteInfluence profitable revenue and margin targetsParticipate in on-boarding activities with partner support as requiredActively orient Sales Partners to the Intelisys value proposition and educations programsSupport Director of Engineering on assigned tasksWork with the marketing department to develop communication strategy to enhance Intelisys’ reputation as the leading Technology Distributor for best of breed cloud suppliers, education and sales resources & support.Provide feedback to Director of Engineering regarding holes in the overall Intelisys technology portfolioCompensationBase Range : $108,000-$120,000 and total compensation range $180,000-$200,000Actual annual salary offered to a candidate will be based on a number of variables including work experience, education and skills/ achievements, and will be mutually agreed upon at the time of offer.For non-sales roles and sales roles with a variable component, total compensation reflects both a base salary and variable targets .While we’re committed to providing top-tier solutions, we’re just as committed to supporting our own team. Our employees enjoy a variety of comprehensive benefits, including medical/dental/vision coverage, life insurance, and a 401(k) plan with matching provision. Outside of CA, ScanSource grants 128 hours of paid time off (PTO) each calendar year (prorated for date of hire). In the state of CA, employees accrue a set number of hours each pay period equaling the same 128 hours of PTO. ScanSource also celebrates 8 paid company holidays.ScanSource, Inc. is an Equal Opportunity EmployerEOE/M/F",
        "location": "Lenexa, KS",
        "date": "10/09/2023 02:27PM",
        "url": "https://recruiting.ultipro.com/SCA1004SCSO/JobBoard/220bcab6-cf46-46e3-8fd5-181b273b0628/OpportunityDetail?opportunityId=824f44fb-4640-4eda-bb96-430ecdf9c7db"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Flatfile",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQFxnS00H7B3fg/company-logo_100_100/0/1696434944460?e=2147483647&v=beta&t=tdyUqJ04bx1M8Q0nP1_7vV2cx-X0bUTOjXnt6osxSyw",
        "listing_details": "Seniority level: Not Applicable, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Transportation, Logistics, Supply Chain and Storage",
        "description": "The CompanyAt Flatfile, we’re creating beautiful, human-centric experiences to remove the barriers between people and data. With our API-first, event-driven architecture, developers can build fully customizable, powerful workflows that address any file-based import use case, combined with a highly intuitive experience designed for end-users.The OpportunitySolutions Engineering at Flatfile is an important part of our Sales engine. You will partner with Enterprise Account Executives to help win more deals while also helping improve our sales motions for greater efficiency and growth. We are agents of change, always improving our product knowledge of use cases and then sharing our insights with Enablement and Product teams to support Flatfile's evolution.You'll be the primary technical resource for the Sales Team, helping Account Executives give compelling product demonstrations that speak to prospective customer use cases. As a founding member of the Solutions Engineering team, you will help shape how we sell Flatfile. As our products and market evolve, you will improve our processes and enablement materials over time.You will report to: VP of SalesWhat you'll doPartner with the Sales Team to explain the Flatfile value proposition, vision and strategy to customersOversee technical engagement with customers during the trial phase and work with customers on any identified issues or concerns to a successful conclusionDevelop in-depth knowledge of Flatfile's products and use cases, with enough proficiency to provide customized product demonstrations and answer technical questions from prospective customersProvide feedback to Enablement and Product teams to help improve processes, collateral and productsIdentify opportunities for improvement and share new understandings with our Sales teamTechnically close complex opportunities through advanced competitive knowledge, technical skill, and credibilityDeliver product and technical briefings/presentations to potential clientsEngage and communicate with customers and Flatfile business/technical teams regarding product feedback and the competitive landscapeWhat we're looking for3+ years of Solutions/Sales Engineering (or similar) experience for a B2B SaaS offering, with some of that time spent selling a developer-focused product Experience running product demonstrations, presenting to customers, and creating documentation shared/used by teams Expert in Java and TypeScript, and experience with any of the following: Java, Python, Ruby, Go, Node.JS, PHP, and .NETDevelopment experience in one or more server-side programming languages (Node.js, Python, Ruby etc.) Basic level knowledge of databases and data structures Experience at an early-stage or high-growth startup and comfortable with a high degree of changeExperience running training sessions and creating basic training materials to support themYour own unique talents! If you don't meet all of the qualifications listed above, let us know why you'd be a great fit for this role in your cover letterIn accordance with applicable law, the following represents Flatfile's reasonable estimate of the range of possible compensation for this role if hired in Colorado.Salary: $140,000 - $164,000 annuallySales Commission & Equity: this role is eligible to earn commissions and equity options#BI-RemoteReasons you’ll love working hereComprehensive health, vision, and dental insurance for you and your dependents401k match. 100% matching for up to 3% and a 50% match for the next 2%Equity options for all full-time employees100% remote work environmentUnlimited paid time off, with a recommended minimum of 3 weeks$10,000 home office makeover with personal access to an interior designer$150 per month toward cell phone and wifiThe best tools to do your work, including a Mac laptop and top-of-the-line hardware24/7 access to a Health Advocate & free annual membership to One Medical12 weeks of paid family leaveAnd much more!Flatfile believes a diverse and inclusive environment is key to building a great company. As such, Flatfile is proud to be an Equal Opportunity Employer. We are committed to creating an environment that is welcoming for people from all walks of life; we do not discriminate based on race, color, gender identity, religion, sex, national origin, disability, veteran status, or any other characteristic protected by law. While we have more work to do to advance diversity and inclusion, we are invested in growth that empowers everyone to succeed.",
        "location": "United States",
        "date": "10/09/2023 02:27PM",
        "url": "https://jobs.lever.co/flatfile/9c1678f0-f602-4976-96aa-75b646bdbf25/apply?lever-source=LinkedIn"
    },
    {
        "job_title": "System Solutions Engineer",
        "company_name": "AMAX",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQGhUApX2Z_qjA/company-logo_100_100/0/1679689356713/amax_engineering_logo?e=2147483647&v=beta&t=Kjl1e5x-QR3XHFtwiXTk0k8F_mQPWi0SGsS-uXbNsP8",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Information Technology & Services",
        "description": "Description*Salary range: $70,000 ~ 110,000 annually.*Develop, troubleshoot, and test servers based on the most current x86 architecture to meet customer requirements. Work closely with the sales team on quotations and solution details. Partner with the Business Development or Sales and own the technical conversation, solution development, and solution proposals as part of the customer sales engagement. Identify customers’ needs, address technical questions and objections, and provide insight into industry trends and best practices. Conduct research and technical investigations to ensure products meet design specifications and requirements. Conduct research and technical investigations about deep learning, high-performance computing, and storage to ensure products meet design specifications and requirements. Create and maintain technical documentation, including user manuals and technical specificationsStay up-to-date with emerging technologies and industry trends to ensure AMAX’s solutions are competitive. RequirementsBachelor's degree in Computer Science, Electrical Engineering, or a related field. Experience with serve products, CPU/GPU, storage, and networking. Knowledge of the latest x86 server architectures. Strong analytical and problem-solving skills. Excellent written and verbal communication skills. Ability to work independently and collaboratively in a team environment. Experience in the server industry. Preferred Qualifications: Linux skill and scripting language ability. BenefitsMedical InsuranceDental InsuranceVision Insurance401(k)Flexible spending accountCommuter benefitsDisability insuranceWe also have a perfect location for all types of commuters: AMAX is located right between I-680 and I-880. Warm Springs/South Fremont Bart station and bus stops are within a 10-minute walking distance. 5 more grocery stores, 6+ coffee/tea places, and numerous restaurants within 1 mile. Feel free to try the delicious fusions or grab your daily groceries after work!The TeamWe wouldn’t be successful without our passionate team of dedicated people. We are always searching for talented individuals to join the team. As a next-gen solution provider at the heart of Silicon Valley, AMAX employees benefit from a collaborative, fast-paced work environment that features access to the most cutting-edge technology in the IT world. AMAX offers an array of job positions for ambitious minds seeking the opportunity for intellectual and career growth.For more information about AMAX and our history of award-winning leadership, see our accolades here.Our CommitmentAMAX is an equal-opportunity employer. We embrace diversity in our employee population. We provide equal opportunity to all qualified applicants for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.",
        "location": "Fremont, CA",
        "date": "10/09/2023 02:27PM",
        "url": "https://www.linkedin.com/jobs/view/system-solutions-engineer-at-amax-3735186443?refId=Hju%2B7jx965FWnUsk0G579g%3D%3D&trackingId=OpC47FrqjieEAtp1GPfBWg%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card"
    }
]