[
    {
        "job_title": "Solutions Engineer",
        "company_name": "LMI Technologies",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQFXwb01UlIaUQ/company-logo_100_100/0/1631340929947?e=2147483647&v=beta&t=FcEJqRBfnt8o53qrSvls9WAh8N5ITNgO-Lmebga3Kl0",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Automation Machinery Manufacturing",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        LMI Technologies, recognized as one of Canada’s Best Workplaces, is a medium-sized technology company built on a culture of openness, respect and professional excellence. At LMI our staff work passionately toward the common goal of designing and delivering innovative 3D machine vision solutions to OEMs and System Integrators working in industrial factory automation around the world. The result of this teamwork is high-performance, easy-to-implement and cost-effective 3D sensor technologies that deliver the best results in even the most challenging 3D inline inspection applications.<br/><br/><strong>What will you do as a Solutions Engineer?<br/><br/></strong>The Solutions Engineer (SE) will use technical product knowledge of LMI 3D sensors to support sales activities. The SE works closely with customers to resolve technical issues as well as LMI’s sales managers to grow business.<br/><br/><strong>Required<br/><br/></strong>As an Solutions Engineer your responsibility is to work closely with our customers to resolve any technical issues they may encounter as well as interact with other members of the sales team to support sales activities. Through such activities as application testing through troubleshooting complex support issues you will be in contact with a diverse customer base to ensure they receive answers in a timely manner. Beyond providing technical support you will also be required to perform a wide variety of tasks to help achieve the growth initiatives of the sales team. These tasks include:<br/><br/><ul><li>Provide customer support for LMI products. Technical support will primarily be provided remotely but at times on site assistance will be required.</li><li>Develop customized vision solutions using LMI ’s products. Perform hardware and software engineering work for prototype systemes</li><li>Design and implement customized image processing algorithms</li><li>Help communicate and manage technical risks of projects</li><li>Perform in house testing of samples sent in by customers (to determine if our sensors meet the application requirements) and report results.</li><li>Maintain test and demo equipment to ensure that it is operational at all times</li><li>Provide training or product demonstrations to existing and potential customers on LMI's premises or at the customer's premises as required</li><li>Support the sales team in preparing for trade shows and attend these shows when necessary</li><li>Continually provide feedback as to how LMI's products or services can be improved to enhance our customers experience<br/><br/><br/></li></ul><strong>What do you need to be successful?<br/><br/></strong><ul><li>Bachelor of Computer Science, Electrical, Mechanical,Physics or Computer Engineering degree or equivalent</li><li>Minimum 2-3 years of experience in the high-tech or factory automation industry Experience in consumer electronics preferred</li><li>Minimum 2 years customer-facing experience</li><li>Previous 2D/3D machine vision experience (with LMI products or a competitor) strongly desired</li><li>Excellent programming skills. Visual Studio (C, C# or VB.NET) or Python experience highly desired</li><li>Previous system integration experience highly desired</li><li>The following skills are desired, but not required: PLC programming, CAD (SolidWorks), Electronics (wiring and setup), Robotics (Fanuc or UR)</li><li>Data analysis experience preferred (using Labview, Python, Excel, or other)</li><li>Great problem solving skills</li><li>Solid interpersonal skills for succeeding in a team environment</li><li>Exceptional verbal and written communication skills with proficiency using Microsoft Office and Google products</li><li>Exceptional organizational and prioritization skills</li><li>Demonstrated ability to work independently, with minimal supervision</li><li>There will be occasional visits to customers within the Cupertino area<br/><br/><br/></li></ul>Salary Range: $76,000 - $100,700 - $125,000<br/><br/>Expected Salary: Our typical hiring range will be +/- 10% of the midpoint listed above. Factors influencing this decision include qualifications and market conditions for the role.<br/><br/><strong>How to submit your interest?<br/><br/></strong>If you are interested in this exciting opportunity and working for a fast-growing global technology company with an inspiring and engaging workplace environment, please submit your application to our Human Resources team in confidence by clicking the “Apply Now” button.<br/><br/>While we appreciate your interest in LMI very much, we are only able to respond to candidates selected for further consideration. We look forward to talking to you about the possibilities of beginning a rewarding new chapter of your career!<br/><br/><strong>Why being inclusive is important to us?<br/><br/></strong>At LMI Technologies, we are an Equal Opportunity employer and we value the diversity of the people we hire and serve. We strive to build and grow our team that fosters variety in backgrounds, perspectives, experiences and skills. We embrace inclusiveness in our workplace, so we can utilize each person’s talents and strengths.<br/><br/>If you are interested in working for a fast-growing global technology company with an inspiring and engaging workplace environment, we invite you to apply and talk about the possibilities of beginning a rewarding new chapter of your career.<br/><br/>#LMISJ<br/><br/>We assure you, once you complete your application, your information is safe with us. To learn more about how we use your personal data, please review our Privacy Policy (https://lmi3d.com/privacy-policy).\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Cupertino, CA",
        "date": "10/27/2023 04:01PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-lmi-technologies-3766003897?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=h9MZHua1LX31MXS6teNB0w%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solution Engineer",
        "company_name": "Earnix",
        "company_logo": "https://media.licdn.com/dms/image/D4D0BAQEKrrMNWx9r_A/company-logo_100_100/0/1688289756369/earnix_logo?e=2147483647&v=beta&t=nVfmQdTBpxRsIf3lwz7XvtnrZGkYaPjEo6ZkZPPIr-k",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Analyst, Business Development, and Consulting, Industries: IT Services and IT Consulting and Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<p>Join our rapidly growing team in a leading fintech growth company serving the insurance and banking industries. We're looking for a talented and entrepreneurial team player to join our team in Boston to help further accelerate our growth by developing technical solutions for the largest insurance carriers' business challenges around pricing, rating and personalization.</p><p>As the Business Solution Consultant Insurance, North America you will own the technical sales process. Reporting to the Head of Business Solution Consulting, Insurance, North America you will help uncover customer business goals, needs, and pain points that relate to the Earnix platform and demonstrate how the Earnix suite of products aligns with the insurance carrier's vision.</p><p><br/></p><p>As a Solutions Engineer you will own the analytical portion of the sales process. You will help uncover customer analytical needs and pain points that relate to the Earnix platform and demonstrate how the Earnix suite of products aligns with the insurance carrier's vision.</p><p><br/></p><p><strong>What you’ll do:</strong></p><ul><li>Own the technical and analytical side of the sales process, end-to-end</li><li>Become the trusted advisor to a wide variety of insurance professionals from practitioners to executives.</li><li>Partner with Sales Directors to uncover and understand customer needs and requirements and build a solution around the Earnix system to solve customer needs.</li><li>Understand the technical and functional parts of Earnix products and run technical product demonstration</li><li>Develop a crisp, personalized, and convincing story and value proposition that underpins the technical presentation.</li><li>Align with internal stakeholders in Technical, Product, and other groups and work with them to deliver a solution for the customer.</li><li>Manage the technical responses to RFPs and RFIs.</li><li>Stay on top of industry news, and technology trends, and provide thought leadership around analytics and price systemization in insurance</li><li>(including leading regular webinars)</li><li>Willingness to travel to clients and prospects upon request</li></ul><p><br/></p><p><strong>You’ll do it using:</strong></p><ul><li>Strong analytical skills, including experience in data science, BI, predictive modeling, pricing, or economic consulting</li><li>Strong background in the insurance industry with in-depth knowledge of P&amp;C insurance practices.</li><li>Ability to talk on a peer-to-peer level with senior insurance executives, including Heads of LOBs, Heads of Products, CIOs, and business teams such as Pricing, Actuarial, IT, and Product teams at the largest insurance carriers.</li><li>Demonstrate practical experience with data analysis tools and technical knowledge of modeling and pricing.</li><li>Good working knowledge of modern data science analytical tools, such as Python or R, is preferred</li><li>Ability to lead presentations and demos to large groups, and tie business problems to technical solutions. Excellent communication skills and your ability to relay and simplify complicated concepts to non-technical people while maintaining the ability to speak to highly technical people.</li></ul><p><br/></p><p><strong>You’ll excel by:</strong></p><ul><li>Playing an integral part in a scaling sales machine</li><li>Finding solutions to our customers’ business problems</li><li>Motivating people who do not report to you to work with you</li><li>Collaborating seamlessly with the global Solution Engineering team</li><li>Thinking like an owner (having a \"founder's mindset\")</li><li>Focusing on the art of the possible</li><li>Communicating with honesty, candor, and respect</li><li>Being resourceful and creative</li></ul><p><br/></p><p><strong><span class=\"ql-cursor\"> </span>You’ll love it because:</strong></p><ul><li>You will be working in the trenches at the forefront of the organization's growth in an incredibly impactful role.</li><li>You will have the opportunity to work in a successful, fast-moving, mission-driven company.</li><li>You will have autonomy and growth opportunities.</li><li>You will collaborate with other driven and incredibly bright team members.</li><li>Earnix has competitive benefits with an all-for-one mentality.</li></ul>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Boston, MA",
        "date": "10/30/2023 04:01PM",
        "url": "https://www.linkedin.com/jobs/view/solution-engineer-at-earnix-3731383034?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=g7sGJdguGcjsn4J62x0JJQ%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Oden Technologies",
        "company_logo": "https://media.licdn.com/dms/image/C4D0BAQEDaYbx994K9A/company-logo_100_100/0/1630536348602/oden_technologies_ltd__logo?e=2147483647&v=beta&t=aaqMzZvlagaecajl1Aavp9_giPQqzf9h_UTPOJobIYM",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>About Oden:<br/><br/></strong>We are in a new industrial revolution. Access to manufacturing analytics has transformed from a luxury to a necessity for running a thriving factory. Labor shortages, increased material costs, fragile supply chains, rising global demand, and more advanced product designs mean it’s more important than ever for manufacturers to be agile and efficient. Leading manufacturers partner with Oden Technologies to leverage data in their day-to-day operations, enabling them to excel in this highly competitive and ever-evolving landscape.<br/><br/>One of the driving forces behind this change is the challenge of hiring and retaining front-line staff, as the industry often faces annual turnover of over 70%. Knowledge transfer and training are impeded by fragmented and siloed manufacturing data. We are revolutionizing the way plant-floor staff access and use data, helping workers become domain experts and high performers, faster.<br/><br/>Our manufacturing analytics solution aggregates and translates billions of data points generated in production into actionable intelligence for engineering and operations teams. With Oden, they gain unprecedented insights that drive a rapid and impactful decision-making process. No longer do they need to rely on IT, analysts, or data scientists—our solution empowers front-line teams to make independent, data-driven decisions. This democratizes decision-making,fosters a better working environment for front-line staff, and saves millions of dollars worth of wasted material, energy, and time per factory every year<br/><br/>Join a team solving real, impactful, and challenging problems. Let's shape a future where manufacturers and their front-line teams are equipped with the tools and knowledge to thrive in this new era of industry.<br/><br/><strong>You</strong>:<br/><br/><ul><li>Care about the mission of the product and company.</li><li>Are never satisfied with the way things are, but excited about the way things could be.</li><li>Embrace data and different technologies and want to see how they can work together.</li><li>Empathize with customer needs and enjoy novel ways of posing and solving their problems.</li><li>Live by transparent and scientific thinking. You put in the work to find the best ideas with those around you.</li><li>Are happy to put on steel toe boots and hit the factory floor to work with the production manager.<br/><br/><br/></li></ul><strong>The Role:<br/><br/></strong>As a Solutions Engineer, you’ll apply your critical thinking and technical skills to help organizations identify what data sources they need to integrate into Oden, and help them implement the integrations in a way that drives value for their business. Solutions Engineers work directly with customers to quickly understand their factory systems, infrastructure, and data model, then implement these customer-side solutions to integrate relevant data with Oden. Manufacturers face all sorts of challenges from performance and process optimization to quality improvement and scrap reduction. By iterating quickly with customers and creating something impactful on the order of days or weeks, Solutions Engineers play a critical role in enabling one of Oden’s key value propositions, time-to-value.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Meet with customers to understand their infrastructure</li><li>Work with our solutions architecture team to build out an architecture that allows a factory site to integrate with the Oden platform</li><li>Develop best-practices and reusable tools to drive rapid integrations and scaling across multiple plants and customers</li><li>Execute solutions with customers and support the various steps of the implementation</li><li>Work with key stakeholders to identify gaps and recommend solutions</li><li>Work with automation engineers and systems integrators to execute integrations</li><li>Various troubleshooting and support activities to achieve complete integrations</li><li>Hands-on implementation and configuration of integrations using commercial factory systems such as Kepware, Ignition, OPC Router, and others.<br/><br/><br/></li></ul><strong>Required Qualifications:<br/><br/></strong><ul><li>3+ years experience working in enterprise environments on digital transformation projects, integration, and adoption either as a Consultant or Lean Expert, or as a solutions engineer for a 3rd-party SaaS vendor. Experience working in manufacturing is a plus. ETL processing of reports and data entry forms</li><li>Programming experience:</li><li></li><ul><li>Scripting (powershell, bash, python, or similar)</li><li>Writing SQL queries</li><li>Making REST API calls<br/><br/></li></ul></ul> <br/><br/><ul><li>Experience with the following technologies</li><li></li><li>Windows and Linux Operating Systems and administration</li><li>Enterprise networking, troubleshooting, architecture</li><li>Deploying and troubleshooting remote applications</li></ul><ul><li>Strong writing skills for creating technical documentation</li><li>Experience in process optimization or change management and ability to help guide customers to own solution after implementation</li><li>Excellent communication skills</li><li>Curiosity and enthusiasm about technology</li><li>Strong project management and self-organization skills</li><li>Ability to multi-task across multiple clients &amp; priorities</li><li>Comfort in a startup environment - ability to move quickly and wear many hats<br/><br/><br/></li></ul><strong>What We Offer You:<br/><br/></strong><ul><li>Measurable impact on the world and the chance to help real people - family businesses, entrepreneurs, engineers.</li><li>An opportunity to build lasting, collaborative relationships with visionary C-level clients in the manufacturing, Industry 4.0, and AI spaces</li><li>A platform that has the potential to evolve beyond what we have envisioned now.</li><li>Scientific and transparent thinking, for everyone involved.<br/><br/><br/></li></ul>We’re an equal opportunity employer (EOE).<br/><br/>Diversity at Oden means building a team that is rich across all boundaries of race, ethnicity, gender identification, sexual orientation, disability, religion, age and thinking style. We welcome all backgrounds, life experiences, and worldviews as this is the catalyst for the rapid evolution of our product and our organization. Diversity allows us to tackle new challenges, embrace change, make well-informed decisions, and ultimately Make Things Better. In alignment with our “People First” company value, Oden has a passionate internal team dedicated to the promotion of diversity and inclusion initiatives as a core component of our culture.<br/><br/>Our diversity initiatives apply to our practices and policies on recruiting, compensation and benefits; professional development; promotions; social activities, and the ongoing development of a psychologically safe work environment.\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "New York, NY",
        "date": "11/21/2023 04:01PM",
        "url": "https://odentech.hire.trakstar.com/jobs/fk0spbq?pjb_hash=Y7bAmjMPq4"
    },
    {
        "job_title": "Application Engineer",
        "company_name": "Gradiant",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQF7x2xfcPdsmw/company-logo_100_100/0/1683821521584?e=2147483647&v=beta&t=0Y1s3gD2HbPZbhcfthpJGduLo7xMPE9jIBGuacjFo7Q",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Environmental Services",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<p>The Application Engineer is an important technical role responsible for providing expertise and support in the design, estimation, and proposal of water treatment solutions for various clients. This position involves working closely with the sales team and internal engineering teams to ensure a competitive design and commercial offering for a diverse set of water treatment projects. The Application Engineer plays a key role in optimizing processes, solving complex water challenges, and ensuring client satisfaction.</p><p><br/></p><p><strong>Key Responsibilities:</strong></p><ul><li>Support the Sales team in collaborating with clients to understand their water treatment needs, specific challenges, and regulatory requirements</li><li>Conduct on-site assessments and gather data to develop tailored treatment solutions</li><li>Design customized water treatment solutions, considering factors such as process efficiency, performance, environmental compliance, and cost-effectiveness</li><li>Prepare detailed process flow diagrams (PFDs), equipment specifications, and technical proposals</li><li>Coordinate with cross-functional teams, including Sales, engineers, estimators, and contractors</li><li>Provide technical expertise and support to sales teams during client presentations, ensuring clear and accurate communication of technical information</li><li>Stay up-to-date with advancements in water treatment technologies and share knowledge within the organization</li></ul><p><br/></p><p><strong>Qualifications:</strong></p><ul><li>3+ years of experience within the water treatment sector (experience developing process designs, cost estimates, and proposals is a plus)</li><li>Bachelor's degree in Chemical Engineering, Mechanical Engineering, or a related field</li><li>Knowledge of water treatment technologies, equipment, and processes</li><li>Problem-solving mindset and the ability to work independently and in cross-functional teams</li><li>Detail-oriented with a commitment to delivering high-quality solutions</li><li>Ability to thrive in a fast-paced, dynamic environment</li><li>Excellent communication skills (the ability to write well is required)</li><li>Ability to travel (10%) to meet with clients and contractors</li></ul><p></p>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "United States",
        "date": "11/27/2023 04:02PM",
        "url": "https://www.linkedin.com/jobs/view/application-engineer-at-gradiant-3773797335?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=culoHZIpvBHd9X%2B7WRpdxQ%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "thirdweb",
        "company_logo": "https://media.licdn.com/dms/image/C4D0BAQHsOeVcYNVODw/company-logo_100_100/0/1635850598189/nftlabs_logo?e=2147483647&v=beta&t=kTxlH3HxD2DObKGiBGg22KFIbboXvK3ffzdjKaXtqT4",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<ul><li>What is thirdweb? *</li></ul><p><br/></p>Glad you asked!<p><br/></p>We’re empowering builders to create a new generation of the internet.<p><br/></p>Cool. So, what does that mean?<p><br/></p>We make building in web3 incredibly easy. Our tools help everyone from developers to creators build the web3 apps and features of their dreams.<p><br/></p>Y’know, no one knows what exactly the future of web3 will look like, but what we do know is that it will a transformative impact on our world. That’s why we’re focused on unleashing the many promises of web3 to a whole generation of builders. Because when builders have the right tools at their fingertips—magic happens.<p><br/></p>We started thirdweb in the second half of 2021 and our community of builders has exploded ever since. Over 1M unique wallets have interacted with our contracts on mainnet, deploying tens of thousands of projects to the same. It’s been a hell of a journey so far, and the momentum is only increasing.<p><br/></p>We’re looking to grow our team to help us become the default platform of choice for anyone who wants to build web3 apps and services.<p><br/></p><strong>Our Founders</strong><p><br/></p>thirdweb was founded by builders with deep experience in tech and a track record of creating epic companies: Furqan Rydhan, previous Founder and CTO of Applovin (IPO), and CTO of Bebo (Acquired by Amazon); and Steven Bartlett, previous Founder and CEO of Social Chain (IPO). Now they’ve got their sights set on a new challenge, and are building a bold team to pave the way with them.<p><br/></p><strong>What We Offer</strong><p><br/></p><ul><li>🧾 Competitive salary, equity, 401K</li><li>👩‍⚕️ Full healthcare, vision, dental</li><li>⌨️ $1,500 home office equipment stipend</li><li>💻 Latest and greatest laptop of your choice</li><li>💪 Physical and mental wellness programs</li><li>🏢 Office stipend to rent out-of-home office space</li><li>✈️ The ability to work remotely or in one of our stunning office spaces in Fort Mason, San Francisco and Williamsburg, Brooklyn.</li></ul><p><br/></p><strong>The Role</strong><p><br/></p>We’re looking for a web3 Solution Engineer specialist to help guide our high-touch clients from the beginning of their web3 journey through to successful launch of their projects<p><br/></p><strong>What We're Looking For</strong><p><br/></p><ul><li>3+ years as a client-facing solutions architect, sales engineer, integrations engineer or strongly analogous role in an API-based SaaS or gaming company.</li><li>1-2 years of experience in crypto, NFTs and a passion to stay on top of the web3 and NFT ecosystem</li><li>Comfortable talking about technical concepts and explaining how they work to both technical and non-technical audiences, both from a product feature and API architecture perspective</li><li>Experience designing solutions of an API based product (technical architecture/solutions architecture)</li><li>Experience in taking an end-end business process and designing the appropriate API integrations for desired business value outcomes</li><li>Comfortable building rapid proof of concept and prototypes</li><li>Strong verbal and written communication abilities in English</li></ul><p><br/></p><strong>Responsibilities</strong><p><br/></p><ul><li>Provide technical and architectural advice to both business stakeholders and developers through various stages of the project lifecycle</li><li>Actively drive and manage the technology evaluation stage of the sales process, working in conjunction with the sales team as the key technical adviser and product advocate</li><li>Design web3 solution architecture, presenting all aspects of proposed solutions to a wide variety of business and technical audiences</li><li>Assist in the production of sales collateral and proposals to enterprise clients and their development teams</li><li>Combine technical creativity and business acumen, and you will illustrate the value that thirdweb’s platform and tools can provide</li></ul><p><br/></p><strong>How We Work</strong><p><br/></p><ul><li>thirdweb employees are guided by five values that underpin how we show up everyday.</li><li>Our Unwavering Conviction drives us to keep building—regardless of what’s happening in the markets. Because we believe that the future of web3 is everyone’s to create.</li><li>We are Dreamers-Who-Do. While we love to spend time imagining the possibilities we always favor taking action above all else.</li><li>Each of us are Students of Web3. Whether you have 10 days of experience in web3 or 10 years, no one’s got it all figured out. We grow together.</li><li>We Think Big, then iterate our way forward. This isn’t about features, this is about freedom. How can we fully empower web3 builders to create a new world?</li><li>We’re customer-obsessed and we’re Deep Listeners because of it. Our product development is heavily guided by our community so we cherish feedback from all of our users.</li></ul><p><br/></p><strong>Offices in SF and NYC</strong><p><br/></p>We have offices on both coasts of the US. While it’s not a requirement to work out of our offices, our team really enjoys the energy we create IRL. That means some of us choose to live near an office, while others fly in from time-to-time. But regardless of how close you are, we intentionally set dedicated time each year to come together as a team.<p><br/></p>Our San Francisco office is located in Fort Mason and is surrounded by some amazing greenery and a beautiful view of the bay waters and the Golden Gate Bridge. We’re also surrounded by tons of amazing builders and entrepreneurs at the Founders, Inc. founder lab.<p><br/></p>Our New York office is in happenin’ Williamsburg, Brooklyn in a private office located at the Brass Factory, home to a fun community of web3 companies\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "San Francisco, CA",
        "date": "05/27/2023 04:02PM",
        "url": "https://wellfound.com/jobs/2354252-solutions-engineer?utm_campaign=linkedin_syndication&utm_source=linkedin"
    },
    {
        "job_title": "Enterprise Solutions Architect",
        "company_name": "Robert Half",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQFP6-a3z7Fm8Q/company-logo_100_100/0/1696341221977/robert_half_international_logo?e=2147483647&v=beta&t=bEiN5BCeElOLCcC8_YBaV9u7oNwig23-OSsa-qGORvI",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Staffing and Recruiting",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<p>The Enterprise Solutions Architect organizes the lifecycle of new development on future and existing products. Some responsibilities include reviewing product requirements, designing product architecture, and managing daily product development efforts. The Enterprise Solutions Architect will be responsible for managing complex interactions between business processes and technologies as well as translating product specifications into production level applications.</p><p><br/></p><p>Your responsibilities in this role</p><p><br/></p><p>- Manage the timeline for product development.</p><p><br/></p><p>- Conduct code reviews -- identifying best practices and efficiency steps for increased stability and capability.</p><p><br/></p><p>- Play a hands-on role in code development for web-based n-tier applications.</p><p><br/></p><p>- Set and grow development standards, guidelines, procedures, processes, and metrics.</p><p><br/></p><p>- Along with the product team, work to understand requirements and create functionality specifications.</p><p><br/></p><p>- Govern the deployment of alpha and beta releases during the stabilization of new product development.</p><p><br/></p><p>- Help with product release planning and assessing feature viability/effort.</p><p><br/></p><p>- Carry out other related duties as assigned by management.</p><p><br/></p><p>- Develop cross-product frameworks and best practices, and design, establish, and maintain technical architecture standards.</p><p><br/></p><p>- Mentor developers by providing technical and non-technical help and oversight- Support writing the technical section of functional specifications for new product development.</p><p><br/></p><p>- Invent and document solutions to product specifications for shared capabilities throughout the architecture.</p><p><br/></p><p>- Help team members so that they grow abilities and strengthen capabilities.</p>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Southfield, MI",
        "date": "11/27/2023 04:02PM",
        "url": "https://www.linkedin.com/jobs/view/enterprise-solutions-architect-at-robert-half-3766956264?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=c%2Bmg6%2F5eIIT37LZ4s1UEeQ%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "iBase-t",
        "company_logo": "https://media.licdn.com/dms/image/D560BAQEdDb5Tbic3mg/company-logo_100_100/0/1684033690464/ibaset_logo?e=2147483647&v=beta&t=0JgJi3cIPDaLXanGwghR6xFmbhkEzEPXaNeKBi0K2j8",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Sales, Industries: Technology, Information and Internet",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>About The Company</strong><p><br/></p>Headquartered in Lake Forest, California, iBase-t simplifies complex manufacturing. Its solutions replace disparate production, quality, and MRO applications with paperless, digitally integrated solutions. From process and inspection, planning to the shop floor, and the execution of sustainment activities, iBase-t is a proven, pre-configured, and out-of-the-box solutions deliver real-time visibility and control that accelerates manufacturing performance.<p><br/></p>We apply that same dedication to creating a diverse and inclusive work culture that inspires our core values: Professionalism, Excellence, Teamwork<em>, Continuous Improvement, Customer Focus and Innovation.</em><p><br/></p>We believe our team members are the best in the business, and we will continue to recruit, retain, develop and reward our most important asset – our people!<p><br/></p><strong>Solution Engineer</strong> supports the sales team to gain new customers and help drive business growth. They will be motivated risk takers and team players. Solution Engineers are strategic and focused thinkers who understand their prospects’ business and how the iBASEt solutions deliver value inside and out. They have the courage and poise to quickly develop relationships and to get through to the right decision makers and make an impact upon the customer’s sales. They have experience in managing individual as well as team targets and have a natural flair for selling. To thrive in this role, you will be an overachiever who is always pushing yourself to do more. You will be able to positively overcome resistance to gain commitment, establishing long term client relationships and help make iBASEt’s concepts simple and compelling. You enjoy taking a problem and converting into relatable ideas your customer can understand. You are both a logical visionary, technically minded and can quickly assess a situation and adjust your presentation, discussion, and focus to the audience level.<p><br/></p><strong>Essential Functions:</strong><p><br/></p><ul><li>Partner with and support the Account Executives (AE) to accelerate iBase-t software revenue growth. </li><li>Collaborate with AE team and provide input on region and client account plans as necessary. </li><li>Assist in business case development – value of iBase-t solutions against client strategic objectives. </li><li>Provide and deliver technical presentations and demonstrations to describe how iBase-t products will best meet the customer’s business and technical requirements. </li><li>Develop a strong ability to deliver targeted messaging around iBase-t and customer initiatives. </li><li>Become proficient in all iBase-t solutions – with the ability to present and demonstrate against client requirements. </li><li>Evaluate product/service marketability in terms of customers’ technical and manufacturing needs. </li><li>Develop and deliver workshops and product demonstrations. </li><li>Maintain up-to-date awareness of activities, industry trends &amp; government regulations. </li><li>Establish long-term, ongoing customer relationships. </li><li>Describe industry best practices to prospects in an effective manner. </li><li>Provide fundamental training and best practices. </li><li>Lead or assist with Return on Investment (ROI) evaluations. </li><li>Recommend solution enhancements or modifications to customers. </li><li>Team with product development and R&amp;D departments to drive customer value for roadmap and future capabilities. </li><li>Relay customer needs/wants back to Product to drive development priority. </li><li>Assist in all aspects of bringing an account to closure. </li><li>Support services implementations as requested. </li><li>Support partner sales as requested. </li><li>Support marketing activities through presenting product and industry knowledge via webinars, conferences, website materials and other marketing collateral </li></ul><p><br/></p><strong>Requirements:</strong><p><br/></p><ul><li>Knowledge of Aerospace &amp; Defense manufacturing processes </li><li>Extremely detail oriented and customer focused. </li><li>Analytical nature with the ability to solve complex business issues. </li><li>Excellent knowledge of basic computer systems functions &amp; MS Office Suite </li><li>Excellent communication and customer relations skills, both written and oral, with the ability to build effective customer relationships. </li><li>Well-developed presentation skills </li><li>Ability to work and problem solve individually as well as in team setting. </li><li>Hands-on experience with iBASEt Solumina, Product Lifecycle Management systems (e.g., PTC Windchill, Siemens Teamcenter), Enterprise Resource Planning systems (SAP, Oracle, IFS, Infor) or Salesforce CRM </li><li>Past software deployment experience (e.g., MES, PLM, ERP) </li><li>Experience with general consulting skills that include team facilitation, business case development, strong business analysis skills, process mapping, and business process redesigning. </li><li>Knowledge of basic IT functions: server/VM configuration, authentication factors (SAML, SSO, LDAP), certificate authority (SSL) </li><li>Competency with Atlassian (Confluence, Jira), Roadmonk or Zendesk products </li><li>Must be able to travel nationally, up to 50% at times, providing on-site consulting work to clients and can work remotely from your home office</li></ul><p><br/></p>Salary Midpoint $110,000.00<p><br/></p><strong>Requirements</strong><p><br/></p><ul><li>Bachelor's degree in technical or business-related field</li><li>Five or more years of hands-on experience in complex discrete manufacturing such as aerospace, medical devices, defense, or other highly regulated manufactured products and their supply chain</li><li>Three or more years' experience working with an electronic execution system (e.g., MES, MoM, PLM) </li></ul><p><br/></p><strong>Benefits</strong><p><br/></p>We are committed to offering the best to our employees. We offer a comprehensive benefits package that includes:<p><br/></p><ul><li>Competitive salary</li><li>Yearly Performance Bonuses</li><li>Referral Bonuses</li><li>Comprehensive Medical/Dental/Vision Plans</li><li>Company Paid LTD/STD</li><li>Company Paid Life Insurance</li><li>HSA/FSA</li><li>Unlimited Vacation</li><li>40 hours of sick time per year</li><li>Paid Holidays (10 per year)</li><li>WFH Equipment Stipend</li><li>Internet/WIFI stipend</li><li>401K - company match</li><li>Educational Assistance Program</li></ul><p><br/></p>Our company values work-life balance, and for this offers benefits such as Remote Work, Flexible hours, and a Wellness program.\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Lake Forest, CA",
        "date": "09/27/2023 04:02PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-ibase-t-3710330715?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=H5G7oj1RhLEuVpHGaNmOiA%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Courier",
        "company_logo": "https://media.licdn.com/dms/image/C4E0BAQGuFeTsshD-cw/company-logo_100_100/0/1630634287858/trycourier_logo?e=2147483647&v=beta&t=5Q4eMr5Qd3WCmcDOPkmXhYtc_XZ7LBRzPTZ-HBbtcvE",
        "listing_details": "Seniority level: Not Applicable, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Transportation, Logistics, Supply Chain and Storage",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        At Courier, we are on a mission to make software-to-human communication delightful.<p><br/></p>Courier is doing for notifications what Stripe did for payments, making it easy for developers to build and manage notifications infrastructure for mobile and web apps. We’ve combined a powerful API with a web-based design studio that lets teams create automated product-triggered notifications that deliver the right message to the right user at the right time over email, Push, Slack, SMS—you name it.<p><br/></p>Backed by top-tier investors including Google Ventures, Bessemer Venture Partners, Matrix Partners, Twilio, SendGrid, Slack, and Y Combinator, our goal is to build a platform that developers don’t just use but one that they love. If you want to push the frontier in developer tooling, we want to work with you.<p><br/></p>We’re solving a complex and tedious problem for developers: product notification infrastructure. Companies like LinkedIn, Slack, and GitHub dedicate large engineering teams and tens of millions of dollars per year to building and maintaining the systems that power their user notifications, alerts, reminders, digests, and other programmatic communication. With Courier, the next generation of startups will be able to dedicate those resources to delivering customer value rather than reinventing the wheel.<p><br/></p>As a Solutions Engineer, you will educate and guide prospective customers on how Courier Enterprise can help them deliver a better notification experience. You will be the technical advisor during the customer's technical evaluation of Courier and responsible for ensuring they understand how Courier works. You should be passionate about helping software engineering teams work more efficiently, reduce complexity, and in general doing more with less.<p><br/></p><strong>Responsibilities</strong><p><br/></p><ul><li>Advise customers on the complexity of notification infrastructure and the different ways in which Courier can be leveraged to reduce that complexity</li><li>Create solutions to customer's pain points around notification infrastructure</li><li>Become a domain expert on notification infrastructure </li><li>Demo Courier Enterprise to technical audiences</li><li>Become a Courier product expert and communicate our value and features to potential customers</li><li>Be the voice of the customer by sharing customer feedback to the product and engineering teams<br/><br/></li></ul>Qualifications<p><br/></p><ul><li> 3+ years of experience consulting with software engineering teams</li><li>Experience building technical proof-of-concepts</li><li>Excellent communicator with the ability to simply explain complex technical concepts<br/><br/></li></ul>Our Values<p><br/></p><ul><li> Zoom Out: Don't just stay in your lane. Take the blinders off and look at the entire business</li><li> Keep It Real: Be honest about what is going well and what isn't. Celebrate wins and have hard conversations</li><li> Talk To Customers: Working with developers isn't a job role here - it is something we all need to do. Hop on a Zoom, reach out in Slack, and build a relationship</li><li> Have An Opinion: Each team member is an expert on what success will look like for Courier. Nobody else has the answers</li><li> JFDI: There will always be more work to do than people to do it. If you see something that needs to get done, just f*cking do it. Don't wait for someone else<br/></li></ul><p><br/></p>Diversity, Equity &amp; Inclusion<p><br/></p>At Courier, we believe that our diverse perspectives are our biggest strengths — and that embracing them will create real change in how software communicates with humans. As an equal opportunity employer, we are committed to building an inclusive environment where you can be you. Please don’t hesitate to ask if we can accommodate you in any way, both during the interview process and after.<p><br/></p><strong>Benefits</strong><p><br/></p><ul><li> Top of market salary</li><li> Generous equity plan</li><li> Top of the line health insurance plan (medical, dental &amp; vision) covered 100% for both you and your dependents</li><li> 401k through Vestwell</li><li> Flexible health spending account including $500 employer contribution</li><li> Unlimited paid time off (1 week per quarter required)</li><li> $100 monthly wellness stipend</li><li> 12 covered therapy sessions per year through Samata Health</li><li> A brand new workstation and credit card to cover any other necessary expenses</li><li> Free lunch in the office, DashPass covered, and $25 DoorDash credit on Fridays</li><li> $2000 annual personal development budget</li><li> $100 monthly commuter benefit contribution</li><li> Other perks and discounts through Sequoia<br/></li></ul><p><br/></p>Security &amp; Compliance<p><br/></p>Courier takes protecting our customers' data – and of their notification recipients – seriously. Every Courier employee goes through security training and a background check as part of onboarding. Each employee is expected to follow Courier's security and compliance processes and uphold industry best practices.\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "San Francisco, CA",
        "date": "05/27/2023 04:03PM",
        "url": "https://jobs.lever.co/trycourier/cbd10d22-0c4a-4057-a1ce-a2392362e9ea/apply?lever-source=LinkedIn"
    },
    {
        "job_title": "Applications Engineer",
        "company_name": "gpac",
        "company_logo": "https://media.licdn.com/dms/image/C4D0BAQEuHCzGagGoTA/company-logo_100_100/0/1630511672137/gpac_logo?e=2147483647&v=beta&t=wSLP_I78KXFVo81ZQ1Gu8kHe7b_dncazvsFw4tgqjk4",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Transportation, Logistics, Supply Chain and Storage",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        This forward-thinking manufacturer with a rich history spanning almost 100 years. This family-owned company is dedicated to nourishing the world through innovative solutions that connect people, equipment, and technology to enhance throughput, efficiency, and quality. With a global workforce of over 700 employees, we are committed to delivering excellence.<br/><br/><strong>Job Summary<br/><br/></strong>As Applications Engineer you will play a pivotal role in our Engineering team. You will be responsible for enhancing existing products and developing new ones by leveraging your expertise in technology, materials, and manufacturing methods. Your work will encompass various aspects of the design process, including conceptualization, modeling, testing, and prototype production when necessary. Collaborating closely with engineers, manufacturing experts, product managers, and the commercial team, you will conduct in-depth research and craft innovative design proposals for projects. Additionally, you will maintain direct contact and engage with key customer decision makers.<br/><br/>The Manufacturing Engineer's primary duty is to bridge the gap between equipment standards, customer requirements, and strategic value-stream objectives during the business development phase. This entails translating customer needs into product features and ensuring a clear understanding of the value-to-value exchange with the customer. You will also serve as the technical authority within your assigned value-stream.<br/><br/><strong>Key Responsibilities<br/><br/></strong><ul><li>Initiate and lead project discussions with customers.</li><li>Identify and establish minimum project requirements.</li><li>Develop preliminary conceptual designs.</li><li>Oversee the back-end design and production launch processes.</li><li>Actively listen to customer and stakeholder feedback throughout all project phases.<br/><br/></li></ul><strong>Qualifications<br/><br/></strong><ul><li>Bachelor's Degree in Engineering from an accredited institution.</li><li>Previous experience in design and development.</li><li>Excellent communication skills, both written and verbal.</li><li>Ability to collaborate effectively with cross-functional teams, including engineering, manufacturing, sales, and customer service.</li><li>Strong problem-solving capabilities.</li><li>Experience with Lean manufacturing principles.<br/><br/></li></ul>If you are a proactive and innovative Engineer who enjoys engaging with customers, driving projects from concept to production, and contributing to the growth of a dynamic company, reach out to me today! Your passion and expertise will help to continue the mission of this great company!<br/><br/><strong>Please submit a resume for consideration. Only the most qualified applicants who provide a resume will be contacted.</strong> If you would like to learn more about Manufacturing opportunities, contact Dan Poel with gpac. Resumes can be confidentially sent to dan.poel@gogpac.com<br/><br/>#manufacturing #engineering #engineer #food #appliances #applicationengineer #applicationengineer #manufacturingengineer engineer engineer engineer manufacturing engineer manufacturing engineer<br/><br/>All qualified applicants will receive consideration without regard to race, age, color, sex (including pregnancy), religion, national origin, disability, sexual orientation, gender identity, marital status, military status, genetic information, or any other status protected by applicable laws or regulations.<br/><br/>GPAC (Growing People and Companies) is an award-winning search firm specializing in placing quality professionals within multiple industries across the United States since 1990. We are extremely competitive, client-focused and realize that our value is in our ability to deliver the right solutions at the right time.<br/><br/>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Sedalia, MO",
        "date": "11/23/2023 04:03PM",
        "url": "https://www.linkedin.com/jobs/view/applications-engineer-at-gpac-3772199880?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=CvgVD8I7KVv3Cpdh0A0TYw%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "BuildBuddy",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQFuNsl4dZV1mw/company-logo_100_100/0/1630602703455/flame_build_logo?e=2147483647&v=beta&t=klTHgL9GPgAWcw3eqC_X_eQwoHUpa0xmzldN_ZtLzhM",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        BuildBuddy was founded to make developers more productive. Today we're solving a small piece of this problem with an open-core remote build execution platform for Bazel - but our ambitions are much larger. Our mission is to take the world class engineering tools that are only available to employees of large companies and make them available to everyone.<p><br/></p>This is a unique opportunity to shape the future of how engineers build and test software. You’ll be working directly with engineering organizations developing the most cutting-edge tech.<p><br/></p>You will - Build a great customer experience for our users (other engineers!) - Define and prioritize product features, goals, roadmap, and strategy based on your frontline knowledge of customer needs - Design, build, test, deploy, and maintain reliable software - Debug complex production issues across the stack - Resolve customer issues via email, Slack, and video conferencing - Become a trusted technical advisor to our customers - Create or update documentation based on customer interactions - Continually research and learn the current and future best practices of using Bazel<p><br/></p>We're looking for someone who - Cares deeply about creating the best possible experience for our customers - Can lead technical discussions and help drive technical decisions - Is comfortable with ambiguity and working outside of their comfort zone - Can manage priorities well when there's a lot to be done - Holds yourself and others to a high bar when working with production - Is able to write high quality code in a programming language (e.g. Golang, Typescript) - Has knowledge of DevOps methodologies and appreciates the value technologies like Kubernetes bring to the software deployment and development process - Is experienced with build tools and CI/CD.<p><br/></p>Who you'll work with - Tyler Williams - GitHub: @tylerwilliams, Twitter: @tylerbw - Siggi Simonarson - GitHub: @siggisim, Twitter: @siggi - Brandon Duffany - GitHub: @bduffany, Twitter: @brandon_duffany - Vadim Berezniker - GitHub: @vadimberezniker<p><br/></p>What's it like to work at BuildBuddy? - We're a small team of builders that value getting things done over busywork - We value curiosity and encourage employees to contribute to open source projects - We aim to create a warm &amp; welcoming work environment - We treat our coworkers well, and offer platinum health benefits at no cost to employees - We offer generous equity &amp; comp packages, and reward those that help the company grow - We work remotely, but are loosely based out of the San Francisco Bay Area\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "United States",
        "date": "07/27/2023 04:03PM",
        "url": "https://www.ycombinator.com/companies/buildbuddy/jobs/wAdl3At-solutions-engineer?utm_source=syn_li"
    }
]