[
    {
        "job_title": "Solutions Engineer",
        "company_name": "Merge",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQFvoHzPQsWueQ/company-logo_100_100/0/1688654203005/merge_api_logo?e=2147483647&v=beta&t=SrPd6c5UxSvcckgqeJ7thXejWeg3zqJ-URNMtTStcvE",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Technology, Information and Internet",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        At Merge, we revolutionize the way B2B companies integrate. Unfamiliar with the integration problem? The average company expects to spend hundreds of hours a year integrating with dozens or more vendors. Alignment between sales, partnerships, product management, design, engineering, and customer success (a lot, right?) is absolutely critical — and a major headache. Integrations are a to-do that goes on and on.<br/><br/>Our Unified API empowers developers to offer integrations with hundreds of platforms instantly. Now we're hiring for you: an ambitious leader ready to help build, design, and support enterprise-grade software scaled to millions of users.<br/><br/>Are you ready to be part of a team redefining how companies build for the future? Apply now!<br/><br/><strong>Solutions Engineering at Merge<br/><br/></strong>As a Solutions Engineer, you will be responsible for all technical activities with current and prospective customers while they integrate with Merge, including building out proofs of concepts, problem-solving, leading training, and giving demos. You'll work closely with engineering and platform teams to prioritize customer feature requests, squash bugs, and help strategize on our product roadmap. Projects you'll work on as a Solutions Engineer will be high value and high impact, with increased levels of internal and external visibility.<br/><br/><strong>Responsibilities:<br/><br/></strong><ul><li>Lead as the key technical contact for customers and partners as they integrate with Merge</li><li>Take ownership of customer relationships and ensure a seamless developer experience</li><li>Work with engineering and platform teams to highlight any product improvements based on customer insights</li><li>Onboard new customers by providing technical demonstrations and training</li><li>Create the foundation for a successful and rapidly growing solutions engineering team!<br/><br/></li></ul><strong>Experience:<br/><br/></strong><ul><li>2+ years in solutions engineering, sales engineering, or software engineering</li><li>Computer science background or other technical/quantitative orientation</li><li>Strong verbal and written communication skills</li><li>Strong work ethic, goal-oriented, and great attention to detail</li><li>Prior startup experience is a plus<br/><br/></li></ul><strong>Compensation<br/><br/></strong><ul><li>The cash compensation range for this role is $100,000 - $140,000. </li><li>Actual compensation packages are based on a wide array of factors unique to each candidate, including but not limited to skill set, years &amp; depth of experience, certifications. In addition to cash compensation, all employees receive an equity compensation package. <br/><br/></li></ul><strong>Benefits:<br/><br/></strong><ul><li>Unlimited PTO + 10 company holidays</li><li>Quality health, vision, and dental insurance</li><li>401K Plan</li><li>$200 one-time home office stipend</li><li>Free dinner when working past 7pm<br/><br/></li></ul><em>Merge is an equal opportunity employer, and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other protected class.</em>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "New York, NY",
        "date": "11/13/2023 04:03PM",
        "url": "https://boards.greenhouse.io/merge/jobs/5020329004?gh_src=48d7f74c4us"
    },
    {
        "job_title": "ENTRUST Solutions Group - Sr. Consulting Engineer (Generator) - REMOTE - 118",
        "company_name": "ENTRUST Solutions Group",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQF87t4tkwRABA/company-logo_100_100/0/1659029183681/en_engineering_logo?e=2147483647&v=beta&t=rR-tm-HlKt2IH-I4o1ga4MbWSDRSxh0CWkX6fj6UMT0",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Utilities",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>What You’ll Do:<br/><br/></strong><ul><li>Demonstrate technical expertise in areas relevant to turbine &amp; generator engineering that allows for project execution without additional technical coaching</li><li>Subject matter expert and company resource for power plant consulting projects with respect to electrical generators and auxiliaries</li><li>Interpret project objectives and develop actionable project plan to ensure schedule and hour targets are met or exceeded as well as complete preparations needed for client meetings</li><li>Assists management with business opportunities, conferences, and trainings and interface with industry organizations such as EPRI.</li><li>Field project execution up to approximately 25% which may require short notice and off hours to address emergent client needs and energy market schedule<br/><br/></li></ul><strong>Required Qualifications: <br/><br/></strong><ul><li>Bachelor’s of Science Degree in Engineering (or greater)</li><li>8-10+ years of demonstrated generator design, manufacture or service related job experience </li><li>Proficient in applicable engineering calculations, assessments, and analysis</li><li>Travel as required to support projects and business development initiatives<br/><br/></li></ul><strong>Preferred Qualifications:<br/><br/></strong><ul><li>Professional Engineering licensure and advanced degree<br/><br/></li></ul><strong>Not quite right for you? For a full listing of all our openings, please visit us at: <br/><br/></strong>https://entrustsol.com/careers/<br/><br/><strong>Who We Are:<br/><br/></strong>ENTRUST Solutions Group, an ENR Top 100 company, is a community of people, 3,000+ strong, who are committed to our clients and each other. We provide comprehensive and dependable engineering, consulting, and automation services to gas and electric utilities, telecommunication service providers, pipeline operators, and industrial companies.<br/><br/><strong>In return for top talent, ENTRUST Solutions Group offers:<br/><br/></strong><ul><li>Generous paid time off and benefits</li><li>401(k) retirement program with a company match</li><li>Career development programs</li><li>Tuition reimbursement</li><li>Flexible work schedule<br/><br/></li></ul><strong>To learn more about ENTRUST Benefits and Culture, please visit our company LinkedIn page and follow us at: <br/><br/></strong>https://www.linkedin.com/company/entrustsolutionsgroup<br/><br/><strong><em>ENTRUST Solutions Group is proud to be an Equal Employment Opportunity employer. We celebrate diversity and do not discriminate based on race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability status, or any other applicable characteristics protected by law.<br/><br/></em></strong><strong><em>Headhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. ENTRUST Solutions Group does not accept unsolicited headhunter or agency resumes and will not pay fees to any third-party agency or company that does not have a signed agreement with ENTRUST Solutions Group.<br/><br/></em></strong>﻿<br/><br/>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "United States",
        "date": "11/13/2023 04:04PM",
        "url": "https://www.linkedin.com/jobs/view/entrust-solutions-group-sr-consulting-engineer-generator-remote-118-at-entrust-solutions-group-3714569554?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=8TML54YNW%2F71N0rkNHaErA%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Pre-Sales Engineer, Cloud",
        "company_name": "Vertice",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQHhg25DgUD4pA/company-logo_100_100/0/1665506703392/verticeone_logo?e=2147483647&v=beta&t=-yoNXAQYrhzQ4GXuXhgp8xmfh0wakYHM674-xzigvrk",
        "listing_details": "Seniority level: Mid-Senior level, Employment type: Full-time, Job function: Sales and Business Development, Industries: Technology, Information and Internet",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<strong>Location: US, New York </strong><p><br/></p>Vertice is a rapidly expanding technology company on a mission to help businesses manage their growing spend on SaaS and cloud. Businesses are turning to Vertice to gain visibility and savings on their SaaS stack and cloud spend, taking advantage of pricing insights, trend data, smart dashboards and expert negotiators.<p><br/></p>Founded by two brothers, Roy and Eldar Tuvey, with a successful history of building SaaS startups, Vertice has already become one of the fastest growing vendors in the market having raised $26million in our Series A funding.<p><br/></p>We’re well positioned to achieve our mission but we need the right people to ensure it happens. We’re looking to scale quickly but responsibly as we embark on an exciting new stage of growth. Headquartered in London, you’ll be joining a global company and working across talented cross-functional teams to drive innovation and make a significant impact.<p><br/></p><strong>Your Role at Vertice:</strong><p><br/></p>As one of the early members of our technical sales team and working closely with the wider Sales and Product teams, to provide technical expertise to support our global sales efforts, including conducting product demos for our potential customers. You will be an AWS/cloud sales expert, and be able to advise our commercial teams in detail about cloud cost optimisation and cloud infrastructure.<p><br/></p><strong>Responsibilities:</strong><p><br/></p><ul><li>Be the technical subject matter expert for prospective and existing customers globally throughout the sales process</li><li>Work with our customers to complete product demos to showcase the features and technical capabilities of our platform, while becoming a trusted partner</li><li>Work with the sales teams on strategy &amp; discovery sessions, in order to understand customer requirements, and develop targeted technical solutions</li><li>Identify the ongoing requirements of customers and partners, and recommend adjusted technical solutions in order to ensure customer success</li><li>Support the sales team in achieving revenue goals while maintaining a high level of customer satisfaction</li><li>Stay up-to-date on the latest cloud technologies and industry trends</li></ul><p><br/></p><strong>Requirements</strong><p><br/></p><ul><li>3-5 years of industry experience in a pre-sales capacity (solution engineer, sales engineer, technical sales), including AWS or other cloud expertise</li><li>Proven experience in technical sales and building successful relationships with customers</li><li>Excellent communication and interpersonal skills</li><li>Strong analytical and problem-solving skills</li><li>AWS certification preferred</li><li>Be an excellent communicator and consultative approach – strong sales skills; personable, charismatic, solutions oriented, creative thinker</li></ul><p><br/></p><strong>Why join Vertice?</strong><p><br/></p><ul><li>Be a part of a fast-growing, innovative startup that is changing the way businesses buy and sell SaaS</li><li>Work with passionate and talented teams that value your contributions and expertise</li><li>Be part of a culture that promotes a growth mindset, transparency, collaboration, understanding and diversity</li><li>Share in our success with equity options</li></ul>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "New York, United States",
        "date": "10/27/2023 04:04PM",
        "url": "https://www.linkedin.com/jobs/view/pre-sales-engineer-cloud-at-vertice-3730418977?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=cHV4CyU3Mpeu3N1UPA7Jgg%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "Solutions Engineer",
        "company_name": "Pontera",
        "company_logo": "https://media.licdn.com/dms/image/D4E0BAQHWh_S8I_2l9Q/company-logo_100_100/0/1688405582777/pontera_logo?e=2147483647&v=beta&t=vOrx2k0cFPhEC6HTDXsHK2QF5ghm-RF7WAgSWrx6GsM",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Software Development",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n        Pontera is a FinTech SaaS company on a mission to help millions of Americans retire better by enabling financial advisors to manage, rebalance, and report on 401(k) and other retirement plan accounts. Pontera customers range from Fortune 100 financial services firms and large independent broker dealers to small independent RIA’s and advisory firms.<br/><br/>At Pontera, we are proud of our people-first mentality and culture. You will have the unique and exciting opportunity to be part of a team whose mission is to scale Pontera into one of the largest FinTech companies in the world. We have significant funding from some of the most notable venture capital investors, led by Lightspeed Venture Partners, and are in a period of hyper-growth. The next critical step in our trajectory is adding to our world-class team, and that’s where you come in.<br/><br/><strong>Description<br/><br/></strong>As Solutions Engineer, you will play a critical role in our company’s growth by partnering with our Enterprise Sales team and channel partners to understand the needs of our largest customers, providing compelling solutions-based demonstrations, designing and executing proof-of-concepts, and closing business.<br/><br/><strong>Responsibilities<br/><br/></strong><ul><li>Participate in customer discovery to understand their current operational processes, what technical problems they need to solve, and map back to Pontera’s product, platforms, and solutions to ensure they reach their desired business outcome</li><li>Serve as the technical subject matter expert for prospects, clients, and integration partners on our product offerings and their technical underpinnings</li><li>Collaborate with the sales, account management, customer support, product, engineering, and R&amp;D teams to understand and document customer needs and requirements</li><li>Act as a trusted advisor and consultant to customers, offering technical insights and creative solutions while leading product implementation </li><li>Develop and maintain internal and external-facing technical documentation used in pre- and post-sales activities</li><li>Deliver compelling presentations and visualizations to technical buyers including engineering process flows and architecture diagrams, showcasing the value of our offering as well as how it integrates into the prospect’s core tech stack</li><li>Provide post-sales consultative services to customers looking to improve operational efficiency and maximize usage of the platform<br/><br/></li></ul><strong>Requirements<br/><br/></strong><ul><li>Extensive (5+ years) of professional experience as an Implementation Specialist, Sales Engineer, Solutions Engineer, or Solutions Architect role, implementing financial software, bridging the gap between business and engineering</li><li>World-class communicator capable of distilling complexity into its component parts</li><li>High IQ. Able to identify problems, understand their root causes, arrive at creative solutions, and drive them through implementation</li><li>Highly collaborative, organized, and process-driven</li><li>Self-starter with ability to work in fast paced, changing environment</li><li>Demonstrated track record of top performance</li><li>Willingness to travel 10% of the time<br/><br/></li></ul><strong>BONUS POINTS<br/><br/></strong><ul><li>Understanding of technology used by broker-dealers, RIAs, recordkeepers, and banks</li><li>Familiarity with Salesforce, Gong, Outreach, Monday.com, Tableau<br/><br/></li></ul><strong>What We Offer<br/><br/></strong><ul><li>Compensation: $125,000 to $165,000 annually</li><li>Opportunity: Have a major impact at a fast-growing startup that is revolutionizing the FinTech industry</li><li>Team Culture: A collegial, collaborative, fun work environment with frequent team events</li><li>Equity: All new hires are eligible for equity grant participation</li><li>Healthcare: Comprehensive &amp; affordable insurance benefits with a variety of plan options</li><li>Retirement: 401(k) with employer match &amp; employer-sponsored access to a retirement advisor</li><li>Family Benefits: Paid parental leave &amp; reimbursement program for family planning services (such as fertility treatments, adoption, or surrogacy</li><li>Professional Development: Sponsored learning &amp; development program (to cover classes, certifications, and more!)</li><li>Food Perks: Fully stocked kitchen &amp; lunch reimbursement program</li><li>Work Flexibility: A hybrid office work model (In-Office Tues/Weds/Thurs and WFH Mon/Fri) &amp; generous PTO day<br/><br/></li></ul>Pontera is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.\n      </div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "New York, NY",
        "date": "11/21/2023 04:04PM",
        "url": "https://www.linkedin.com/jobs/view/solutions-engineer-at-pontera-3733663569?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=J4ZszRfJz14GYTmcl50Q8A%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card"
    },
    {
        "job_title": "ENTRUST Solutions Group - Design Engineer I - Substation - 117",
        "company_name": "ENTRUST Solutions Group",
        "company_logo": "https://media.licdn.com/dms/image/C560BAQF87t4tkwRABA/company-logo_100_100/0/1659029183681/en_engineering_logo?e=2147483647&v=beta&t=rR-tm-HlKt2IH-I4o1ga4MbWSDRSxh0CWkX6fj6UMT0",
        "listing_details": "Seniority level: Entry level, Employment type: Full-time, Job function: Engineering and Information Technology, Industries: Utilities",
        "description": "<div class=\"description__text description__text--rich\">\n<section class=\"show-more-less-html\" data-max-lines=\"5\">\n<div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5 relative overflow-hidden\">\n<ul><li>NEW GRADUATES ENCOURAGED TO APPLY!*<br/><br/></li></ul>﻿<br/><br/><strong>W</strong><strong>hat You’ll Do: <br/><br/></strong><ul><li>Responsible for detailed engineering design of substations within the utilities industry</li><li>Assist in completing studies and calculations to properly design substations, including grounding calculations, lightning protection calculations, battery bank sizing calculations, conduit fill calculations, and substation sizing calculations, as well as perform AC &amp; DC substation studies</li><li>Support lead engineers and project managers on complex projects from full scope estimating and proposals, through detailed design and equipment procurement, to project construction bidding, to commissioning and construction support for energization<br/><br/></li></ul><strong>Required Qualifications: <br/><br/></strong><ul><li>Bachelor’s Degree in Electrical Engineering from an ABET accredited university or equivalent program</li><li>Ability to travel up to 25% as needed for projects and client visits<br/><br/></li></ul><strong>Preferred Qualifications: <br/><br/></strong><ul><li>Interest in obtaining or currently in process of obtaining EIT certification<br/><br/></li></ul><strong>Not quite right for you? For a full listing of all our openings, please visit us at: <br/><br/></strong>https://entrustsol.com/careers/<br/><br/><strong>Who We Are:<br/><br/></strong>ENTRUST Solutions Group, an ENR Top 100 company, is a community of people, 3,000+ strong, who are committed to our clients and each other. We provide comprehensive and dependable engineering, consulting, and automation services to gas and electric utilities, telecommunication service providers, pipeline operators, and industrial companies.<br/><br/><strong>In return for top talent, ENTRUST Solutions Group offers:<br/><br/></strong><ul><li>Generous paid time off and benefits</li><li>401(k) retirement program with a company match</li><li>Career development programs</li><li>Tuition reimbursement</li><li>Flexible work schedule<br/><br/></li></ul><strong>To learn more about ENTRUST Benefits and Culture, please visit our company LinkedIn page and follow us at: <br/><br/></strong>https://www.linkedin.com/company/entrustsolutionsgroup<br/><br/><strong><em>ENTRUST Solutions Group is proud to be an Equal Employment Opportunity employer. We celebrate diversity and do not discriminate based on race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability status, or any other applicable characteristics protected by law.<br/><br/></em></strong><strong><em>Headhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. ENTRUST Solutions Group does not accept unsolicited headhunter or agency resumes and will not pay fees to any third-party agency or company that does not have a signed agreement with ENTRUST Solutions Group.<br/><br/></em></strong>;<br/><br/>\n</div>\n<button aria-expanded=\"false\" aria-label=\", visually expands previously read content above\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--more !ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n<button aria-expanded=\"true\" aria-label=\"\" class=\"show-more-less-html__button show-more-less-button show-more-less-html__button--less !ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\">\n        \n\n        <icon aria-busy=\"false\" aria-hidden=\"true\" class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\"><svg aria-busy=\"false\" class=\"lazy-loaded\" focusable=\"false\" height=\"16\" preserveaspectratio=\"xMinYMin meet\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"></path></svg></icon>\n</button>\n</section>\n</div>",
        "location": "Denver, CO",
        "date": "11/20/2023 04:04PM",
        "url": "https://www.linkedin.com/jobs/view/entrust-solutions-group-design-engineer-i-substation-117-at-entrust-solutions-group-3747656127?refId=ntO5Nw3vSbUF3zGHjHseXQ%3D%3D&trackingId=gIRYoHdzZbL1HY%2BHBRQaJQ%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card"
    }
]